--function oldevent_542()
    instruct_1(2275,51,0);   --  1(1):[慕容复]说: 阁下是谁，到这燕子坞来所*为何事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2276,0,1);   --  1(1):[AAA]说: 在下之名不足挂齿，本来我*是来救段公子的，不过到得*此地，却发现慕容公子可以*为在下指点迷津。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2277,51,0);   --  1(1):[慕容复]说: 阁下有话就直说吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2278,0,1);   --  1(1):[AAA]说: 江湖中盛传，姑苏慕容家中*藏书丰富，天下武林奇书尽*皆收录……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2279,51,0);   --  1(1):[慕容复]说: 原来是想看我慕容家丰富的*武功秘笈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2280,0,1);   --  1(1):[AAA]说: 慕容公子误会了，在下要找*的，不是什麽武功秘笈，只*是几本小说而已。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2281,51,0);   --  1(1):[慕容复]说: 你是说……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2282,0,1);   --  1(1):[AAA]说: 十四天书！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2283,51,0);   --  1(1):[慕容复]说: 对不起，燕子坞的藏书并没*有阁下想要的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2284,0,1);   --  1(1):[AAA]说: 哦！是这样子啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2285,51,0);   --  1(1):[慕容复]说: 不过……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2286,0,0);   --  1(1):[AAA]说: 不过什麽……？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2287,51,0);   --  1(1):[慕容复]说: 不过其中一本书的下落，我*是知道的……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2288,0,1);   --  1(1):[AAA]说: 那一本书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2289,51,0);   --  1(1):[慕容复]说: 《天龙八部》。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2290,0,1);   --  1(1):[AAA]说: 真的？在那里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2291,51,0);   --  1(1):[慕容复]说: 我姑苏慕容家的成名绝技你*可知道？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2292,0,1);   --  1(1):[AAA]说: 以彼之道，还施彼身。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2293,51,0);   --  1(1):[慕容复]说: 不错。所以你要知道《天龙*八部》的下落，就要先帮我*找一些东西。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2294,0,1);   --  1(1):[AAA]说: 不知公子要找什麽东西？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2295,51,0);   --  1(1):[慕容复]说: 大燕国的传国玉玺。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2296,0,1);   --  1(1):[AAA]说: 你要玉玺？难倒你……？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2297,51,0);   --  1(1):[慕容复]说: 不错，我乃大燕慕容王孙。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2298,0,1);   --  1(1):[AAA]说: 失敬，失敬。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2299,51,0);   --  1(1):[慕容复]说: 记得，你若想知道《天龙八*部》的下落，就快去找大燕*国的传国玉玺。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,543,545,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

