--function oldevent_292()
    instruct_1(793,0,1);   --  1(1):[AAA]说: 看我的，乾坤大挪移——！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_57();   --  57(39):高昌迷宫劈门
    instruct_3(-2,3,0,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,1,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,2,1,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(9,1,1,0,293,0,0,5296,5296,5296,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(963,0,1);   --  1(1):[AAA]说: 不知道这成昆跑哪去了，应*该离此不远吧，我好好找找*。
    instruct_0();   --  0(0)::空语句(清屏)
--end

