--function oldevent_285()
    instruct_26(40,9,4,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,10,4,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,12,4,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(954,0,1);   --  1(1):[AAA]说: 谢前辈，*这是成崑的项上人头。*成崑作恶多端已遭天谴。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(955,13,0);   --  1(1):[谢逊]说: 是吗？哈！哈！*成崑啊，成崑！*你作恶多端终遭天谴，*但，可惜啊，可惜！*我不能亲手杀了你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(956,0,1);   --  1(1):[AAA]说: 成崑一事已了，谢法王能否……？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(957,13,0);   --  1(1):[谢逊]说: 少侠为我明教付出许多，谢*某感激不尽。如今成崑已死*，这本《倚天屠龙记》你就*拿去吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(155,1);   --  2(2):得到物品[倚天屠龙记][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,287,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

