--function oldevent_783()
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(3160,0,1);   --  1(1):[AAA]说: 这不是令狐少侠么？怎么样*？玄慈大师是否已经传授你*易筋经了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3161,35,0);   --  1(1):[令狐冲]说: 没有，玄慈大师说易筋经只*能传授给本门弟子，要在下*改投少林门下。在下不肯，*向方丈辞行后就出来了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3162,0,1);   --  1(1):[AAA]说: 那位姑娘呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3163,35,0);   --  1(1):[令狐冲]说: 什么姑娘啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3164,0,0);   --  1(1):[AAA]说: 就是教你学琴的那位姑娘啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3165,35,0);   --  1(1):[令狐冲]说: 你是说盈盈啊，她怎么了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3166,0,1);   --  1(1):[AAA]说: 那日我们来到少室山下，你*就晕倒了，是她送你上的少*林寺啊。现在你下山了，她*人呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3167,35,0);   --  1(1):[令狐冲]说: 我不知道啊，也许早就下山*了吧。唉，真难为她了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3168,0,1);   --  1(1):[AAA]说: 咦？那边好像有什么声音？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,7,0,0,0,0,0,7172,7172,7172,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,9,0,0,0,0,0,6770,6770,6770,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,23,0,0,0,0,0,6770,6770,6770,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,8,0,0,0,0,0,6776,6776,6776,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,10,0,0,0,0,0,6776,6776,6776,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,22,0,0,0,0,0,6776,6776,6776,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,14,0,0,0,0,0,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,18,0,0,0,0,0,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,13,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(17,22,35,40);   --  25(19):场景移动17-22--35-40
    instruct_1(3169,200,0);   --  1(1):[???]说: 向问天，看你这回往哪儿跑*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3170,202,0);   --  1(1):[???]说: 向右使，属下可要得罪了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3171,199,0);   --  1(1):[???]说: 向问天这魔教妖人，人人得*而诛之。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3172,197,0);   --  1(1):[???]说: 邪魔外道，危害江湖，我辈*中人除妖灭魔，责无旁贷！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3173,234,0);   --  1(1):[???]说: 哈哈哈哈，有本事就尽管来*吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3174,35,0);   --  1(1):[令狐冲]说: 这么多人打一个，好不要脸*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3175,202,0);   --  1(1):[???]说: 那边两个小子，胡说八道什*么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3176,196,0);   --  1(1):[???]说: 八成是跟这姓向得一伙的，*拿下他们再说！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3177,0,1);   --  1(1):[AAA]说: 我……我不是……＜倒霉倒*霉，令狐兄的一句话，就趟*上了这趟混水……＞
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(210,4,0,0) ==false then    --  6(6):战斗[210]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,24,1,0,785,0,0,7148,7148,7148,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_19(36,40);   --  19(13):主角移动至24-28
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3178,234,0);   --  1(1):[???]说: 哈哈哈哈，想不到我向问天*危难之际，还能有两位素不*相识的朋友相助，好，好，*哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3179,35,0);   --  1(1):[令狐冲]说: 我反正是个快死之人了，倒*是连累了这位少侠。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3180,0,0);   --  1(1):[AAA]说: ＜该死的令狐冲，你还知道*啊……＞*哪里哪里。他们那么多人打*一个，不是英雄好汉的行径*。就算令狐大哥不说话，我*也是要出手的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3181,234,0);   --  1(1):[???]说: 哈哈哈，我向问天能结识两*位，真乃三生有幸。这位令*狐兄弟，我看你似乎内力全*无，不知道是怎么回事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3182,35,0);   --  1(1):[令狐冲]说: 唉，我本来是受了重伤，那*桃谷六仙又胡乱医治……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3183,35,0);   --  1(1):[令狐冲]说: ……就这样，我就变得内力*全无了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3184,234,0);   --  1(1):[???]说: 令狐兄弟的遭遇，当真是闻*所未闻啊。不过，据我所知*，有一个人能治好你的病。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3185,35,0);   --  1(1):[令狐冲]说: 哦？还望向大哥赐教。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3186,234,0);   --  1(1):[???]说: 西湖梅庄之中，住着一位高*人，他有一套奇异的武功，*定可化解你体内的异种真气*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3187,0,1);   --  1(1):[AAA]说: ＜梅庄这地方我还一直没去*过，既然有高人，说不定就*有十四天书的消息。＞令狐*大哥，那咱们就上梅庄吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3188,234,0);   --  1(1):[???]说: 不过，想见到这位高人着实*不易。梅庄还有四位庄主，*你们必须将他四人打败，才*有可能见到这位高人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3189,0,1);   --  1(1):[AAA]说: 哦，不就是打架嘛，这个简*单。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3190,234,0);   --  1(1):[???]说: 我知道四位庄主分别对琴棋*书画如痴如狂，只有用每个*人喜好的东西来诱惑他们，*他们才可能和你交手。我能*帮你的就这么多，能不能见*到这个人，就看你们的造化*啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3191,35,0);   --  1(1):[令狐冲]说: 多谢向大哥指点迷津。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3192,234,0);   --  1(1):[???]说: 咱们就此分手吧，有缘的话*一定还会见面的。记住，在*梅庄不要提起我的名字。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_17(55,1,30,47,0);   --  17(11):修改场景贴图:场景[梅庄]层1坐标1E-2F
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

