--function oldevent_214()
    instruct_1(479,0,1);   --  1(1):[AAA]说: 这上面似乎记载着使用这柄*重剑的法门，我赶紧记下来*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(116,1);   --  2(2):得到物品[玄铁剑法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_0();   --  0(0)::空语句(清屏)
--end

