--function oldevent_351()
    instruct_30(25,43,25,42);   --  30(1E):主角走动25-43--25-42
    instruct_30(25,42,32,42);   --  30(1E):主角走动25-42--32-42
    instruct_30(32,42,32,36);   --  30(1E):主角走动32-42--32-36
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1322,0,1);   --  1(1):[AAA]说: 哇塞，死了这么多人。看来*金龙帮已经被闵子华找来的*人给灭了，不知道是否还剩*下什么人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,29,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,30,0,0,0,0,352,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_0();   --  0(0)::空语句(清屏)
--end

