--function oldevent_592()
    instruct_1(2572,207,0);   --  1(1):[???]说: 这，这不就是打狗棒吗！怎*会在阁下手上？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2573,0,1);   --  1(1):[AAA]说: 这是我无意中所得，既是贵*帮之物，自当奉还。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2574,207,0);   --  1(1):[???]说: 公子宅心仁厚，丐帮上下感*激大恩。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_32(49,-1);   --  32(20):物品[打狗棒]+[-1]
    instruct_37(6);   --  37(25):增加道德6
    instruct_3(-2,12,1,0,593,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,1,0,593,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
--end

