--function oldevent_15()

    if instruct_29(0,100,999,6,0) ==false then    --  29(1D):判断AAA武力100-999是则跳转到:Label0
        instruct_1(142,3,0);   --  1(1):[苗人凤]说: 等胡斐学会了胡家刀法，小*兄弟再来向我挑战吧。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(143,3,0);   --  1(1):[苗人凤]说: 胡斐的胡家刀法已经练成。*小兄弟，你可准备好了？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(0,130) ==true then    --  5(5):是否选择战斗？否则跳转到:Label1

        if instruct_6(4,7,0,1) ==false then    --  6(6):战斗[4]是则跳转到:Label2
            instruct_13();   --  13(D):重新显示场景
            instruct_1(144,3,0);   --  1(1):[苗人凤]说: 看来小兄弟还要再努力一番*才是。
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label2

        instruct_37(2);   --  37(25):增加道德2
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(145,3,0);   --  1(1):[苗人凤]说: 小兄弟武艺高强，苗某佩服*。这本《飞狐外传》就交给*你啦。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(144,1);   --  2(2):得到物品[飞狐外传][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(146,247,1);   --  1(1):[???]说: 多谢苗大侠。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_35(1,0,67,800);   --  35(23):设置胡斐武功0:胡家刀法攻击力800
        instruct_47(1,100);   --  47(2F):胡斐增加攻击力100
        instruct_46(1,1000);   --  46(2E):胡斐增加内力1000
        instruct_48(1,300);   --  48(30):胡斐增加生命300
        instruct_3(-2,12,-2,0,16,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_3(-2,-2,-2,0,17,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(3,9,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [9]
        instruct_3(3,12,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [12]
        instruct_3(3,11,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [11]
        instruct_3(3,10,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [10]
        do return; end
    end    --:Label1

--end

