--function oldevent_547()

    if instruct_4(197,2,0) ==false then    --  4(4):是否使用物品[大燕皇帝世袭图表]？是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_32(197,-1);   --  32(20):物品[大燕皇帝世袭图表]+[-1]
    instruct_1(2311,51,0);   --  1(1):[慕容复]说: 哈哈，有了大燕皇帝世系谱*表及传国玉玺，我就可号召*大燕後代，实行复国计划。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2312,0,1);   --  1(1):[AAA]说: 慕容公子此次不会再失信了*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2313,51,0);   --  1(1):[慕容复]说: 我慕容复何时曾失信过人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2314,246,1);   --  1(1):[???]说: ＜贵人多忘事＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2315,51,0);   --  1(1):[慕容复]说: 《天龙八部》一书在乔峰的*手里。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2316,0,1);   --  1(1):[AAA]说: 你该不会是随便说说的吧。*人家称你们为“南慕容，北*乔峰”，你就说书在他那。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2317,76,0);   --  1(1):[???]说: 我表哥没有说谎，此书的确*是流落在他的手中。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2318,247,1);   --  1(1):[???]说: 王姑娘说的话就可以信了。*好，我就上丐帮要书去了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2319,51,0);   --  1(1):[慕容复]说: 非也，非也～
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2320,0,1);   --  1(1):[AAA]说: 此话怎讲？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2321,51,0);   --  1(1):[慕容复]说: 你想想看，你打得过那乔峰*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2322,0,1);   --  1(1):[AAA]说: 打不过也得打，*不然怎麽办？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2323,51,0);   --  1(1):[慕容复]说: 我有办法让乔峰乖乖的将书*交出来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2324,0,1);   --  1(1):[AAA]说: 他为什麽会乖乖交出来？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2325,51,0);   --  1(1):[慕容复]说: 因为我知道他一个极大的秘*密，一个足以让他身败名裂*的秘密。总之，你若和我合*作，我可以让你轻易获得该*书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2326,0,1);   --  1(1):[AAA]说: 你为什麽要帮我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2327,51,0);   --  1(1):[慕容复]说: 没什麽，鱼帮水，水帮鱼。*我慕容氏人丁单薄，势力微*弱，想要重建邦国，谈何容*易？唯一的机会便是天下大*乱，武林动荡不安。而你也*可从中得到你要的东西。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2328,76,0);   --  1(1):[???]说: 表哥，你不要想复国想到疯*了，弄得天下大乱。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2329,51,0);   --  1(1):[慕容复]说: 住嘴！你以为我这慕容复的*"复"字是为何取的，我慕容*家族世世代代奔波一生，所*为何事？怎样，你要不要和*我合作？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_11(119,0) ==false then    --  11(B):是否住宿是则跳转到:Label1
        instruct_37(2);   --  37(25):增加道德2
        instruct_3(104,91,1,0,1084,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [91]
        instruct_1(2330,0,1);   --  1(1):[AAA]说: 慕容公子的好意，在下心领*了。但我不愿用卑鄙的方法*去得到那本《天龙八部》。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2331,51,0);   --  1(1):[慕容复]说: 哼，此事我势在必行，即使*没有你的合作，我也要去丐*帮。到时你得不到《天龙八*部》，那可是你咎由自取。*我们走。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2332,53,0);   --  1(1):[段誉]说: 王姑娘，等等我……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,20,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(51,25,0,0,0,0,556,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [25]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label1

    instruct_37(-8);   --  37(25):增加道德-8
    instruct_3(104,91,1,0,1085,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [91]
    instruct_1(2333,51,0);   --  1(1):[慕容复]说: 好，少侠果然明事理。这封*书信就是揭发乔峰的证据，*你拿好，咱们丐帮见。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(216,1);   --  2(2):得到物品[带头大哥书信][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2334,53,0);   --  1(1):[段誉]说: 唉，王姑娘走了，……*我也回大理吧……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,20,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,3,1,0,548,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,5,1,0,549,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(51,25,0,0,0,0,585,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [25]
    instruct_3(77,0,1,0,1061,0,0,6414,6414,6414,-2,-2,-2);   --  3(3):修改事件定义:场景[万鳄岛]:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

