--function oldevent_486()
    instruct_1(1943,0,1);   --  1(1):[AAA]说: 洪帮主，近来可好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1942,69,0);   --  1(1):[洪七公]说: 我现在只是个糟老头儿，再*也没半点功夫了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1944,0,1);   --  1(1):[AAA]说: 洪帮主不必担心，一灯大师*让晚辈给您带来了疗伤之法
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1945,69,0);   --  1(1):[洪七公]说: 什么疗伤之法？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1946,0,1);   --  1(1):[AAA]说: 据一灯大师讲，这是九阴真*经中记载的疗伤圣法，您依*照此法练功，很快就能复原*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1947,69,0);   --  1(1):[洪七公]说: 当真？待我练来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1948,69,0);   --  1(1):[洪七公]说: 这九阴真经真是一部奇书啊*，我这么重的伤势也能复原*。小兄弟，谢谢你啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1949,0,1);   --  1(1):[AAA]说: 洪帮主何必客气。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1950,69,0);   --  1(1):[洪七公]说: 我听说你正在寻找十四天书*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1951,0,1);   --  1(1):[AAA]说: 是啊，洪老前辈可有线索？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1952,69,0);   --  1(1):[洪七公]说: 据我所知，《射雕英雄传》*一书，应该是在重阳真人手*上。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1953,0,1);   --  1(1):[AAA]说: 可是重阳真人已经仙去了呀*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1954,69,0);   --  1(1):[洪七公]说: 此书被全真教视为镇教至宝*，应该会传给下一代掌门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1955,0,1);   --  1(1):[AAA]说: 你老人家的意思是，此书现*在邱真人手上？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1956,69,0);   --  1(1):[洪七公]说: 我也只是猜测。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1957,0,1);   --  1(1):[AAA]说: 多谢洪前辈指点。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,487,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(19,0,1,0,496,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[重阳宫]:场景事件编号 [0]
--end

