--function oldevent_759()

    if instruct_16(35,6,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        instruct_1(3044,195,0);   --  1(1):[???]说: 掌门已率领弟子上嵩山了。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(3045,35,1);   --  1(1):[令狐冲]说: 六猴，师父呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3046,195,0);   --  1(1):[???]说: 师父说封不平等这几个剑宗*弃徒请到了五岳剑派的令旗*，咱们上嵩山去见左盟主，*和他评一评这个道理。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3047,35,0);   --  1(1):[令狐冲]说: 武林中说到评理，可并非单*是“评”一“评”就算了事*，一言不合，往往继之以动*武。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3048,195,0);   --  1(1):[???]说: 师父说让你回来好好养伤，*这是师父留给你的紫霞秘笈*。我也要去帮师父的忙了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(67,1);   --  2(2):得到物品[紫霞秘笈][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3049,35,0);   --  1(1):[令狐冲]说: 师父武功虽高，未必是左盟*主的对手，何况嵩山派左盟*主的师弟共有十余人之多，*武林中号称‘嵩山十三太保*”咱们贸然上嵩山去生事，*岂非太也卤莽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3050,0,1);   --  1(1):[AAA]说: 那咱们就沿路找找他们吧，*看能不能帮上什么忙。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3051,35,0);   --  1(1):[令狐冲]说: 好，师父他们人多，走的慢*，咱们应该能追上他们。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(103,0,0,0,0,0,760,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[药王庙]:场景事件编号 [0]
    instruct_3(103,2,0,0,0,0,760,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[药王庙]:场景事件编号 [2]
    instruct_3(103,1,0,0,0,0,760,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[药王庙]:场景事件编号 [1]
--end

