--function oldevent_34()
    instruct_3(-2,-2,1,0,0,0,0,2492,2492,2492,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(0,10);   --  2(2):得到物品[小还丹][10]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(1,3);   --  2(2):得到物品[天香续命膏][3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(2,1);   --  2(2):得到物品[黑玉断续膏][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(3,10);   --  2(2):得到物品[白云熊胆丸][10]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(4,3);   --  2(2):得到物品[田七鲨胆散][3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(5,2);   --  2(2):得到物品[九花玉露丸][2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(6,1);   --  2(2):得到物品[九转熊蛇丸][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(10,3);   --  2(2):得到物品[牛黄血蝎丹][3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(209,50);   --  2(2):得到物品[药材][50]
    instruct_0();   --  0(0)::空语句(清屏)
--end

