--function oldevent_1054()

    if instruct_16(73,0,85) ==true then    --  16(10):队伍是否有[任盈盈]否则跳转到:Label0
        instruct_1(3959,73,1);   --  1(1):[任盈盈]说: 凤凰，我现在帮着这位少侠*一起寻找天书，你也来帮忙*吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3960,25,0);   --  1(1):[蓝凤凰]说: 是，我听圣姑的。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(104,42,1,0,951,0,0,6804,6804,6804,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [42]

        if instruct_20(21,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            instruct_10(25);   --  10(A):加入人物[蓝凤凰]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_1(12,25,0);   --  1(1):[蓝凤凰]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(70,28,1,0,113,0,0,6804,6804,6804,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [28]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label0


    if instruct_16(35,0,10) ==true then    --  16(10):队伍是否有[令狐冲]否则跳转到:Label2
        instruct_1(3957,25,0);   --  1(1):[蓝凤凰]说: 呵呵，令狐大哥！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3958,35,1);   --  1(1):[令狐冲]说: 好妹子，乖妹子。
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2

    instruct_1(3961,0,1);   --  1(1):[AAA]说: 蓝教主可愿和在下一起闯荡*江湖？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3962,25,0);   --  1(1):[蓝凤凰]说: 我们是日月神教的属下，我*要听圣姑的。
    instruct_0();   --  0(0)::空语句(清屏)
--end

