--function oldevent_326()
    instruct_14();   --  14(E):场景变黑
    instruct_37(3);   --  37(25):增加道德3
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_25(25,43,25,36);   --  25(19):场景移动25-43--25-36
    instruct_25(25,36,20,36);   --  25(19):场景移动25-36--20-36
    instruct_25(20,36,46,36);   --  25(19):场景移动20-36--46-36
    instruct_25(46,36,31,36);   --  25(19):场景移动46-36--31-36
    instruct_1(1194,181,0);   --  1(1):[???]说: 焦公礼，你杀了我大哥，今*日还相抵赖么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1195,243,0);   --  1(1):[???]说: 闵二爷怎么这么大的火气，*有话慢慢说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1196,181,0);   --  1(1):[???]说: 谁跟你慢慢说，今日我定要*为兄报仇！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1197,0,1);   --  1(1):[AAA]说: 且慢！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(25,43,25,42);   --  30(1E):主角走动25-43--25-42
    instruct_30(25,42,32,42);   --  30(1E):主角走动25-42--32-42
    instruct_30(32,42,32,36);   --  30(1E):主角走动32-42--32-36
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1198,0,1);   --  1(1):[AAA]说: 请各位看一看这是什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_32(232,-1);   --  32(20):物品[太白三英的书信]+[-1]
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1199,181,0);   --  1(1):[???]说: 这……这……我大哥他……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1200,0,1);   --  1(1):[AAA]说: 闵二爷，我看今日之事就此*作罢吧，你们化干戈为玉帛*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1201,183,0);   --  1(1):[???]说: 哼，谁知道你这些东西是不*是自己伪造的！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1202,0,1);   --  1(1):[AAA]说: 你，你，居然把证据撕毁，*姓梅的，你还要不要脸！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1203,183,0);   --  1(1):[???]说: 也不知是谁不要脸了？害死*了人家兄长，还造几封狗屁*不通的书信来冤枉死人。反*正人已经死了，任你撒个弥*天大谎！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1204,181,0);   --  1(1):[???]说: 不错，杀兄大仇不可不报！*洞玄师弟，我们拿下这小子*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1205,91,0);   --  1(1):[???]说: 两个打一个，好没羞！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1206,181,0);   --  1(1):[???]说: 臭丫头，没见过世面，仙都*派两仪剑法，向来是两人同*使！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1207,91,0);   --  1(1):[???]说: 你——！*好，我们就来赌一把，二位*一起上，如果能赢得了这位*少侠，我们马上离开此地。*如果你们输了，大功坊的房*子就归我！怎么样，敢赌么*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1208,181,0);   --  1(1):[???]说: 哼，赌就赌，看我在这小子*身上戳两个透明窟窿！洞玄*师弟，我们上！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(158,3,0,0) ==false then    --  6(6):战斗[158]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1209,181,0);   --  1(1):[???]说: 你……你……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1210,91,0);   --  1(1):[???]说: 哈哈，大功坊的房子归我喽！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1211,183,0);   --  1(1):[???]说: 阁下武功了得，梅某来领教*一二。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(159,3,0,0) ==false then    --  6(6):战斗[159]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1212,183,0);   --  1(1):[???]说: 技不如人，梅某告辞！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1213,0,1);   --  1(1):[AAA]说: 别想跑～
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1214,183,0);   --  1(1):[???]说: 怎么？阁下还想赶尽杀绝么*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1215,0,1);   --  1(1):[AAA]说: 梅大哥，不是说你，我是说*太白三英！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1216,183,0);   --  1(1):[???]说: 哼！你有点欺人太甚了吧，*大伙一起上！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(160,3,0,0) ==false then    --  6(6):战斗[160]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label2

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1217,0,1);   --  1(1):[AAA]说: 这太白三英，里通外国，挑*拨离间，今日之事全是他们*挑起的。梅大哥、闵二爷，*我看此事就此罢手吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1218,183,0);   --  1(1):[???]说: ……告辞！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1219,91,0);   --  1(1):[???]说: 闵二爷，咱们打的赌呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1220,181,0);   --  1(1):[???]说: 哼，闵某说话算话，大公坊*归你了。告辞！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1221,91,0);   --  1(1):[???]说: 哈哈，我赢了他的房子，哈*哈哈，袁大哥，咱们这就去*大公坊好好玩玩。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1222,54,0);   --  1(1):[袁承志]说: 你……唉，真拿你没办法……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1223,54,0);   --  1(1):[袁承志]说: 这梅剑和、刘培生都是华山*派的，算起来还是我的晚辈*，我今日实在不便出手干预*。幸亏兄台及时赶到。……*喂，青青，等等我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,13,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,2,1,0,330,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_17(95,0,12,48,986);   --  17(11):修改场景贴图:场景[大功坊]层0坐标C-30
    instruct_3(95,10,1,0,343,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[大功坊]:场景事件编号 [10]
    instruct_3(83,41,0,0,0,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[大功坊地窖]:场景事件编号 [41]
    instruct_3(83,43,0,0,0,0,0,7032,7032,7032,-2,-2,-2);   --  3(3):修改事件定义:场景[大功坊地窖]:场景事件编号 [43]
    instruct_3(83,44,0,0,0,0,344,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[大功坊地窖]:场景事件编号 [44]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1224,243,0);   --  1(1):[???]说: 金龙帮上下全体帮众感谢少*侠大恩大德。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1225,0,1);   --  1(1):[AAA]说: 焦帮主太客气了。
    instruct_0();   --  0(0)::空语句(清屏)
--end

