--function oldevent_425()
    instruct_37(-1);   --  37(25):增加道德-1
    instruct_26(61,19,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(1633,0,1);   --  1(1):[AAA]说: 贝大夫为何愁眉苦脸？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1634,85,0);   --  1(1):[???]说: 帮主不见了，二使已经来过*了，唉
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1635,0,1);   --  1(1):[AAA]说: 莫非贝大夫接下了赏善罚恶*令？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1636,85,0);   --  1(1):[???]说: 不接马上就要死，还是接了*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1637,0,1);   --  1(1):[AAA]说: 如果我替你去赴这侠客岛之*约，你以为如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1638,85,0);   --  1(1):[???]说: 少侠若愿意为我挡灾，贝海*石愿效犬马之劳，今后愿听*少侠差遣。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1639,0,1);   --  1(1):[AAA]说: 哈哈哈，好！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(198,1);   --  2(2):得到物品[赏善罚恶令][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(74,0,-2,0,-2,427,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[侠客岛]:场景事件编号 [0]

    if instruct_9(16,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_3(-2,-2,1,0,426,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(1640,0,1);   --  1(1):[AAA]说: 贝大夫，跟我一起走吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,48,1,0,986,0,0,7028,7028,7028,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [48]

    if instruct_20(24,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_1(1641,85,0);   --  1(1):[???]说: 好吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_10(85);   --  10(A):加入人物[贝海石]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(12,85,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(70,47,1,0,185,0,0,7028,7028,7028,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [47]
    instruct_0();   --  0(0)::空语句(清屏)
--end

