--function oldevent_456()
    instruct_1(1676,55,0);   --  1(1):[郭靖]说: 我叫郭靖，从小在蒙古长大*。但我娘和我七位师父告诉*我，我是江南人氏。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1677,131,0);   --  1(1):[???]说: 不错，靖儿，现在也是时候*了，你该回中原看一看了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1678,55,0);   --  1(1):[郭靖]说: 我，我舍不得离开我娘。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1679,135,0);   --  1(1):[???]说: 靖儿，男子汉大丈夫，怎么*能总依偎在娘的身边？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1680,132,0);   --  1(1):[???]说: 你娘那边我们已经说过了，*她非常支持你回中原。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1681,134,0);   --  1(1):[???]说: 靖儿，我们教了你这么多年*的武功，你总要出去闯荡江*湖呀。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1682,55,0);   --  1(1):[郭靖]说: 就徒儿一个人去吗？*几位师父不和我同行吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1683,133,0);   --  1(1):[???]说: 我们还有别的事情要办，现*在也该是你独自历练的时候*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1684,136,0);   --  1(1):[???]说: 靖儿，你可以自己找伙伴啊*，比如这位少侠，风尘仆仆*，一看就知道在江湖上到处*闯荡。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1685,55,0);   --  1(1):[郭靖]说: 这位少侠，你带我一起回中*原好吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,99) ==true then    --  9(9):是否要求加入?否则跳转到:Label0
        instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_1(1686,247,1);   --  1(1):[???]说: 好啊，我们一起走吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1687,130,0);   --  1(1):[???]说: 靖儿，记得，闯荡江湖，最*要紧的就是要有侠义之心。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1688,55,0);   --  1(1):[郭靖]说: 徒儿记下了
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            instruct_10(30);   --  10(A):加入人物[郭靖]
            do return; end
        end    --:Label1

        instruct_1(12,55,0);   --  1(1):[郭靖]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(70,13,1,0,119,0,0,6088,6088,6088,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [13]
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label0

    instruct_1(1689,0,1);   --  1(1):[AAA]说: 对不起，我还有事，以后再*说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,457,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

