--function oldevent_510()
    instruct_37(-3);   --  37(25):增加道德-3
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(2118,68,0);   --  1(1):[丘处机]说: 什么人，擅闯重阳宫！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2119,245,1);   --  1(1):[???]说: 擅闯又如何？我还要拿东西*呢！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2121,128,0);   --  1(1):[???]说: 大胆狂徒，接招。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(187,3,0,0) ==false then    --  6(6):战斗[187]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,28,0,0,0,0,0,8230,8230,8230,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2122,64,0);   --  1(1):[周伯通]说: 马钰，丘处机，你们几个臭*牛鼻子，连这小子都对付不*了，哈哈，我来了。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(183,3,0,0) ==false then    --  6(6):战斗[183]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_3(-2,29,0,0,0,0,0,6124,6124,6124,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,30,0,0,0,0,0,8238,8238,8238,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2123,57,0);   --  1(1):[黄药师]说: 老顽童，你功夫不行啊
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2124,69,0);   --  1(1):[洪七公]说: 老顽童莫慌，我们来助你
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(184,3,0,0) ==false then    --  6(6):战斗[184]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label2

    instruct_3(-2,27,0,0,0,0,0,7102,7102,7102,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2125,129,0);   --  1(1):[???]说: 何人敢在我重阳宫中撒野！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2126,123,0);   --  1(1):[???]说: 师父，您还活着？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2127,64,0);   --  1(1):[周伯通]说: 师兄，真的是你，太好了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2128,57,0);   --  1(1):[黄药师]说: 重阳真人，久违了
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2129,69,0);   --  1(1):[洪七公]说: 重阳真人，你可是连老叫化*都瞒过啦
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2130,129,0);   --  1(1):[???]说: 贫道诈死，让各位担心了。*现在我们大家联手，对付这*恶贼！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(185,3,0,0) ==false then    --  6(6):战斗[185]是则跳转到:Label3
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label3

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2131,129,0);   --  1(1):[???]说: 真是长江后浪推前浪，看来*我们真是老了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(148,1);   --  2(2):得到物品[射鵰英雄传][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(84,1);   --  2(2):得到物品[九阴真经][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,1,0,228,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
--end

