--function oldevent_570()
    instruct_1(2418,207,0);   --  1(1):[???]说: 本帮新任帮主庄聚贤，神功*盖世，即将赶赴少林，与玄*慈方丈争夺武林盟主之位！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(40,13,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,15,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,14,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,-2,0,571,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(28,37,0,0,0,0,0,2286,2286,2286,-2,-2,-2);   --  3(3):修改事件定义:场景[少林寺]:场景事件编号 [37]
--end

