--function oldevent_297()
    instruct_14();   --  14(E):场景变黑
    instruct_3(44,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[蝴蝶谷]:场景事件编号 [0]
    instruct_3(44,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[蝴蝶谷]:场景事件编号 [1]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,0,0,0,0,0,0,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,0,0,0,7008,7008,7008,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,4,0,0,0,0,0,5294,5294,5294,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(48,24,26,23);   --  25(19):场景移动48-24--26-23
    instruct_1(886,15,0);   --  1(1):[金花婆婆]说: 谢三哥，你还信不过紫杉老*妹子么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(887,13,0);   --  1(1):[谢逊]说: 我说过了，除非见到我那无*忌孩儿，否则我是不会把屠*龙刀借给你的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(890,174,0);   --  1(1):[???]说: 明教圣火令到，护教龙王、*狮王，还不下跪迎接，更待*何时。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(986,0,1);   --  1(1):[AAA]说: ＜原来这两位就是明教的紫*杉龙王和金毛狮王啊……不*知道来的是什么人……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,5,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(892,15,0);   --  1(1):[金花婆婆]说: 本人早已破门出教，'护教*龙王'四字，再也休提。阁*下尊姓大名？这圣火令是真*是假，从何处得来？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(893,174,0);   --  1(1):[???]说: 明教源于何土？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(894,13,0);   --  1(1):[谢逊]说: 源起波斯。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(895,174,0);   --  1(1):[???]说: 然也，然也！我乃波斯明教*总教流云使，另外两位是妙*风使、辉月使。我等奉总教*主之命，特从波斯来至中土*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(896,13,0);   --  1(1):[谢逊]说: 中土明教虽然出自波斯，但*数百年来独立成派，自来不*受波斯总教管辖。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(897,174,0);   --  1(1):[???]说: 这是中土明教的圣火令，前*任姓石的教主不肖，失落在*外，今由我等取回。自来见*圣火令如见教主。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(898,15,0);   --  1(1):[金花婆婆]说: 我已说过，本人早已破门出*教，这圣火令与我何干？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(899,174,0);   --  1(1):[???]说: 本教教规，入教之后终身不*能叛教。你自称破门出教，*为本教叛徒，需留你不得。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,9,0,0,0,0,0,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(900,66,0);   --  1(1):[小昭]说: 啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(901,0,1);   --  1(1):[AAA]说: ＜这三人一招之间就抓住了*紫杉龙王，功夫着实了得！*＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(902,66,0);   --  1(1):[小昭]说: 快救救我妈妈！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(903,245,1);   --  1(1):[???]说: 大胆胡人，还不快放人。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(14,3,0,0) ==false then    --  6(6):战斗[14]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,0,0,0,0,0,0,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_19(26,24);   --  19(13):主角移动至1A-18
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(904,13,0);   --  1(1):[谢逊]说: 多谢少侠出手相助。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(905,0,1);   --  1(1):[AAA]说: 狮王不必客气。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(906,15,0);   --  1(1):[金花婆婆]说: 老婆子多谢啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(907,0,1);   --  1(1):[AAA]说: 龙王不必客气。这三个家伙*的武功真是怪异。咦？这是*什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(908,15,0);   --  1(1):[金花婆婆]说: 这就是圣火令。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(909,0,1);   --  1(1):[AAA]说: 这上面好像有字？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(910,15,0);   --  1(1):[金花婆婆]说: 我来看看。哦，这是波斯文*字，我给你译出来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_2(70,1);   --  2(2):得到物品[圣火神功][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(911,0,1);   --  1(1):[AAA]说: 却不知这些人为何要为难婆*婆？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(912,15,0);   --  1(1):[金花婆婆]说: 说来话长。我本是波斯明教*的圣女。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(913,0,1);   --  1(1):[AAA]说: 啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(914,15,0);   --  1(1):[金花婆婆]说: 我来到中原，加入明教，本*是寻找乾坤大挪移心法的。*没想到对银叶先生动了真情*，结为夫妻，这是犯了波斯*明教的大忌，按照教规理应*处死。我这么多年隐姓埋名*，没想到还是被找到了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(915,0,1);   --  1(1):[AAA]说: 原来如此啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(916,66,0);   --  1(1):[小昭]说: 看，又来了好多人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(987,15,0);   --  1(1):[金花婆婆]说: 这次十二宝树王一起来中原*，看来是原教主去世，来寻*我做新教主了。可是我已不*是处女之身，这……小昭…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(988,0,1);   --  1(1):[AAA]说: 难道……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(989,15,0);   --  1(1):[金花婆婆]说: 是的，只有让小昭做教主了*。这是我明教内部之事，少*侠不必过问，这也是现在唯*一的办法了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(990,66,0);   --  1(1):[小昭]说: 公子，再见了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(991,13,0);   --  1(1):[谢逊]说: 韩夫人你……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(992,15,0);   --  1(1):[金花婆婆]说: 谢三哥，再见了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(993,0,1);   --  1(1):[AAA]说: 谢法王，我到处找你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(994,13,0);   --  1(1):[谢逊]说: 找我？什么事？难道是为了*屠龙宝刀？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(995,0,1);   --  1(1):[AAA]说: 不是的，明教出事了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(996,13,0);   --  1(1):[谢逊]说: 快说，我们明教的兄弟怎么*了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(929,0,1);   --  1(1):[AAA]说: 事情是这样的……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(997,13,0);   --  1(1):[谢逊]说: 我，马上就回光明顶！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(11,94,1,0,298,0,0,5294,5294,5294,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [94]
    instruct_3(11,90,1,0,298,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [90]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

