--function oldevent_867()

    if instruct_4(174,2,0) ==false then    --  4(4):是否使用物品[银两]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_31(2000,6,0) ==false then    --  31(1F):判断银子是否够2000是则跳转到:Label1
        instruct_1(3379,236,0);   --  1(1):[???]说: 钱不够啊，这可不行，我这*已经是成本价了，怎么说你*也要让我糊口啊。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_32(174,-2000);   --  32(20):物品[银两]+[-2000]
    instruct_1(3380,236,0);   --  1(1):[???]说: 好，一手交钱，一手交货。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(57,1);   --  2(2):得到物品[犽月][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,0,868,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

