--function oldevent_237()
    instruct_1(623,0,1);   --  1(1):[AAA]说: 陈当家，你好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(624,75,0);   --  1(1):[???]说: 少侠，你来啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(625,0,1);   --  1(1):[AAA]说: 营救文四哥还顺利么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(626,75,0);   --  1(1):[???]说: 这张召重果然名不虚传，有*他在，救人还真不容易。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(627,0,1);   --  1(1):[AAA]说: 这样吧，咱们兵分两路，我*来缠住他，你们你们绕到后*面去救文四哥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(628,75,0);   --  1(1):[???]说: 如此甚好，少侠小心。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,1,0,239,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,1,0,239,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

