--function oldevent_845()

    if instruct_16(78,0,67) ==true then    --  16(10):队伍是否有[梅超风]否则跳转到:Label0
        instruct_1(3364,236,0);   --  1(1):[???]说: 师姐，真的是你？？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3365,78,1);   --  1(1):[???]说: 默风，是我啊。这些年……*你过得好吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3366,236,0);   --  1(1):[???]说: 自从被师父挑断脚筋，逐出*桃花岛，我一直是颠沛流离*，没过过一天安稳日子啊…*…
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3367,78,1);   --  1(1):[???]说: 唉，都是我害了你……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3368,236,0);   --  1(1):[???]说: 师姐，别这么说，从前得事*情都已经过去了。如今能再*次见到师姐，我真的很高兴*。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3369,78,1);   --  1(1):[???]说: 默风，我看你一个人也很孤*单，不如一起去小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3370,236,0);   --  1(1):[???]说: 好，我听师姐的。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(70,45,1,0,847,848,0,7022,7022,7022,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [45]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label0

    instruct_1(3371,236,0);   --  1(1):[???]说: 感谢少侠的救命之恩。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3372,0,1);   --  1(1):[AAA]说: 前辈太客气了。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_43(101,7,0) ==false then    --  43(2B):是否有物品落英神剑掌是则跳转到:Label1
        instruct_1(3393,236,0);   --  1(1):[???]说: 真是怀念桃花岛啊……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_1(3373,236,0);   --  1(1):[???]说: 咦？你也曾经学过桃花岛的*武功吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3374,0,1);   --  1(1):[AAA]说: 是啊，晚辈有幸，得蒙黄岛*主传授武功。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3375,236,0);   --  1(1):[???]说: 这么说来，我们也算是师兄*弟了。你有什么需要我帮忙*的，尽管说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3376,0,1);   --  1(1):[AAA]说: 那能否请前辈到小村去，帮*我打造一些兵器。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3377,236,0);   --  1(1):[???]说: 好，咱们这就走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(70,45,1,0,847,848,0,7022,7022,7022,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [45]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

