--function oldevent_529()
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_30(48,21,48,16);   --  30(1E):主角走动48-21--48-16
    instruct_30(48,16,44,16);   --  30(1E):主角走动48-16--44-16
    instruct_1(2251,247,1);   --  1(1):[???]说: 两位姑娘，小生这相有礼了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2252,105,0);   --  1(1):[???]说: 你是谁？来这里做什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2253,0,1);   --  1(1):[AAA]说: 我是段公子的朋友。这个大*和尚抓了段公子，说要来慕*容老先生的坟前将他火化。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2254,104,0);   --  1(1):[???]说: 啊--这，这可是真的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2255,103,0);   --  1(1):[???]说: 哈哈哈，小姑娘不必害怕。*我与慕容老先生乃是至交，*曾许愿要将六脉神剑的图谱*给他一观。如今真图谱已被*毁掉，而这位段公子的心中*却记得整个图谱，是以贫僧*将其抓来，在慕容老先生坟*前火化，以实践先前的诺言*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2256,105,0);   --  1(1):[???]说: 大和尚胡说八道，如果这位*段公子会六脉神剑，还能乖*乖听你的话吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2257,103,0);   --  1(1):[???]说: 那是因为贫僧点了他的穴道*，姑娘如果不信，在下就解*开他的穴道。段公子，请你*施展一下六脉神剑的绝世神*功，给两位姑娘看看吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2258,53,0);   --  1(1):[段誉]说: 我根本就不会任何武功！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2259,104,0);   --  1(1):[???]说: 二位别吵了，我家公子不在*，我们两个做丫鬟的也不方*便作主。请二位稍安勿躁，*小女子愿抚琴一曲，以奉雅*客。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2260,53,0);   --  1(1):[段誉]说: 能在如此玲珑雅致的地方听*姐姐抚琴，明日就算给这大*和尚烧了，也算不枉此生了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2261,105,0);   --  1(1):[???]说: 你倒是嘴甜，你且来看一下*，识得这琴么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2262,103,0);   --  1(1):[???]说: ＜哼，故弄玄虚，谅你们也*逃不出我的手心＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_17(-2,1,39,17,1708);   --  17(11):修改场景贴图:当前场景层1坐标27-11
    instruct_17(-2,1,45,17,1954);   --  17(11):修改场景贴图:当前场景层1坐标2D-11
    instruct_17(-2,1,44,17,1708);   --  17(11):修改场景贴图:当前场景层1坐标2C-11
    instruct_17(-2,1,43,17,1708);   --  17(11):修改场景贴图:当前场景层1坐标2B-11
    instruct_17(-2,1,42,17,1708);   --  17(11):修改场景贴图:当前场景层1坐标2A-11
    instruct_17(-2,1,41,17,1708);   --  17(11):修改场景贴图:当前场景层1坐标29-11
    instruct_17(-2,1,40,17,1708);   --  17(11):修改场景贴图:当前场景层1坐标28-11
    instruct_17(-2,1,45,14,1702);   --  17(11):修改场景贴图:当前场景层1坐标2D-E
    instruct_17(-2,1,45,15,1702);   --  17(11):修改场景贴图:当前场景层1坐标2D-F
    instruct_17(-2,1,45,16,1702);   --  17(11):修改场景贴图:当前场景层1坐标2D-10
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,15,0,0,0,0,0,6308,6308,6308,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2263,103,0);   --  1(1):[???]说: 啊哟，不好！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2264,104,0);   --  1(1):[???]说: 那番僧追不过来了。二位公*子不妨在此小住一晚，明日*我家公子就回来了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2265,53,0);   --  1(1):[段誉]说: 如此甚好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_19(31,15);   --  19(13):主角移动至1F-F
    instruct_40(3);   --  40(28):改变主角站立方向3
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

