--function oldevent_482()
    instruct_1(1912,122,0);   --  1(1):[???]说: 阁下天资聪颖，我出一个对*联来考考阁下。“琴瑟琵琶*，八大王一般头面”，你能*对出下联吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_60(-2,17,2800,47,0) ==false then    --  60(3C):判断场景-2事件位置17是否有贴图2800是则跳转到:Label0

        if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label1
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label1

        instruct_37(-1);   --  37(25):增加道德-1

        if instruct_6(182,4,0,0) ==false then    --  6(6):战斗[182]是则跳转到:Label2
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label2

        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(-2,12,1,0,493,0,0,7096,7096,7096,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label0

    instruct_1(1913,0,1);   --  1(1):[AAA]说: 这有何难，听我的。*“魑魅魍魉，四小鬼各自肚*肠”。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1914,122,0);   --  1(1):[???]说: 阁下高才，佩服佩服。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,12,1,0,493,0,0,7096,7096,7096,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_37(1);   --  37(25):增加道德1
    instruct_34(0,3);   --  34(22):AAA增加资质3
    instruct_0();   --  0(0)::空语句(清屏)
--end

