--function oldevent_458()

    if instruct_16(30,6,0) ==false then    --  16(10):队伍是否有[郭靖]是则跳转到:Label0
        instruct_1(1690,56,0);   --  1(1):[黄蓉]说: 我爹爹不要我了……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(1690,56,0);   --  1(1):[黄蓉]说: 我爹爹不要我了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1691,55,1);   --  1(1):[郭靖]说: 他为什么不要你呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1692,56,0);   --  1(1):[黄蓉]说: 他在家里关了一个人，好可*怜，我就给那个人送饭吃，*结果爹爹就骂我，坏爹爹，*坏爹爹。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1693,55,1);   --  1(1):[郭靖]说: 哦，原来你爹爹是坏人啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1694,56,0);   --  1(1):[黄蓉]说: 不许你这样说我爹！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1695,55,0);   --  1(1):[郭靖]说: 那你刚才自己又说……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1696,56,0);   --  1(1):[黄蓉]说: 我自己可以说，别人不能说*。坏爹爹，也不来找我，我*没有钱，没饭吃，都成了叫*化子啦，呜呜呜……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1697,55,1);   --  1(1):[郭靖]说: 你好可怜，你需要钱吗？我*这里有，都给你吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1698,246,1);   --  1(1):[???]说: 喂，郭兄，这可是你全部的*钱啊，给一个素不相识的小*叫化……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1699,55,1);   --  1(1):[郭靖]说: 没关系啊，你看她多可怜啊*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1700,56,0);   --  1(1):[黄蓉]说: 你，你，呜呜呜……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1701,55,1);   --  1(1):[郭靖]说: 姑娘，你怎么又哭了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1702,56,0);   --  1(1):[黄蓉]说: 头一次有人对我这么好，呜*呜呜……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_19(20,31);   --  19(13):主角移动至14-1F
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_3(-2,15,0,0,0,0,0,7972,7972,7972,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1703,61,0);   --  1(1):[欧阳克]说: 哈哈，黄姑娘，我们又见面*了，我是真心诚意喜欢你，*你又何必拒人于千里之外呢*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1704,56,0);   --  1(1):[黄蓉]说: 可我偏偏看你十分讨厌！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1705,61,0);   --  1(1):[欧阳克]说: 家叔与令尊齐名武林，我与*黄姑娘又是一见钟情，不如*我们从此结为夫妻，相约白*首，岂不美哉？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1706,56,0);   --  1(1):[黄蓉]说: 哼，欧阳锋就会弄蛇使毒，*有什么真本事？也配与我爹*爹齐名？真没羞。所以才教*出你这么个没羞没臊的小毒*物。你要再纠缠我，我可对*你不客气了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1707,55,1);   --  1(1):[郭靖]说: 你不要欺负这位姑娘。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1708,61,0);   --  1(1):[欧阳克]说: 哪里来的野小子，也敢在本*公子面前放肆。你听清楚了*，我叔叔乃是江湖上赫赫有*名的西毒欧阳锋，我就是白*驼山少主，欧阳克，你们两*个识相的就给我滚远点！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1709,0,1);   --  1(1):[AAA]说: ＜哇，西毒欧阳锋，好厉害*，武林中数一数二的人物啊*！＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1710,55,1);   --  1(1):[郭靖]说: 我不管你是吸什么毒的，总*之你不能欺负这位姑娘。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1711,61,0);   --  1(1):[欧阳克]说: 臭小子，找打是不是？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1712,0,1);   --  1(1):[AAA]说: ＜这欧阳克武功不俗，他叔*叔更加不得了，我是否应该*与他为敌呢？＞
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(0,174) ==true then    --  5(5):是否选择战斗？否则跳转到:Label1
        instruct_37(2);   --  37(25):增加道德2
        instruct_1(1713,245,1);   --  1(1):[???]说: 路见不平，拔刀相助，我最*喜欢英雄救美，郭兄，我们*上！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(69,3,0,0) ==false then    --  6(6):战斗[69]是则跳转到:Label2
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label2

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1714,61,0);   --  1(1):[欧阳克]说: 好小子，给我记住！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1715,55,1);   --  1(1):[郭靖]说: 那你就记好了，我叫郭靖。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1716,61,0);   --  1(1):[欧阳克]说: 哼！*黄姑娘，咱们就此别过，*改日我定叫我叔父到桃花岛*提亲，你可要等着我啊。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1717,56,0);   --  1(1):[黄蓉]说: 呸！不要脸！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1718,55,1);   --  1(1):[郭靖]说: 他已经跑了，姑娘没事吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1719,56,0);   --  1(1):[黄蓉]说: 谁说没事，我饿啦……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1720,55,1);   --  1(1):[郭靖]说: 那我请你吧，你想吃点什么*？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1721,56,0);   --  1(1):[黄蓉]说: 这里穷乡僻壤，没什么好吃*的，走，我们去大馆子。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1722,55,1);   --  1(1):[郭靖]说: 好啊，你说哪里就是哪里。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1723,0,1);   --  1(1):[AAA]说: 郭兄……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1724,55,1);   --  1(1):[郭靖]说: 这位少侠，我要请这位姑娘*吃饭，先走了。这是我四师*父教我的刀法，你拿去吧，*可以防身的。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1725,56,0);   --  1(1):[黄蓉]说: 走，我们好好吃一顿，然后*我领你去见一位前辈。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_21(30);   --  21(15):[郭靖]离队
        instruct_3(23,0,1,0,463,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洪七公居]:场景事件编号 [0]
        instruct_3(23,7,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:场景[洪七公居]:场景事件编号 [7]
        instruct_3(23,6,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:场景[洪七公居]:场景事件编号 [6]
        instruct_3(23,10,0,0,0,0,462,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[洪七公居]:场景事件编号 [10]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_2(163,1);   --  2(2):得到物品[南山刀谱][1]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(2001,0,1);   --  1(1):[AAA]说: 那西毒欧阳锋可不是好惹的*，郭大哥，我们还是别管这*闲事了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2002,55,1);   --  1(1):[郭靖]说: 这可不行，这位姑娘要吃亏*了。他武功再高强，我也不*怕。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2003,61,0);   --  1(1):[欧阳克]说: 哼，知道厉害了吧。哪里来*的混小子，在这强出头！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2004,56,0);   --  1(1):[黄蓉]说: 你打不过他的，我们快跑。*我知道一位高人住的地方，*你跟我来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2005,61,0);   --  1(1):[欧阳克]说: 哼，什么高人，还能高得过*我叔叔吗？我看你往哪跑。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(23,7,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:场景[洪七公居]:场景事件编号 [7]
    instruct_3(23,6,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:场景[洪七公居]:场景事件编号 [6]
    instruct_3(23,10,0,0,0,0,501,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[洪七公居]:场景事件编号 [10]
    instruct_3(23,8,0,0,0,0,0,7972,7972,7972,-2,-2,-2);   --  3(3):修改事件定义:场景[洪七公居]:场景事件编号 [8]
    instruct_3(41,1,1,0,513,0,0,7106,7106,7106,-2,-2,-2);   --  3(3):修改事件定义:场景[山洞]:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2006,0,1);   --  1(1):[AAA]说: 唉，郭靖跟着那个姑娘一起*跑了。我总算没得罪西毒欧*阳锋，说不定日后能得到什*么好处。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_21(30);   --  21(15):[郭靖]离队
    instruct_37(-2);   --  37(25):增加道德-2
--end

