--function oldevent_310()
    instruct_1(1099,0,1);   --  1(1):[AAA]说: 前辈就是张三丰太师父吗，*晚辈叩见。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1100,5,0);   --  1(1):[张三丰]说: 正是老朽。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1101,247,1);   --  1(1):[???]说: 晚辈实在荣幸万分，能见到*当今武林的泰山北斗。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1102,5,0);   --  1(1):[张三丰]说: 那里，那里。小兄弟太夸奖*老朽了。据我所知，小兄弟*你是在寻找十四天书吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1103,0,1);   --  1(1):[AAA]说: 前辈也知道"十四天书"？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1104,5,0);   --  1(1):[张三丰]说: 我与南贤是老交情了，你的*事情我大概知道一些。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1105,0,1);   --  1(1):[AAA]说: 不知前辈是否知道这些书的*下落？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1106,5,0);   --  1(1):[张三丰]说: 老朽淡出江湖已久，所以并*不太清楚这些书的下落。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1107,0,1);   --  1(1):[AAA]说: 这样啊，那我还是到别处再*问问吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1108,5,0);   --  1(1):[张三丰]说: 你在江湖闯荡的过程中，若*能维持侠义的心，老朽倒是*愿意跟你切磋切磋武学。看*看能不能对你有些帮助。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1109,0,1);   --  1(1):[AAA]说: 真的吗？*能得到前辈的指点，*晚辈将一生受用无穷。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1110,5,0);   --  1(1):[张三丰]说: 记着一件事，习武之人要常*保有一副侠义心肠。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,311,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

