--function oldevent_610()

    if instruct_4(200,2,0) ==false then    --  4(4):是否使用物品[七宝指环]？是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(2655,245,1);   --  1(1):[???]说: 丁春秋，你认得这七宝指环*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2656,46,0);   --  1(1):[丁春秋]说: 你是谁，怎麽会有这东西．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2657,245,1);   --  1(1):[???]说: 见到掌门还不跪下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2658,46,0);   --  1(1):[丁春秋]说: 这逍遥派掌门的信物是那偷*来的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2659,245,1);   --  1(1):[???]说: 是你师父给的，他还要我们*来替他清理门户，除去你这*武林败类．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2660,46,0);   --  1(1):[丁春秋]说: 那老贼被我打落山崖，居然*还没死，竟然还将这七宝指*环给了你．*也好，你亲自来送死，也免*得我去找这七宝指环了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2661,206,0);   --  1(1):[???]说: 师父功力，震烁古今，你竟*敢和我们作对，这叫萤火虫*与日月争光！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2662,206,0);   --  1(1):[???]说: 螳臂挡车，自不量力，可笑*啊！可笑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2663,206,0);   --  1(1):[???]说: 我师父谈笑之间，便可将你*们这一干妖魔小丑置之死地*．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2664,245,1);   --  1(1):[???]说: 你们烦不烦，要打就快打，*别在那大吹法螺．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(86,4,0,0) ==false then    --  6(6):战斗[86]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_3(-2,0,1,0,0,0,0,6600,6600,6600,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,4,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,14,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,10,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(53,0,1,0,612,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[擂鼓山]:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2665,0,1);   --  1(1):[AAA]说: 好不容易解决了这老怪．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2666,206,0);   --  1(1):[???]说: 少侠英雄无敌，小人忠诚归*附，死心塌地，愿为主人效*犬马之劳．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2667,206,0);   --  1(1):[???]说: 这天下盟主一席，非少侠莫*属．只须主人下令动手，小*人赴汤蹈火，万死不辞．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2668,206,0);   --  1(1):[???]说: 丁春秋这灯烛之火，居然也*敢和日月争光．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2669,206,0);   --  1(1):[???]说: 少侠德配天地，威震当世，*古今无比．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2670,247,1);   --  1(1):[???]说: 这些家伙转的真快，不愧是*星宿派的弟子．不过听了虽*有点肉麻，但也蛮舒服的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(5);   --  37(25):增加道德5
    instruct_0();   --  0(0)::空语句(清屏)
--end

