--function oldevent_520()
    instruct_1(2204,0,1);   --  1(1):[AAA]说: 好大一只蛤蟆！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(78,3,0,0) ==false then    --  6(6):战斗[78]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(99,0,0,0,0,0,0,6308,6308,6308,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山]:场景事件编号 [0]
    instruct_3(99,1,0,0,0,0,0,7126,7126,7126,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山]:场景事件编号 [1]
    instruct_3(99,2,0,0,0,0,0,7128,7128,7128,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山]:场景事件编号 [2]
    instruct_3(99,3,0,0,0,0,0,5330,5330,5330,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山]:场景事件编号 [3]
    instruct_3(99,4,0,0,0,0,0,7986,7986,7986,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山]:场景事件编号 [4]
    instruct_3(99,7,0,0,0,0,521,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山]:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2205,0,1);   --  1(1):[AAA]说: 真玄，差点成为这蛤蟆的晚*餐！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(26,1);   --  2(2):得到物品[莽牯朱蛤][1]
    instruct_0();   --  0(0)::空语句(清屏)
--end

