--function oldevent_502()
    instruct_14();   --  14(E):场景变黑
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2019,0,1);   --  1(1):[AAA]说: 好像西毒已经来给欧阳克提*亲了，我赶紧过去看看。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,1,0,0,0,0,8238,8238,8238,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,0,0,0,7972,7972,7972,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,0,0,0,0,7970,7970,7970,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,28,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_19(34,23);   --  19(13):主角移动至22-17
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1748,60,0);   --  1(1):[欧阳锋]说: 药兄，别来无恙？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1749,57,0);   --  1(1):[黄药师]说: 锋兄，久违了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1750,60,0);   --  1(1):[欧阳锋]说: 黄老哥，真有你的，这般美*貌的小姑娘也亏你生得出来*。这颗"通犀地龙丸"得自西*域异兽之体，并经我配以药*材制炼过，服用之后，百毒*不侵，普天下就只这一颗而*已。以后你做了我侄媳妇，*不用害怕你叔公的诸般毒蛇*毒虫。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1751,56,0);   --  1(1):[黄蓉]说: 多谢您啦！着！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1752,61,0);   --  1(1):[欧阳克]说: 哎呦！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1753,57,0);   --  1(1):[黄药师]说: 干甚么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1754,56,0);   --  1(1):[黄蓉]说: 爹爹你打死我最好，反正我*宁可死了，也不嫁这坏东西*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1755,69,0);   --  1(1):[洪七公]说: 说得好！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,27,0,0,0,0,0,6124,6124,6124,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1756,56,0);   --  1(1):[黄蓉]说: 师父，师父。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1757,69,0);   --  1(1):[洪七公]说: 药兄，老叫化不请自来啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1758,57,0);   --  1(1):[黄药师]说: 哪里哪里，七公大驾光临，*蓬荜生辉啊。蓉儿，你叫七*公做什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1759,56,0);   --  1(1):[黄蓉]说: 我拜了七公他老人家为师。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1760,57,0);   --  1(1):[黄药师]说: 七兄青眼有加，兄弟感激不*尽，只是小女胡闹顽皮，还*盼七兄多加管教。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1761,69,0);   --  1(1):[洪七公]说: 药兄家传武学，博大精深，*这小妮子一辈子也学不了，*又怎用得着我来多事？不瞒*你说，我收她为徒，其志在*于吃白食，骗她时时烧些好*菜给我吃，你也不用谢我。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1762,57,0);   --  1(1):[黄药师]说: 呵呵呵，七兄，大驾光临桃*花岛，不知有何贵干。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1763,69,0);   --  1(1):[洪七公]说: 我来向你求一件事。只怕这*件事不易办。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1764,57,0);   --  1(1):[黄药师]说: 若是易办之事，七兄也想不*到小弟了。只要七兄一句话*，火里火里去，水里水里去*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1765,69,0);   --  1(1):[洪七公]说: 这两个都是我徒儿，我已答*允他们，要向药兄恳求，让*他们成亲。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1766,57,0);   --  1(1):[黄药师]说: 啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1767,60,0);   --  1(1):[欧阳锋]说: 七兄，你此言差矣！药兄的*千金早已许配舍侄，今日兄*弟就是到桃花岛来行纳币文*定之礼的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1768,69,0);   --  1(1):[洪七公]说: 黄老邪，现今你一女许配两*家，你看怎么办吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1769,57,0);   --  1(1):[黄药师]说: 这倒教兄弟好生为难，只得*出三个题目，考两位世兄一*考。哪一位高才捷学，小女*就许配于他，兄弟决不偏袒*。两个老友瞧着好也不好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1770,69,0);   --  1(1):[洪七公]说: 我就知道黄老邪花样多，快*说来听听。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1771,57,0);   --  1(1):[黄药师]说: 这第一道考题嘛，自然是比*武。可是他二人都志在争夺*小女，若是动手，必然伤了*和气。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1772,60,0);   --  1(1):[欧阳锋]说: 呵呵，看来是你这位岳父大*人要亲自试试未来女婿的功*夫了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1773,57,0);   --  1(1):[黄药师]说: 不然，如果我亲自出手，难*免不会有人说我偏心。需得*找一位局外之人，这样吧，*就由这位小兄弟代劳吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1774,0,1);   --  1(1):[AAA]说: 啊，我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1775,57,0);   --  1(1):[黄药师]说: 对，我见你功夫不弱，又是*此间唯一的局外之人。由你*分别和他二人比试，七兄、*锋兄与我共同做裁判。我不*会让你白做的。怎么样？开*始吧。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(77,1,0,1) ==false then    --  6(6):战斗[77]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景

    if instruct_6(76,1,0,1) ==false then    --  6(6):战斗[76]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1776,56,0);   --  1(1):[黄蓉]说: 各位观众，现在"超级男生"*的争夺战已经进入白热化，*现在走上PK台的是北丐之徒*郭靖和西毒之侄欧阳克。我*们来听一下各位评审老师的*点评。首先是洪老师。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1777,69,0);   --  1(1):[洪七公]说: 靖儿，如果你不练武，那将*是中国武坛的损失！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1778,56,0);   --  1(1):[黄蓉]说: 接下来是欧阳老师。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1779,60,0);   --  1(1):[欧阳锋]说: 克儿的基础很好，一看就知*道是名师指点。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1780,56,0);   --  1(1):[黄蓉]说: 接下来是黄老师。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1781,57,0);   --  1(1):[黄药师]说: 二位贤侄表现都不错……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1782,56,0);   --  1(1):[黄蓉]说: 那么，评审团最后的决定是*……好，有结果出来了——*郭靖！恭喜靖哥哥成功闯过*第一关。我可是最忠实的"*锅巴"呦！让我一起大声的*为靖哥哥加油，"郭靖郭靖*，脑筋不灵，刻苦用功，终*会成名！"
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1783,57,0);   --  1(1):[黄药师]说: 这第一场比试是郭贤侄胜了*。接下来是第二场，我以音*律考教两位。两位贤侄各折*一根竹枝，敲击我箫声的节*拍，瞧谁打得好，谁就胜这*第二场。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1784,57,2);   --  1(1):[黄药师]说: 黄药师吹奏一曲碧海潮声曲*，欧阳克可以打对节拍，郭*靖竟可与箫声相抗，不禁令*人称奇。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1785,57,0);   --  1(1):[黄药师]说: 论内功是郭贤侄强些，但我*刚才考的是音律，那却是欧*阳贤侄高明得多了……这样*罢，这一场两人算是平手。*我再出一道题目，让两位贤*侄一决胜负。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1786,60,0);   --  1(1):[欧阳锋]说: 对，对，再比一场。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1787,57,0);   --  1(1):[黄药师]说: 这本册子是拙荆当年所手书*，乃她心血所寄，现下请两*位贤侄同时阅读一遍，然后*背诵出来，谁背得又多又不*错，我就把女儿许配于他。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1788,69,0);   --  1(1):[洪七公]说: 黄老邪，谁听你鬼话连篇？*你明知我徒儿傻气，不通诗*书，却来考他背书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1789,55,0);   --  1(1):[郭靖]说: 黄岛主，师父，弟子与欧阳*大哥比试一下背书就是。弟*子资质鲁钝，输了也是该的*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1790,69,0);   --  1(1):[洪七公]说: 好哇！你爱丢丑，只管现眼*就是，请啊，请啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1791,57,0);   --  1(1):[黄药师]说: 好，那么现在开始。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1792,55,0);   --  1(1):[郭靖]说: ＜咦，这，这……怎么和周*大哥教我背的一模一样，嗯*……周大哥教我背的还要更*多些……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1793,61,0);   --  1(1):[欧阳克]说: 那么小侄先背了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1794,57,0);   --  1(1):[黄药师]说: 不错，仓卒之间，难得你背*得这许多，郭贤侄，该你了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1795,55,0);   --  1(1):[郭靖]说: 天之道，损有余而补不足，*是故虚胜实，不足胜有余…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1796,57,0);   --  1(1):[黄药师]说: 梅超风失落的《九阴真经》*，可是到了你的手中？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1797,55,0);   --  1(1):[郭靖]说: 没有啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1963,60,0);   --  1(1):[欧阳锋]说: 郭贤侄，这《九阴真经》的*经文，你是从何处学来的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1798,55,0);   --  1(1):[郭靖]说: 我背的是《九阴真经》？不*对，不是的。那是周大哥教*我背的，是他自创的武功秘*诀。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1799,69,0);   --  1(1):[洪七公]说: 你说老顽童周伯通？你怎地*叫他大哥？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1800,55,0);   --  1(1):[郭靖]说: 这个，我，周大哥非要和我*结拜……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1801,69,0);   --  1(1):[洪七公]说: 一老一小，胡闹胡闹
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1802,60,0);   --  1(1):[欧阳锋]说: 那周伯通现在哪里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1803,57,0);   --  1(1):[黄药师]说: 周伯通就在桃花岛！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,35,0,0,0,0,0,8238,8238,8238,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,8218,8218,8218,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,7972,7972,7972,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,36,0,0,0,0,0,8000,8000,8000,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_19(9,31);   --  19(13):主角移动至9-1F
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1804,57,0);   --  1(1):[黄药师]说: 周伯通，你手里怎么还有九*阴真经的下卷？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1805,64,0);   --  1(1):[周伯通]说: 本来呢是没有的，可是你的*傻女婿给我送来了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1806,57,0);   --  1(1):[黄药师]说: 姓郭的，你怎么说不知道
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1807,55,0);   --  1(1):[郭靖]说: 我真是不知啊
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1808,64,0);   --  1(1):[周伯通]说: 你怎么不知？你说亲手从梅*超风那里抢来，幸亏黄药师*那老头儿不知道。你还说学*通了经书之后，从此天下无*敌。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1809,55,0);   --  1(1):[郭靖]说: 大哥，我……我几时说过？*岳父……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1810,57,0);   --  1(1):[黄药师]说: 你这狡诈贪得的小子，谁是*你的岳父？今后你再踏上桃*花岛一步，休怪黄某无情。*你们都走吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1811,60,0);   --  1(1):[欧阳锋]说: ＜看来想取得九阴真经，就*要从周伯通和姓郭的这傻小*子身上下手＞，七兄，周兄*，坐兄弟的船走吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1812,64,0);   --  1(1):[周伯通]说: 我怕蛇，我不坐老毒物的船*。黄老邪，我要坐那艘大船*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1813,57,0);   --  1(1):[黄药师]说: 这船最不吉利，坐了的人非*病即灾，是以停泊在这里向*来不用的。你若不信，我马*上把船烧了给你看。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1814,64,0);   --  1(1):[周伯通]说: 我要坐新船，我要坐新船。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1815,69,0);   --  1(1):[洪七公]说: 药兄，老叫化一生不吉利，*就陪老顽童坐坐这艘凶船，*咱们来个以毒攻毒，斗它一*斗，瞧是老叫化的晦气重些*呢，还是你这艘凶船厉害。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1816,57,0);   --  1(1):[黄药师]说: 黄某不敢相欺，坐这艘船实*在凶多吉少。两位实不必甘*冒奇险。只是此中原由，不*便明言。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1817,69,0);   --  1(1):[洪七公]说: 你已一再有言在先，老叫化*若是晕船归天，仍是赞你药*兄够朋友。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1818,57,0);   --  1(1):[黄药师]说: 两位功夫高强，想来必能逢*凶化吉，黄某倒是多虑了。*姓郭的小子，你也去罢。这*位少侠，你刚才帮了黄某的*忙，这套落英神剑掌就传授*给你吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(101,1);   --  2(2):得到物品[落英神剑掌][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1819,57,0);   --  1(1):[黄药师]说: 你们都走吧，都走吧，桃花*岛不欢迎任何人！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(98,16,1,0,503,0,0,7970,7970,7970,-2,-2,-2);   --  3(3):修改事件定义:场景[明霞岛]:场景事件编号 [16]
    instruct_3(98,14,1,0,0,0,0,5154,5154,5154,-2,-2,-2);   --  3(3):修改事件定义:场景[明霞岛]:场景事件编号 [14]
    instruct_19(34,43);   --  19(13):主角移动至22-2B
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_39(10);   --  39(27):打开场景山洞
--end

