--function oldevent_805()
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(3281,33,0);   --  1(1):[黑白子]说: 你这臭小子，看你做了什麽*好事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3282,34,0);   --  1(1):[黄钟公]说: 我早该知道天底下那有这麽*好的事情，原来这一切都是*你设计出来的诡计．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3283,32,0);   --  1(1):[秃笔翁]说: 你这小子，竟然利用我们所*好，实在太可恶了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3284,0,1);   --  1(1):[AAA]说: 你们在那你一言我一句的，*唱双簧啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3285,31,0);   --  1(1):[丹青生]说: 小子，你真是太大胆了，*竟敢把任老怪给放了，*看我饶不饶你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3286,33,0);   --  1(1):[黑白子]说: 大哥，别跟这小子罗嗦了，*此时再也顾不得什麽以老欺*小的狗屁道义了．*先将这小子捉上黑木崖，向*东方教主请罪，否则咱们可*就吃不完兜着走了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3287,34,0);   --  1(1):[黄钟公]说: 好，咱们一起上．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3288,0,1);   --  1(1):[AAA]说: 谁怕谁！乌龟怕铁鎚！*四个一起上最好，*省得我麻烦．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(47,4,0,0) ==false then    --  6(6):战斗[47]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3289,31,0);   --  1(1):[丹青生]说: 小子，*你可知你放走的是谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3290,0,1);   --  1(1):[AAA]说: 不就是一位不喜欢阳光，喜*欢生活在地洞里的老前辈吗*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3291,32,0);   --  1(1):[秃笔翁]说: 你是真不知还是假不知，你*放走了任老怪，就是与东方*教主和我日月神教为敌．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3292,33,0);   --  1(1):[黑白子]说: 我们是奉教主之命，*在此看守任老怪的，你居然*利用我们的弱点救他出去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3294,31,0);   --  1(1):[丹青生]说: 你要知道，任老怪重出江湖*，江湖上又将是一场血雨腥*风。那个小子，你是华山派*的吧，任我行重出江湖可能*第一个要灭掉的就是你华山*派！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3295,35,1);   --  1(1):[令狐冲]说: 什么……？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3293,34,0);   --  1(1):[黄钟公]说: 别说了，得赶紧回黑木崖向*东方教主报告这件事．*走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3297,35,1);   --  1(1):[令狐冲]说: 那个人，那个人就是任我行*，日月神教的前任教主？？*！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3296,0,1);   --  1(1):[AAA]说: 令狐大哥，你接下来有什么*打算？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3298,35,1);   --  1(1):[令狐冲]说: 你刚才也听到了，任我行重*出江湖是一件大事，我要赶*去福建，向我师父禀报。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3299,0,1);   --  1(1):[AAA]说: 那好吧，令狐大哥，咱们就*此别过，后会有期。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(56,10,0,0,0,0,883,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [10]
    instruct_3(56,12,0,0,0,0,883,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [12]
    instruct_3(56,11,0,0,0,0,883,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [11]
    instruct_3(56,7,0,0,0,0,0,5962,5962,5962,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [7]
    instruct_3(56,8,0,0,0,0,0,7166,7166,7166,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [8]
    instruct_3(56,9,0,0,0,0,0,7152,7152,7152,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [9]
    instruct_3(56,6,0,0,0,0,0,7148,7148,7148,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [6]
    instruct_21(35);   --  21(15):[令狐冲]离队
--end

