--function oldevent_242()
    instruct_37(2);   --  37(25):增加道德2
    instruct_26(60,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,7,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,0,0,0,0,0,0,7034,7034,7034,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,7,0,0,0,0,0,7050,7050,7050,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,3,0,0,0,0,0,5970,5970,5970,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,0,0,0,0,6058,6058,6058,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,0,0,0,6786,6786,6786,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,5892,5892,5892,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,2,0,0,0,0,0,5454,5454,5454,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(50,36,33,36);   --  30(1E):主角走动50-36--33-36
    instruct_1(678,0,1);   --  1(1):[AAA]说: 陈当家，各位英雄，你们都*来啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(679,75,0);   --  1(1):[???]说: 是啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(680,0,1);   --  1(1):[AAA]说: 这里发生了什么事？这位是……？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(681,75,0);   --  1(1):[???]说: 这便是威震河朔的王维扬王*老英雄，张召重连使诡计，*要把王老英雄至于死地。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(682,0,1);   --  1(1):[AAA]说: 哼，这张召重甘为鹰犬，为*祸武林，我们先把他拿下再*说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(683,80,0);   --  1(1):[???]说: 你们仗着人多势众，张某不*服，有本事和张某单挑。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(684,245,1);   --  1(1):[???]说: 你以为你今日还能全身而退*么？红花会的众位英雄，这*一仗就交给小弟了，我倒要*看看你张召重到底有多大本*事！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(143,3,0,0) ==false then    --  6(6):战斗[143]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,2,0,0,0,0,0,5318,5318,5318,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(152,1);   --  2(2):得到物品[书剑恩仇录][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(685,0,1);   --  1(1):[AAA]说: 咦？这不是天书么？原来一*直在他身上！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(686,235,0);   --  1(1):[???]说: 少侠，陈当家，各位英雄，*救命之恩，如同再造。我过*去有对不起各位英雄的地方*，还望见谅。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(687,0,1);   --  1(1):[AAA]说: 王老英雄不必客气。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(688,75,0);   --  1(1):[???]说: 过去的事，我们也有不对的*地方，还望王老英雄海涵。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(689,235,0);   --  1(1):[???]说: 从今日起，我金盆洗手，退*出武林，回家养老啦。各位*，告辞了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(690,75,0);   --  1(1):[???]说: 少侠，你协助我们救出了文*四哥，今日又手刃元凶，大*快人心。今后若有用得到我*红花会的地方，尽管开口。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(691,0,1);   --  1(1):[AAA]说: 我一直在寻找十四天书，如*果能得陈当家相助，那真是*再好不过了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(692,75,0);   --  1(1):[???]说: 好，愿助少侠一臂之力。那*我回去安排一下红花会的事*情，然后就赶去小村。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(104,69,1,0,976,0,0,7246,7246,7246,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [69]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(70,37,1,0,165,0,0,7006,7006,7006,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [37]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

