--function oldevent_275()

    if instruct_4(231,2,0) ==false then    --  4(4):是否使用物品[火蟾]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_32(231,-1);   --  32(20):物品[火蟾]+[-1]
    instruct_1(865,0,1);   --  1(1):[AAA]说: 韦蝠王，快将这火蟾服下，*应该可以治你的病。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(866,14,0);   --  1(1):[韦一笑]说: 多谢少侠，韦一笑完全好了*，吸血蝙蝠再也不用吸人血*了，太好了，哈哈哈，少侠*，这是我的生平绝学寒冰绵*掌，就赠与少侠，聊表谢意*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(108,1);   --  2(2):得到物品[寒冰绵掌][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,92,1,0,276,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [92]
    instruct_37(1);   --  37(25):增加道德1
--end

