--function oldevent_695()
    instruct_1(2844,256,0);   --  1(1):[???]说: 对了，我还有一件非常重要*的事情要提醒你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2845,0,1);   --  1(1):[AAA]说: 哦？什么事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2846,256,0);   --  1(1):[???]说: 你还欠我五两银子没还！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2847,0,1);   --  1(1):[AAA]说: ……*我不认识你……*再见！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,696,697,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

