--function oldevent_353()
    instruct_3(-2,-2,1,0,361,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_1(1323,0,1);   --  1(1):[AAA]说: 姑娘……可是这金龙帮之人*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1324,239,0);   --  1(1):[???]说: 是又怎么样？你想连我也一*起杀么？你来呀，你来呀！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1325,245,1);   --  1(1):[???]说: 哼，别说这些人不是我杀的*，就算是我杀的又如何？不*过是为了帮闵二爷报仇而已*。你这小丫头再跟我罗嗦，*我就让你和他们一样！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1326,239,0);   --  1(1):[???]说: 你杀了我容易，可是你想要*的东西就永远得不到了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1327,0,1);   --  1(1):[AAA]说: 什么东西？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1328,239,0);   --  1(1):[???]说: 你不是在找十四天书吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1329,0,1);   --  1(1):[AAA]说: 神啊，为什么每个人都知道*我要找十四天书……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1330,239,0);   --  1(1):[???]说: 其中一本《碧血剑》，只有*我知道在哪里。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1331,0,1);   --  1(1):[AAA]说: 那你要怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1332,239,0);   --  1(1):[???]说: 我要你替我金龙帮报仇！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1333,0,1);   --  1(1):[AAA]说: 你让我去杀闵子华？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1334,239,0);   --  1(1):[???]说: 哼，仙都派那几个人，本姑*娘我自由办法对付。在灭我*金龙帮的人当中，有几个是*华山派穆人清的徒弟，哼哼*，你帮我把他们杀了，《碧*血剑》一书就是你的了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1335,0,1);   --  1(1):[AAA]说: ……为了天书，好，我答应*你，你也要说话算话，不许*反悔！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1336,239,0);   --  1(1):[???]说: 那是自然。听说穆人清有个*徒弟叫袁承志，刚刚去了云*南五仙教，你就先去找他吧*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1337,244,1);   --  1(1):[???]说: ＜袁公子，你不要怪我，虽*然我们也算是朋友，不过现*在……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,353,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(96,0,0,0,0,0,354,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[五仙教]:场景事件编号 [0]
    instruct_17(95,0,12,48,986);   --  17(11):修改场景贴图:场景[大功坊]层0坐标C-30
    instruct_3(95,10,1,0,343,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[大功坊]:场景事件编号 [10]
    instruct_37(-1);   --  37(25):增加道德-1
--end

