--function oldevent_749()
    instruct_1(2983,79,0);   --  1(1):[???]说: 小林子，你别练功了，陪我*玩玩吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2984,36,0);   --  1(1):[林平之]说: 师姐，你看我这一招用的对*不对？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2985,79,0);   --  1(1):[???]说: 这个小林子，就知道拼命练*功，也不陪我玩。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2986,0,1);   --  1(1):[AAA]说: 岳姑娘好。林兄弟他为报家*仇，刻苦用功也是情理之中*。岳姑娘可以找别的师兄弟*玩啊，你大师兄令狐冲呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2987,79,0);   --  1(1):[???]说: 跟别人玩没意思嘛！大师兄*？他被爹爹罚到后面的思过*崖去了，哦，说起来，我也*有十多天没去看过他了，少*侠要是用空，就代我去看看*他吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(81,0,0,0,0,0,752,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[思过崖]:场景事件编号 [0]
--end

