--function oldevent_516()
    instruct_37(-1);   --  37(25):增加道德-1
    instruct_1(2169,0,1);   --  1(1):[AAA]说: 前辈，我已经杀了江南七怪*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2170,78,0);   --  1(1):[???]说: 哈哈哈哈，臭蝙蝠终于死了*，贼汉子，我终于替你报了*仇，哈哈哈哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2171,0,1);   --  1(1):[AAA]说: 前辈一个人生活在这里恐怕*很不方便，不如搬到我那里*去吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2172,78,0);   --  1(1):[???]说: 你前辈前辈的叫了半天，我*很老么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2173,0,1);   --  1(1):[AAA]说: 哦，不不不，前辈，哦，不*，您，一点都不老。我就叫*您梅大姐吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2174,78,0);   --  1(1):[???]说: 哈哈哈哈，好，我就和你一*起走吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,77,1,0,979,0,0,7106,7106,7106,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [77]

    if instruct_20(21,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label0
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_10(78);   --  10(A):加入人物[梅超风]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(12,78,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(70,59,1,0,171,0,0,7106,7106,7106,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [59]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

