--function oldevent_767()
    instruct_1(3107,106,0);   --  1(1):[???]说: 欢迎岳掌门大驾光临啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3108,19,0);   --  1(1):[岳不群]说: 在下带了徒儿外出游历访友*，以增见闻，第一位要拜访*的，便是中州大侠、金刀无*敌王老爷子。我们这些不速*之客，可来得鲁莽了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3109,106,0);   --  1(1):[???]说: 我外孙平之，多蒙岳掌门照*顾，老朽在此多谢了。我看*令爱一表人才，和我那平之*孩儿很谈的来啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3110,19,0);   --  1(1):[岳不群]说: 是啊是啊，他俩年纪相若，*很是投机啊，哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
--end

