--function oldevent_241()
    instruct_37(-2);   --  37(25):增加道德-2
    instruct_26(60,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,7,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(656,208,0);   --  1(1):[???]说: 少侠，你来啦，我这就给你*引荐张大人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_19(23,29);   --  19(13):主角移动至17-1D
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_25(23,29,23,29);   --  25(19):场景移动23-29--23-29
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(657,208,0);   --  1(1):[???]说: 张大人，这位就是我和您说*的，在回疆帮了我们的少侠*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(658,0,1);   --  1(1):[AAA]说: 张大人，兴会兴会。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(659,80,0);   --  1(1):[???]说: 少侠武功不凡，又有报国之*心，真是英雄出少年啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(660,0,1);   --  1(1):[AAA]说: 张大人过奖了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(661,80,0);   --  1(1):[???]说: 红花会那群反贼，近日要来*此捣乱，少侠既然有心效忠*朝廷，不妨留下来与老夫共*同抗敌。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(662,0,1);   --  1(1):[AAA]说: ＜谁要效忠朝廷啊？我只不*过不想得罪你们而已……＞*这个……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(663,80,0);   --  1(1):[???]说: 哈哈哈，少侠放心，老夫绝*不会亏待与你，来人啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(664,0,1);   --  1(1):[AAA]说: 这是……？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(665,80,0);   --  1(1):[???]说: 区区纹银三千两，还望少侠*笑纳。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(174,3000);   --  2(2):得到物品[银两][3000]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(666,247,1);   --  1(1):[???]说: 这个，这个……不好吧……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(667,80,0);   --  1(1):[???]说: 报效朝廷，自然会有封赏，*少侠就不必推辞啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(668,208,0);   --  1(1):[???]说: 报告张大人，红花会的反贼*已经杀进来了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(669,80,0);   --  1(1):[???]说: 少侠，我要去后面守着囚禁*要犯之地，前面的来敌就拜*托少侠了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(670,0,1);   --  1(1):[AAA]说: 我……唉，拿人家的手短啊*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,23,0,0,0,0,0,7006,7006,7006,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,26,0,0,0,0,0,5970,5970,5970,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(671,152,0);   --  1(1):[???]说: 又是你这小子，协助官兵，*为非作歹。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(672,0,1);   --  1(1):[AAA]说: 我……＜真倒霉，天书没找*到，莫名其妙地得罪了红花*会。管不了那么多了，拿人*钱财，替人消灾，看来今日*只有和他们一战了＞
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(139,3,0,0) ==false then    --  6(6):战斗[139]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,3,0,0,0,0,0,7034,7034,7034,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,13,1,0,238,0,0,6092,6092,6092,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,1,0,238,0,0,6092,6092,6092,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,1,0,238,0,0,6092,6092,6092,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,2,1,0,238,0,0,6092,6092,6092,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(673,80,0);   --  1(1):[???]说: 少侠好身手，我果然没看错*人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(674,0,1);   --  1(1):[AAA]说: 那要犯可还安全？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(677,80,0);   --  1(1):[???]说: 你守前，我守后，红花会虽*然兵分两路，却是无功而返*。哈哈哈。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(675,0,1);   --  1(1):[AAA]说: ＜我觉得还是离开这里比较*好……＞，既然此间事情已*了，我要告辞了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(676,80,0);   --  1(1):[???]说: 也好，我料定这些反贼短期*内不会再回来了。只要我成*功把要犯押入京城，那就是*大功一件，哈哈。我还有个*比武约会，现在要赶去恒山*，咱们就此别过吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(38,1,0,0,0,0,243,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[恒山山麓]:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

