--function oldevent_469()
    instruct_14();   --  14(E):场景变黑
    instruct_37(1);   --  37(25):增加道德1
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_13();   --  13(D):重新显示场景
    instruct_30(28,47,28,45);   --  30(1E):主角走动28-47--28-45
    instruct_1(1889,0,1);   --  1(1):[AAA]说: 郭大哥、黄姑娘，你们怎么*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1890,55,0);   --  1(1):[郭靖]说: 小兄弟快来，蓉儿被裘千仞*打伤了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1891,245,1);   --  1(1):[???]说: 好，我来抵挡一阵，你们快*走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1892,67,0);   --  1(1):[裘千仞]说: 哪里来的小贼，不知天高地*厚，敢在此撒野！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(72,3,0,0) ==false then    --  6(6):战斗[72]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,0,1,0,470,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(47,13,0,0,0,0,483,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [13]
    instruct_3(47,2,1,0,478,479,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [2]
    instruct_3(47,8,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [8]
    instruct_3(47,7,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1893,0,1);   --  1(1):[AAA]说: 看来郭大哥他们已经脱险了*，我得找找他们，应该在附*近治伤吧。
    instruct_0();   --  0(0)::空语句(清屏)
--end

