--function oldevent_11()

    if instruct_4(207,0,27) ==true then    --  4(4):是否使用物品[七心海棠]？否则跳转到:Label0
        instruct_32(207,-1);   --  32(20):物品[七心海棠]+[-1]
        instruct_1(110,2,0);   --  1(1):[程灵素]说: 你找到了？挺厉害的嘛！*断肠草的解药在这，*拿去吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(204,1);   --  2(2):得到物品[苗人凤眼毒解药][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,-2,0,12,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
--end

