--function oldevent_414()
    instruct_1(1560,8,0);   --  1(1):[唐文亮]说: 这”侠客行”的古诗图解，*包含着古往今来最博大精深*的武学秘奥．．．*你瞧，这第一句”赵客缦胡*缨”，其中对这个”胡”字*的注解．．．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(38,2,0) ==false then    --  16(10):队伍是否有[石破天]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,-2,1,0,415,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_26(-2,4,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(-2,5,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(-2,6,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

