--function oldevent_569()

    if instruct_4(200,2,0) ==false then    --  4(4):是否使用物品[七宝指环]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2413,45,0);   --  1(1):[薛慕华]说: 这……这是我逍遥派掌门之*信物，怎会在阁下手中？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2414,0,1);   --  1(1):[AAA]说: 你师祖已将逍遥派掌门传给*我兄弟了……*事情是这样的……*你师父跟我们说，如果有需*要医术高明的人加入的话，*可以来这边找你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2415,45,0);   --  1(1):[薛慕华]说: 是，少侠有什麽需要，*在下将全力配合。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2416,0,1);   --  1(1):[AAA]说: 你的医术很高明，就加入我*的队伍，日後也能帮我们治*病疗伤。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(38,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_1(2417,45,0);   --  1(1):[薛慕华]说: 是。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(104,58,1,0,959,0,0,6416,6416,6416,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [58]
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_10(45);   --  10(A):加入人物[薛慕华]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(12,45,0);   --  1(1):[薛慕华]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(70,12,1,0,131,0,0,6416,6416,6416,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [12]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
--end

