--function oldevent_634()

    if instruct_18(200,2,0) ==false then    --  18(12):是否有物品[七宝指环]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,1,0,0,0,0,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,1,0,0,0,0,7128,7128,7128,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(45,45,39,45);   --  25(19):场景移动45-45--39-45
    instruct_1(2680,118,0);   --  1(1):[???]说: 哈哈哈，我的好师姐，我算*准了你返老还童的日子，你*躲不过去的，如今你的七经*八脉都已被我震断，你的死*期已到，哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2681,117,0);   --  1(1):[???]说: 你这个臭贱人……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2682,245,1);   --  1(1):[???]说: 那个老婆婆好像受伤了，赶*快救人。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(202,4,0,0) ==false then    --  6(6):战斗[202]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_19(41,45);   --  19(13):主角移动至29-2D
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2683,0,1);   --  1(1):[AAA]说: 老婆婆，你没事吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2684,117,0);   --  1(1):[???]说: 臭小子，什么没事，老婆子*就要死啦！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2685,0,1);   --  1(1):[AAA]说: 啊？这……这……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2686,117,0);   --  1(1):[???]说: 不过那个贱人总算死在了我*前头，老婆子还得谢谢你啊*……*咦？你手上拿的是什么？*你怎么会有我们逍遥派的*掌门指环？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2687,0,1);   --  1(1):[AAA]说: 这个是无崖子前辈给我兄弟*的，事情是这样的……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2688,117,0);   --  1(1):[???]说: 师兄，师兄，你怎么在我之*前走了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2689,0,1);   --  1(1):[AAA]说: 前辈原来是无崖子前辈的师*妹啊，那刚才那个女人是…*…？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2690,117,0);   --  1(1):[???]说: 那个贱人叫李秋水，是我师*妹，敢和我争师兄，哼，终*于死在我前头了。小子，帮*我个忙，把这个信号发到空*中。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,5,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,8,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2691,240,0);   --  1(1):[???]说: 姥姥，姥姥，你怎么了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2692,117,0);   --  1(1):[???]说: 姥姥要死了，你们是不是很*开心啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2693,240,0);   --  1(1):[???]说: 属下不敢。姥姥，是谁把你*害成这样，我们去找他算帐*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2694,117,0);   --  1(1):[???]说: 哼，你们倒好心！不用啦，*这位少侠已经杀了那个贱人*。你们听着，这位少侠以后*就是灵鹫宫的新主人，快点*拜见！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2695,240,0);   --  1(1):[???]说: 参见新主人！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2696,248,1);   --  1(1):[???]说: 啊？啊。好，好，（好别扭*……）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2697,117,0);   --  1(1):[???]说: 小子，以后灵鹫宫就是你的*了。***师兄，我要去找你了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2698,240,0);   --  1(1):[???]说: 姥姥……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

