--function oldevent_602()
    instruct_1(2647,0,1);   --  1(1):[AAA]说: 贤弟，我们走了吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,82,1,0,962,0,0,7234,7234,7234,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [82]

    if instruct_20(46,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label0
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(28,38,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[少林寺]:场景事件编号 [38]
        instruct_3(35,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[星宿海]:场景事件编号 [3]
        instruct_10(49);   --  10(A):加入人物[虚竹]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(12,49,0);   --  1(1):[虚竹]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(70,10,1,0,137,0,0,6604,6648,6604,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [10]
    instruct_3(70,11,1,0,137,0,0,6650,6694,6650,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [11]
    instruct_3(35,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[星宿海]:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

