--function oldevent_589()

    if instruct_60(-2,25,2286,0,264) ==true then    --  60(3C):判断场景-2事件位置25是否有贴图2286否则跳转到:Label0
        instruct_1(2561,207,0);   --  1(1):[???]说: 嘿嘿，我叫何师我。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2562,0,1);   --  1(1):[AAA]说: 咦，你手上拿的是什么？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2563,207,0);   --  1(1):[???]说: 这个，是我讨饭用的……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2564,0,1);   --  1(1):[AAA]说: 这，这明明是丐帮丢失的打狗棒……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,1,0,0,0,0,7138,7138,7138,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2565,84,0);   --  1(1):[???]说: 哼，居然被你发现了，你待*怎样？
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_5(0,71) ==true then    --  5(5):是否选择战斗？否则跳转到:Label1
            instruct_1(2566,245,1);   --  1(1):[???]说: 大胆狂徒，还不将宝物归还*丐帮！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(2567,84,0);   --  1(1):[???]说: 小子，你找死。
            instruct_0();   --  0(0)::空语句(清屏)

            if instruct_6(201,4,0,0) ==false then    --  6(6):战斗[201]是则跳转到:Label2
                instruct_15(0);   --  15(F):战斗失败，死亡
                do return; end
                instruct_0();   --  0(0)::空语句(清屏)
            end    --:Label2

            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_3(51,12,1,0,592,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [12]
            instruct_3(51,13,1,0,592,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [13]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            instruct_2(49,1);   --  2(2):得到物品[打狗棒][1]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_37(1);   --  37(25):增加道德1
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1


        if instruct_9(0,125) ==true then    --  9(9):是否要求加入?否则跳转到:Label3

            if instruct_28(0,30,999,99,0) ==false then    --  28(1C):判断AAA品德30-999是则跳转到:Label4
                instruct_37(-5);   --  37(25):增加道德-5
                instruct_1(2570,84,0);   --  1(1):[???]说: 哈哈，原来阁下也看上了这*丐帮帮主之位。少侠在江湖*上早已英名远播，呵呵，在*下愿意跟随少侠。
                instruct_0();   --  0(0)::空语句(清屏)

                if instruct_20(39,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label5
                    instruct_14();   --  14(E):场景变黑
                    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
                    instruct_3(51,25,0,0,0,0,594,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [25]
                    instruct_0();   --  0(0)::空语句(清屏)
                    instruct_13();   --  13(D):重新显示场景
                    instruct_2(49,1);   --  2(2):得到物品[打狗棒][1]
                    instruct_0();   --  0(0)::空语句(清屏)
                    instruct_10(84);   --  10(A):加入人物[霍都]
                    instruct_0();   --  0(0)::空语句(清屏)
                    do return; end
                end    --:Label5

                instruct_14();   --  14(E):场景变黑
                instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
                instruct_3(70,34,1,0,183,0,0,7016,7016,7016,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [34]
                instruct_3(51,25,0,0,0,0,594,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [25]
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_13();   --  13(D):重新显示场景
                instruct_2(49,1);   --  2(2):得到物品[打狗棒][1]
                instruct_0();   --  0(0)::空语句(清屏)
                do return; end
            end    --:Label4

            instruct_1(2569,84,0);   --  1(1):[???]说: 这个，道不同不相为谋。
            instruct_3(-2,-2,1,0,590,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label3

        instruct_1(2568,0,1);   --  1(1):[AAA]说: 这事与我无关，我才懒得理*。
        instruct_3(-2,-2,1,0,590,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2560,207,0);   --  1(1):[???]说: 嘿嘿嘿嘿……
    instruct_0();   --  0(0)::空语句(清屏)
--end

