--function oldevent_505()
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(2075,0,1);   --  1(1):[AAA]说: 晚辈参见裘帮主
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2076,67,0);   --  1(1):[裘千仞]说: 你是谁，来此何干？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2077,0,1);   --  1(1):[AAA]说: 是西域白驼山主人欧阳先生*叫我来的，他说来了您自然*知道。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2078,67,0);   --  1(1):[裘千仞]说: 哦，是欧阳先生啊，我知道*我知道。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2079,0,1);   --  1(1):[AAA]说: ＜他的表情怎么这么奇怪？*＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2080,67,0);   --  1(1):[裘千仞]说: ＜欧阳锋和我约好，找一个*能承受住我铁掌的人，打伤*之后让他去找段皇爷治伤，*耗损其功力，以便趁机除掉*段皇爷。不过前几日我已打*伤黄蓉，段皇爷应该已经出*手治伤了，这个小子……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2081,247,1);   --  1(1):[???]说: 欧阳先生大赞裘帮主的铁掌*天下无双，而且说对晚辈十*分有用，不知……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2082,67,0);   --  1(1):[裘千仞]说: ＜可怜的小子，被欧阳锋卖*了还不知道。不过，假他的*手除掉段皇爷也好……＞你*说什么？铁掌？呵呵，自然*有用。你可知道南帝段皇爷*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2083,0,1);   --  1(1):[AAA]说: 天下五绝，如雷贯耳。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2084,67,0);   --  1(1):[裘千仞]说: 我把铁掌功夫传授给你，你*去帮我杀了段皇爷
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2085,0,1);   --  1(1):[AAA]说: 啊？这个，晚辈如何是段皇*爷的对手？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2086,67,0);   --  1(1):[裘千仞]说: 你放心，他现在应该已经内*力全失了，你只要能打发了*他的几个护卫就行了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2087,0,1);   --  1(1):[AAA]说: ＜又让我干这伤天害理的事*情，没办法，先学了铁掌再*说！＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(100,1);   --  2(2):得到物品[铁掌掌谱][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2088,67,0);   --  1(1):[裘千仞]说: 段皇爷现在出家了，就在前*边的村子里，法号叫一灯。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,506,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(47,13,0,0,0,0,507,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [13]
    instruct_3(47,2,1,0,478,479,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [2]
    instruct_3(47,8,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [8]
    instruct_3(47,7,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [7]
--end

