--function oldevent_1047()
    instruct_1(3902,237,0);   --  1(1):[???]说: 小子，本事不错嘛，居然能*进得了我的黑龙潭。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3903,0,1);   --  1(1):[AAA]说: 这有什么难的，不就是九宫*格嘛！二四为肩，六八为足*，左七右三，戴九履一，五*居中央。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3904,237,0);   --  1(1):[???]说: 这……我原以为是我独创之*法，没想到早有歌诀传世，*唉，看来我要到桃花岛救人*，是没什么希望了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3905,0,1);   --  1(1):[AAA]说: 到桃花岛救人？不知前辈要*救什么人？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3906,237,0);   --  1(1):[???]说: 就是老顽童周伯通，我听说*他被黄药师囚禁在桃花岛。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3907,0,1);   --  1(1):[AAA]说: 你是说周老爷子啊，他已经*离开桃花岛了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3908,237,0);   --  1(1):[???]说: 此话当真，你能不能把他找*来见我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3910,0,1);   --  1(1):[AAA]说: 恕在下斗胆，敢问前辈是周*老爷子的什么人？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3911,237,0);   --  1(1):[???]说: 这……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3912,0,1);   --  1(1):[AAA]说: ＜咦？这老太太的脸怎么红*了？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3913,237,0);   --  1(1):[???]说: 唉，说来话长……我本是大*理的刘贵妃……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3914,237,0);   --  1(1):[???]说: ……就这样，我的孩子死了*，而我也再没见过周伯通。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3915,0,1);   --  1(1):[AAA]说: 原来是这样啊，前辈请放心*，晚辈一定想办法把周老爷*子请过来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(20,4,1,0,1049,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[百花谷]:场景事件编号 [4]
    instruct_3(-2,-2,1,0,1048,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

