--function oldevent_496()
    instruct_37(5);   --  37(25):增加道德5
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(1971,0,1);   --  1(1):[AAA]说: 参见丘真人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1972,68,0);   --  1(1):[丘处机]说: 哦，你就是义救南帝北丐，*剑败西毒铁掌的少年英雄吧*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1973,0,1);   --  1(1):[AAA]说: 丘真人过奖。在下今日此来*，向道长请教一件事。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1974,68,0);   --  1(1):[丘处机]说: 何事？但说无妨。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1975,0,1);   --  1(1):[AAA]说: 《射雕英雄传》一书，道长*可知道？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1976,68,0);   --  1(1):[丘处机]说: 此书乃全真教振教之宝，由*历代掌门保管。不瞒少侠，*此书就在贫道身上。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,25,0,0,0,0,0,8218,8218,8218,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,26,0,0,0,0,0,8206,8206,8206,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_35(60,1,104,900);   --  35(23):设置欧阳锋武功1:逆运真经攻击力900
    instruct_1(1977,60,0);   --  1(1):[欧阳锋]说: 哈哈，在你身上就好！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1978,67,0);   --  1(1):[裘千仞]说: 锋兄，此行不虚啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1979,245,1);   --  1(1):[???]说: 又是你们两个，看招！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1980,60,0);   --  1(1):[欧阳锋]说: 臭小子，今日让你尝尝我的*蛇阵的厉害！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(3);   --  37(25):增加道德3

    if instruct_6(176,4,0,0) ==false then    --  6(6):战斗[176]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,27,1,0,498,0,0,7102,7102,7102,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1981,129,0);   --  1(1):[???]说: 着！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1982,60,0);   --  1(1):[欧阳锋]说: 啊--重、重阳真人，你没死*？不好，快撤！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1983,68,0);   --  1(1):[丘处机]说: 师，师父，您真的还活着？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1984,123,0);   --  1(1):[???]说: 师父……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1984,124,0);   --  1(1):[???]说: 师父……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1984,125,0);   --  1(1):[???]说: 师父……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1985,128,0);   --  1(1):[???]说: 师父，我们好想你……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1986,129,0);   --  1(1):[???]说: 马钰，处机，处端，处玄，*处一，大通，不二，你们都*好吧。为师没有死，我诈死*之后，摆脱尘世俗务，静心*求道。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1987,0,1);   --  1(1):[AAA]说: 晚辈参见重阳真人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1988,129,0);   --  1(1):[???]说: 呵呵，少侠不必多礼。你的*事情我早就知道了。这本《*射雕英雄传》送给你也无不*可，只是咱们都是武林中人*，自有武林中人的行事规矩*，你准备好了，可以随时来*找我。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,1,0,497,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
--end

