--function oldevent_231()
    instruct_1(565,0,1);   --  1(1):[AAA]说: 杨兄，龙姑娘，一切可好，*龙姑娘伤势如何了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(566,59,0);   --  1(1):[小龙女]说: 已经不碍事事了，多谢少侠*关心
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(567,58,0);   --  1(1):[杨过]说: 我夫妇得少侠多次多次相救*，深感大恩，若少侠有需要*之处，我夫妇自当尽力帮忙*。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(2,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(568,247,1);   --  1(1):[???]说: 近日旅途有些不顺，如能得*杨兄和龙姑娘相助，真是再*好不过了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(569,58,0);   --  1(1):[杨过]说: 既然如此，我们就直接去小*村了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(104,68,1,0,969,0,0,6186,6186,6186,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [68]
    instruct_3(104,76,1,0,970,0,0,7242,7242,7242,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [76]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(70,19,1,0,151,0,0,6188,6188,6188,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [19]
    instruct_3(70,20,1,0,153,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [20]
    instruct_37(2);   --  37(25):增加道德2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

