--function oldevent_274()
    instruct_3(-2,90,1,0,271,0,0,5342,5342,5342,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [90]
    instruct_3(-2,94,1,0,272,0,0,5334,5334,5334,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [94]
    instruct_3(-2,110,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [110]
    instruct_3(-2,102,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [102]
    instruct_3(-2,92,1,0,273,275,0,5324,5324,5324,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [92]
    instruct_3(-2,91,1,0,277,0,0,5318,5318,5318,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [91]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
--end

