--function oldevent_474()
    instruct_1(1897,67,0);   --  1(1):[裘千仞]说: 小子，你擅闯铁掌山，是何*用意？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1898,0,1);   --  1(1):[AAA]说: 哦，我是来看看这里有没有*我要找的东西。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1899,67,0);   --  1(1):[裘千仞]说: 你要找什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1902,0,0);   --  1(1):[AAA]说: 十四天书
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1900,67,0);   --  1(1):[裘千仞]说: 呵呵呵，你小子想做武林盟*主啊，也不撒泡尿照照自己*，你像吗？别说铁掌山没有*天书，就是有，你也拿不去*啊。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(6,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_1(1901,0,1);   --  1(1):[AAA]说: 这裘千仞武功不凡，我还是*不要惹他了。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1903,245,1);   --  1(1):[???]说: 士可杀，不可辱，我今日就*要领教铁掌水上飘的手段！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(71,3,0,0) ==false then    --  6(6):战斗[71]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1904,0,1);   --  1(1):[AAA]说: 怎么样，我像不像武林盟主*啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,67,0);   --  1(1):[裘千仞]说: …………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,470,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

