--function oldevent_4()
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(1,7,0) ==false then    --  16(10):队伍是否有[胡斐]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(43,72,0);   --  1(1):[田归农]说: 胡斐怎么没和少侠一起来？
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(44,72,0);   --  1(1):[田归农]说: 二位考虑得如何了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(35,1,1);   --  1(1):[胡斐]说: 大丈夫处世当光明磊落。父*仇虽大，胡某也绝不做小人*勾当。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(7,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(42,72,0);   --  1(1):[田归农]说: 少侠不妨再考虑考虑。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_37(-4);   --  37(25):增加道德-4
    instruct_3(104,84,1,0,973,0,0,7012,7012,7012,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [84]
    instruct_3(3,9,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [9]
    instruct_3(3,12,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [12]
    instruct_3(3,11,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [11]
    instruct_3(3,10,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [10]
    instruct_1(45,72,0);   --  1(1):[田归农]说: 少侠果然英明。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(37,1,1);   --  1(1):[胡斐]说: 哼！我胡某看错人了！告辞*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_21(1);   --  21(15):[胡斐]离队
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(38,244,1);   --  1(1):[???]说: 唉，胡大哥，怎么那么心急*啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(39,72,0);   --  1(1):[田归农]说: 少侠，我们不必管他。要除*掉苗人凤，光靠你我二人还*不够，我们还要再找一个人*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(40,0,0);   --  1(1):[AAA]说: 谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(41,72,0);   --  1(1):[田归农]说: 一个跌打医生！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(24,0,0,0,0,0,33,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [0]
    instruct_3(50,1,1,0,32,0,0,5168,5168,5168,-2,-2,-2);   --  3(3):修改事件定义:场景[閰基居]:场景事件编号 [1]

    if instruct_20(5,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_10(72);   --  10(A):加入人物[田归农]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_1(12,72,0);   --  1(1):[田归农]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(70,40,1,0,159,0,0,7012,7012,7012,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [40]
    instruct_0();   --  0(0)::空语句(清屏)
--end

