--function oldevent_305()
    instruct_37(1);   --  37(25):增加道德1
    instruct_1(1064,16,0);   --  1(1):[胡青牛]说: 她就要来了，怎么办？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1065,17,0);   --  1(1):[王难姑]说: 我们还是躲起来吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1066,16,0);   --  1(1):[胡青牛]说: 往哪躲呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1067,0,1);   --  1(1):[AAA]说: 二位前辈，不知何事惊惶，*晚辈能否帮得上忙？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1068,16,0);   --  1(1):[胡青牛]说: 我们有个极厉害的对头，要*来寻仇，怎么办……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,0,0,0,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1069,15,0);   --  1(1):[金花婆婆]说: 胡青牛，看你今天往哪跑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1070,16,0);   --  1(1):[胡青牛]说: 不好，她来了，老婆子，我*们只有等死了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1071,17,0);   --  1(1):[王难姑]说: 老头子……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1072,0,1);   --  1(1):[AAA]说: 两位前辈莫慌，我来会会她*。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(156,3,0,0) ==false then    --  6(6):战斗[156]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1073,15,0);   --  1(1):[金花婆婆]说: 哼，改日再来取你狗命！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1074,16,0);   --  1(1):[胡青牛]说: 多谢少侠相救之恩。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1075,0,1);   --  1(1):[AAA]说: 这个人是谁啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1076,17,0);   --  1(1):[王难姑]说: 她，其实就是我们明教的紫*杉龙王，现在隐居在灵蛇岛*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1077,16,0);   --  1(1):[胡青牛]说: 只因多年前，我拒绝为她丈*夫看病，导致她丈夫惨死。*如今，她是来寻仇了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1078,0,1);   --  1(1):[AAA]说: 哦，原来她就是紫杉龙王啊*。我看她这一去，恐怕还要*回来，二位前辈不知有何打*算？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1079,16,0);   --  1(1):[胡青牛]说: 老婆子，你说怎么办？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1080,17,0);   --  1(1):[王难姑]说: 我怎么知道？要是有个能避*难的地方就好了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1081,0,1);   --  1(1):[AAA]说: 这样吧，如果二位不嫌弃，*不妨去小村。那里是南贤北*丑的住地，我想金花婆婆应*该不会去那里杀人的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1082,16,0);   --  1(1):[胡青牛]说: 那真是太好了，老婆子，咱*们这就动身吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1083,17,0);   --  1(1):[王难姑]说: 多谢少侠。我外子略通医术*，我则略通毒术，如果少侠*有用得到我夫妇的地方，尽*管开口，我们这就去小村啦*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,72,1,0,949,0,0,5286,5286,5286,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [72]
    instruct_3(104,80,1,0,950,0,0,5290,5290,5290,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [80]
    instruct_14();   --  14(E):场景变黑
    instruct_3(70,31,1,0,109,0,0,5286,5286,5286,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [31]
    instruct_3(70,32,1,0,111,0,0,5290,5290,5290,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [32]
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
--end

