--function oldevent_452()

    if instruct_16(30,0,12) ==true then    --  16(10):队伍是否有[郭靖]否则跳转到:Label0
        instruct_1(1668,55,1);   --  1(1):[郭靖]说: 四师父好。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1669,133,0);   --  1(1):[???]说: 靖儿，教你个秘诀——*进入任何地方之前，都要存*盘。*打不过，读进度！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0


    if instruct_16(55,0,11) ==true then    --  16(10):队伍是否有[郭靖]否则跳转到:Label1
        instruct_1(1668,55,1);   --  1(1):[郭靖]说: 四师父好。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1669,133,0);   --  1(1):[???]说: 靖儿，教你个秘诀——*进入任何地方之前，都要存*盘。*打不过，读进度！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(1658,133,0);   --  1(1):[???]说: 在下南山樵子南希仁。
    instruct_0();   --  0(0)::空语句(清屏)
--end

