--function oldevent_357()
    instruct_30(49,36,45,36);   --  30(1E):主角走动49-36--45-36
    instruct_30(45,36,45,33);   --  30(1E):主角走动45-36--45-33
    instruct_30(45,33,39,33);   --  30(1E):主角走动45-33--39-33
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_37(-5);   --  37(25):增加道德-5
    instruct_1(1353,0,1);   --  1(1):[AAA]说: ??，华山派的人都在啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1354,54,0);   --  1(1):[袁承志]说: 兄台，是你啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1355,245,1);   --  1(1):[???]说: 姓袁的，我明人不作暗事，*你不用跟我称兄道弟，过去*的交情一笔勾销。我今日来*此，是要为金龙帮报仇的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1356,183,0);   --  1(1):[???]说: 金龙帮的事，是我做的，与*小师叔无关。我们应闵二爷*之邀，为他大哥报仇。这和*阁下有什么关系？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1357,245,1);   --  1(1):[???]说: 你甭管我和金龙帮是什么关*系！反正我今日来，就是要*为金龙帮报仇，华山派的人*，一个也活不了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1358,185,0);   --  1(1):[???]说: 华山乃清修之所，岂容你这*恶徒胡作非为！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(165,3,0,0) ==false then    --  6(6):战斗[165]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,4,1,0,0,0,0,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,14,1,0,0,0,0,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,1,0,0,0,0,5436,5436,5436,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,9,1,0,0,0,0,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,1,0,0,0,0,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,1,0,0,0,0,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,1,0,0,0,0,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,1,0,0,0,0,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(59,14,1,0,358,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

