--function oldevent_760()

    if instruct_16(35,2,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,4,0,0,0,0,0,7162,7162,7162,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,0,0,0,7018,7018,7018,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,3,0,0,0,0,0,7154,7154,7154,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,6,0,0,0,0,0,5178,5178,5178,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,0,0,0,5178,5178,5178,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,0,0,0,0,0,5178,5178,5178,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,0,0,0,0,0,5178,5178,5178,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,12,0,0,0,0,0,5178,5178,5178,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,20,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,21,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,22,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,23,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,24,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,25,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,26,0,0,0,0,0,5208,5208,5208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,13,0,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,0,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(28,46,30,23);   --  25(19):场景移动28-46--30-23
    instruct_1(3053,141,0);   --  1(1):[???]说: 哈哈哈，华山派一干人等，*已尽数被我点了穴道。岳不*群，你还有什么说的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3054,19,0);   --  1(1):[岳不群]说: 哼！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3052,142,0);   --  1(1):[???]说: 岳先生，我们和你无冤无仇*，今晚冒昧得罪，只不过想*借那《辟邪剑谱》一观。你*千方百计的将福威镖局的林*家少年收入门下，自然是在*图谋这部剑谱了。老朽好言*相劝，你还是献了出来罢！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3055,19,0);   --  1(1):[岳不群]说: 岳某既然落入你手，要杀便*杀，辟邪剑谱跟本不在我身*上，你杀岳某容易，想要坏*我名誉，却是作梦！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3056,35,0);   --  1(1):[令狐冲]说: 不好，快救我师父他们！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(207,3,0,0) ==false then    --  6(6):战斗[207]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,28,0,0,0,0,0,7656,7656,7656,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_19(29,23);   --  19(13):主角移动至1D-17
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3057,0,1);   --  1(1):[AAA]说: 岳掌门，您怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3058,35,1);   --  1(1):[令狐冲]说: 师父，小师妹，你们都没事*吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3059,19,0);   --  1(1):[岳不群]说: 哼，令狐少侠好剑法啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3060,35,0);   --  1(1):[令狐冲]说: 师父，我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3061,195,0);   --  1(1):[???]说: 师父，成不忧，封不平先后*败在大师兄手下，他们没脸*再来争夺华山掌门之位，咱*们还去嵩山么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3062,36,0);   --  1(1):[林平之]说: 师父，弟子外公金刀无敌王*元霸是洛阳人我父母双亡，*很想去拜见外公、外婆，禀*告详情。不如到弟子外祖家*盘桓数日。然后咱们再慢慢*游山玩水，到福建舍下去走*走。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3063,19,0);   --  1(1):[岳不群]说: 金刀无敌威震中原，我一直*好生相敬，只是缘悭一面。*福建莆田是南少林所在之地*，自来便多武林高手。咱们*便到洛阳、福建走一遭。令*狐少侠，还肯屈尊跟我们一*起走吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3064,35,0);   --  1(1):[令狐冲]说: 弟子当然跟随师父！小兄弟*，那我就跟师父去了，咱们*就此别过。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3065,0,1);   --  1(1):[AAA]说: 也好，岳掌门，那咱们后会*有期！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_21(35);   --  21(15):[令狐冲]离队
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(40,0,0,0,0,0,766,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [0]
    instruct_3(40,24,0,0,0,0,0,7018,7018,7018,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [24]
    instruct_3(40,26,0,0,0,0,0,7154,7154,7154,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [26]
    instruct_3(40,27,0,0,0,0,0,7158,7158,7158,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [27]
    instruct_3(40,25,1,0,767,0,0,7162,7162,7162,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [25]
    instruct_3(40,23,1,0,767,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [23]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

