--function oldevent_511()
    instruct_1(2132,0,1);   --  1(1):[AAA]说: 一灯大师、黄岛主、洪帮主*、各位道长，晚辈有礼了
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2133,65,0);   --  1(1):[一灯]说: 你来啦。我知道你要找《射*雕英雄传》一书，而此书就*在重阳宫中。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2134,0,1);   --  1(1):[AAA]说: 啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2135,69,0);   --  1(1):[洪七公]说: 既然你已经改邪归正，此书*本当送你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2136,57,0);   --  1(1):[黄药师]说: 不过在赠送之前，我们还要*考教考教你的武功。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2137,65,0);   --  1(1):[一灯]说: 你准备好了吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(0,124) ==true then    --  5(5):是否选择战斗？否则跳转到:Label0
        instruct_1(2140,64,0);   --  1(1):[周伯通]说: 有架打，怎能少的了我！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(186,8,0,1) ==false then    --  6(6):战斗[186]是则跳转到:Label1
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            instruct_1(2138,65,0);   --  1(1):[一灯]说: 看来少侠还需努力一番才是
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2139,65,0);   --  1(1):[一灯]说: 少侠武功高强，佩服佩服。*望少侠今后能走在正途。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(148,1);   --  2(2):得到物品[射鵰英雄传][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_3(-2,0,1,0,499,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(23,0,1,0,487,0,0,6122,6122,6122,-2,-2,-2);   --  3(3):修改事件定义:场景[洪七公居]:场景事件编号 [0]
        do return; end
    end    --:Label0

--end

