--function oldevent_381()
    instruct_25(23,27,25,21);   --  25(19):场景移动23-27--25-21
    instruct_1(1499,41,0);   --  1(1):[张三]说: 既然如此，我们在侠客岛恭*候石帮主大驾。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1500,42,0);   --  1(1):[李四]说: 我们告辞了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
--end

