--function oldevent_913()
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(3704,0,1);   --  1(1):[AAA]说: 参见岳掌门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3705,19,0);   --  1(1):[岳不群]说: 哦，少侠，是你啊，不知今*日来到华山，有何贵干？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3706,0,1);   --  1(1):[AAA]说: 在下听说《笑傲江湖》一书*在岳掌门手中，可有此事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3707,19,0);   --  1(1):[岳不群]说: 不错，此书就在我这。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3708,0,1);   --  1(1):[AAA]说: 那可否将此书让与在下？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3709,19,0);   --  1(1):[岳不群]说: 可以！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3710,0,1);   --  1(1):[AAA]说: 哇，岳先生如此慷慨大度，*真不愧君子剑的美名啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3711,19,0);   --  1(1):[岳不群]说: 少侠过奖。不过今日华山派*正遇到一个难题，还想请少*侠帮忙。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3712,0,1);   --  1(1):[AAA]说: 无功不受禄，既然岳掌门答*应将《笑傲江湖》一书让与*在下，那在下也必会全力帮*主华山派。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3713,19,0);   --  1(1):[岳不群]说: 好。少侠可听说我五岳并派*之事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3714,0,1);   --  1(1):[AAA]说: 听说了一些，好像下个月十*五，要在嵩山开会吧？不知*嵩山派的左冷禅为何要急于*将五岳并派呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3582,19,0);   --  1(1):[岳不群]说: 左冷禅野心极大，*他想要做武林中的第一人．**当初当上五岳剑派盟主，*那只是第一步．第二步是要*将五派归一，由他自任掌门*五派归一之後，实力雄厚，*便可隐然与少林，武当成为*鼎足而三之势．*到时他会进一步蚕食崑仑，*峨嵋，崆峒，青城诸派，*一一将之合并．*然後他向魔教挑战，率领少*林，武当诸派，一举将魔教*挑了，这是第四步．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3715,0,1);   --  1(1):[AAA]说: 那岳先生要在下怎么做，尽*管说吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3716,19,0);   --  1(1):[岳不群]说: 少侠需暂时加入我华山派，*在五岳并派之日，击败左冷*禅，粉碎他的阴谋。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3717,0,1);   --  1(1):[AAA]说: 哈哈哈，我以华山弟子的名*义打败左冷禅，那这五岳剑*派掌门的位置可就落入岳先*生之手啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3718,19,0);   --  1(1):[岳不群]说: 小兄弟果然聪明，我岳不群*就喜欢和聪明人办事，怎么*样，能助我否？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3719,0,1);   --  1(1):[AAA]说: 好，我就帮你这个忙，反正*我只想要天书，谁当五岳派*掌门与我无关。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(-5);   --  37(25):增加道德-5
    instruct_1(3720,19,0);   --  1(1):[岳不群]说: 那就一言为定。只要我当上*五岳掌门，这《笑傲江湖》*一书必定奉上。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,914,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(27,34,0,0,0,0,0,5202,5202,5202,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [34]
    instruct_3(27,33,0,0,0,0,0,5202,5202,5202,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [33]
    instruct_3(27,32,0,0,0,0,0,5202,5202,5202,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [32]
    instruct_3(27,31,0,0,0,0,0,5202,5202,5202,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [31]
    instruct_3(27,30,0,0,0,0,0,5202,5202,5202,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [30]
    instruct_3(27,29,0,0,0,0,0,5202,5202,5202,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [29]
    instruct_3(27,38,0,0,0,0,0,5198,5198,5198,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [38]
    instruct_3(27,37,0,0,0,0,0,5198,5198,5198,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [37]
    instruct_3(27,36,0,0,0,0,0,5198,5198,5198,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [36]
    instruct_3(27,35,0,0,0,0,0,5198,5198,5198,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [35]
    instruct_3(27,42,0,0,0,0,0,5190,5190,5190,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [42]
    instruct_3(27,41,0,0,0,0,0,5190,5190,5190,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [41]
    instruct_3(27,40,0,0,0,0,0,5190,5190,5190,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [40]
    instruct_3(27,39,0,0,0,0,0,5190,5190,5190,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [39]
    instruct_3(27,46,0,0,0,0,0,5172,5172,5172,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [46]
    instruct_3(27,45,0,0,0,0,0,5172,5172,5172,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [45]
    instruct_3(27,44,0,0,0,0,0,5172,5172,5172,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [44]
    instruct_3(27,43,0,0,0,0,0,5172,5172,5172,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [43]
    instruct_3(27,50,0,0,0,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [50]
    instruct_3(27,49,0,0,0,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [49]
    instruct_3(27,48,0,0,0,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [48]
    instruct_3(27,47,0,0,0,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [47]
    instruct_3(27,24,0,0,0,0,0,5232,5232,5232,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [24]
    instruct_3(27,25,0,0,0,0,0,5230,5230,5230,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [25]
    instruct_3(27,26,0,0,0,0,0,5228,5228,5228,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [26]
    instruct_3(27,27,0,0,0,0,0,5226,5226,5226,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [27]
    instruct_3(27,28,0,0,0,0,0,5234,5234,5234,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [28]
    instruct_3(27,62,0,0,0,0,915,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [62]
--end

