--function oldevent_1000()

    if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_6(131,4,0,0) ==false then    --  6(6):战斗[131]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_19(25,20);   --  19(13):主角移动至19-14
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_66(23);   --  66(42):播放音乐23
    instruct_1(3830,57,0);   --  1(1):[黄药师]说: 禀盟主，东门已经攻克
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3831,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，南门已经攻克
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3832,60,0);   --  1(1):[欧阳锋]说: 西门已也攻克了
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3833,5,0);   --  1(1):[张三丰]说: 北门大捷。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3834,0,1);   --  1(1):[AAA]说: 好，众位齐心协力，倭寇不*堪一击。你！还有什么话说*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3835,266,0);   --  1(1):[???]说: 中华，伟大的！*入侵，我们永远地不敢。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3836,255,0);   --  1(1):[???]说: 你终于不辱使命，拯救了中*华武林啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3837,256,0);   --  1(1):[???]说: 也没有枉费我兄弟二人对你*的一番培养。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3838,0,1);   --  1(1):[AAA]说: 对了，你们曾经说过，我来*自龙之国度，这龙之国度到*底在哪里呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3839,256,0);   --  1(1):[???]说: 看到这面镜子了吗？你在镜*子中看到的，就是龙之国度*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3840,255,0);   --  1(1):[???]说: 回去吧，年轻人，回到真正*的龙之国度。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(25,20,25,19);   --  30(1E):主角走动25-20--25-19
    instruct_30(25,19,21,19);   --  30(1E):主角走动25-19--21-19
    instruct_1(3841,0,1);   --  1(1):[AAA]说: 每一位龙的传人，都应该以*国家的富强和民族的兴旺为*己任，巨龙正在苏醒，巨龙*终将腾飞！*我要走了，龙之国度正需要*我！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_62(0,0,0,0,0,0);   --  62(3E):播放进入时空机动画
--end

