--function oldevent_885()

    if instruct_16(35,6,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        instruct_1(2873,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，习武之道在于循*序渐进，施主切忌操之过急*。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3515,70,0);   --  1(1):[玄慈]说: 令狐少侠光临敝寺是否是为*了任小姐的事情？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3516,35,1);   --  1(1):[令狐冲]说: 正是，希望大师高抬贵手，*放盈盈下山吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3517,19,0);   --  1(1):[岳不群]说: 你这畜生，竟然为了魔教教*主之女而前来少林滋事！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,77,0,0,0,0,0,5234,5234,5234,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [77]
    instruct_3(-2,79,0,0,0,0,0,7162,7162,7162,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [79]
    instruct_3(-2,78,0,0,0,0,0,5966,5966,5966,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [78]
    instruct_3(-2,82,0,0,0,0,0,5950,5950,5950,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [82]
    instruct_3(-2,80,0,0,0,0,0,5934,5934,5934,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [80]
    instruct_3(-2,81,0,0,0,0,0,5926,5926,5926,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [81]
    instruct_19(15,28);   --  19(13):主角移动至F-1C
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3518,70,0);   --  1(1):[玄慈]说: 任先生复出，江湖上从此多*事，只怕将有无数人命伤在*任先生手下。老衲有意屈留*任小姐等任先生来救女儿，*老纳也好趁机劝说任先生改*恶向善，屈留他在敝寺盘桓*，诵经礼佛，教江湖上得以*太平。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3519,0,1);   --  1(1):[AAA]说: ＜原来他们早已经聚集了高*手，就等把任我行引来了。*＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3520,22,0);   --  1(1):[左冷禅]说: 玄慈大师，您心地过于善良*，令狐冲是任老怪的乘龙快*婿，既然您已经告诉他真相*了，咱们也不能放他们下山*，免得他们向任老怪通风报*信。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(218,4,0,0) ==false then    --  6(6):战斗[218]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_3(-2,83,0,0,0,0,0,7168,7168,7168,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3521,70,0);   --  1(1):[玄慈]说: 善哉善哉，看来天意如此，*老纳好久不在江湖走动，现*在真是后生可畏呀。你们把*任小姐带下山去，请几位失*主下山后请转告任先生以天*下沧生的性命为重，少开杀*戒。阿弥陀佛。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3522,73,1);   --  1(1):[任盈盈]说: 冲哥，我就知道您能来救我*。方丈大师，您慈悲为怀，*小女子永世不忘。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3523,0,1);   --  1(1):[AAA]说: 请方丈放心，我们定会转告*，告辞。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,77,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [77]
    instruct_3(-2,82,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [82]
    instruct_3(-2,81,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [81]
    instruct_3(-2,80,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [80]
    instruct_3(-2,79,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [79]
    instruct_3(-2,78,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [78]
    instruct_3(-2,83,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
    instruct_3(-2,12,1,0,886,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(93,26,0,0,0,0,887,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[少室山下]:场景事件编号 [26]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

