--function oldevent_325()

    if instruct_4(232,2,0) ==false then    --  4(4):是否使用物品[太白三英的书信]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_37(1);   --  37(25):增加道德1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1189,0,1);   --  1(1):[AAA]说: 袁公子，温姑娘，你们看！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1190,54,0);   --  1(1):[袁承志]说: 好啊，原来是闵子华的哥哥*自己贪财好色，焦公礼杀了*他，也可算是为民除害了。*这太白三英里通外国，挑拨*离间……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1191,91,0);   --  1(1):[???]说: 那我们明天去金龙帮揭发了*他们，有证据在手，看他们*谁敢抵赖。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1192,0,1);   --  1(1):[AAA]说: 好，明日我也去。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(59,15,1,0,327,0,0,8214,8214,8214,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [15]
    instruct_3(59,14,1,0,328,0,0,6086,6086,6086,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [14]
    instruct_3(59,18,0,0,0,0,0,6106,6106,6106,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [18]
    instruct_3(59,17,0,0,0,0,0,5388,5388,5388,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [17]
    instruct_3(59,16,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [16]
    instruct_3(59,21,0,0,0,0,0,5178,5178,5178,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [21]
    instruct_3(59,22,0,0,0,0,0,5178,5178,5178,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [22]
    instruct_3(59,19,0,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [19]
    instruct_3(59,20,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [20]
    instruct_3(59,24,0,0,0,0,0,6092,6092,6092,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [24]
    instruct_3(59,23,0,0,0,0,0,6366,6366,6366,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [23]
    instruct_3(59,25,0,0,0,0,0,6366,6366,6366,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [25]
    instruct_3(59,26,0,0,0,0,0,5186,5186,5186,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [26]
    instruct_3(59,27,0,0,0,0,0,7060,7060,7060,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [27]
    instruct_3(59,28,0,0,0,0,0,7062,7062,7062,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [28]
    instruct_3(59,29,0,0,0,0,326,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [29]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1193,0,1);   --  1(1):[AAA]说: 时候不早了，该去金龙帮看*看了。
    instruct_0();   --  0(0)::空语句(清屏)
--end

