--function oldevent_906()
    instruct_1(3632,19,0);   --  1(1):[岳不群]说: 多谢小兄弟那日鼎力相助，*岳某才得以顺利当上这五岳*派的掌门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3633,245,1);   --  1(1):[???]说: 哼，我是上了你的当，原来*你才是处心积虑的要当这五*岳派的掌门！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3634,19,0);   --  1(1):[岳不群]说: 小兄弟何必这么大火气，现*在我五岳派在武林中声势极*大，我岳某人正要做一番大*事业，小兄弟不如来帮帮我*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3635,0,1);   --  1(1):[AAA]说: 哼，我才不会和你同流合污*呢，你是个彻头彻尾的伪君*子！
    instruct_0();   --  0(0)::空语句(清屏)
--end

