--function oldevent_33()

    if instruct_16(4,2,0) ==false then    --  16(10):队伍是否有[阎基]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0


    if instruct_16(72,2,0) ==false then    --  16(10):队伍是否有[田归农]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_14();   --  14(E):场景变黑
    instruct_37(-3);   --  37(25):增加道德-3
    instruct_3(3,9,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [9]
    instruct_3(3,12,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [12]
    instruct_3(3,11,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [11]
    instruct_3(3,10,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [10]
    instruct_3(-2,1,0,0,0,0,0,7994,7994,7994,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_1(171,72,1);   --  1(1):[田归农]说: 一切按计划行事
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(172,4,1);   --  1(1):[阎基]说: 您就放心吧，嘿嘿
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(41,31,35,31);   --  30(1E):主角走动41-31--35-31
    instruct_1(173,72,1);   --  1(1):[田归农]说: 苗兄，别来无恙？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(50,3,0);   --  1(1):[苗人凤]说: 姓田的，亏你还有脸来见我*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(51,72,1);   --  1(1):[田归农]说: 苗兄，何必这么大的火气，*伤了你我兄弟的和气。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(52,3,0);   --  1(1):[苗人凤]说: ……**她还好吗？……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(174,72,1);   --  1(1):[田归农]说: ＜这个死阎基怎么还不动手*……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(175,4,1);   --  1(1):[阎基]说: 着——！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(176,3,0);   --  1(1):[苗人凤]说: 啊——
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,0,0,0,5212,5212,5212,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(177,72,1);   --  1(1):[田归农]说: 哈哈，我看你是见不到她了*。这药是从毒手药王那弄来*的断肠草粉末，药效也真够*狠，现下你双眼已瞎，我看*"打遍天下无敌手"的金面佛*苗人凤，今日要上西天了，*小兄弟，咱们上！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(178,1,0);   --  1(1):[胡斐]说: 苗大侠莫慌，我来帮你。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(0,4,0,0) ==false then    --  6(6):战斗[0]是则跳转到:Label2
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label2

    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(144,1);   --  2(2):得到物品[飞狐外传][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(117,1);   --  2(2):得到物品[苗家剑法][1]
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_31(10000,0,7) ==true then    --  31(1F):判断银子是否够10000否则跳转到:Label3
        instruct_2(225,1);   --  2(2):得到物品[闯王藏宝图][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_39(5);   --  39(27):打开场景山洞
        do return; end
    end    --:Label3


    if instruct_31(5000,0,8) ==true then    --  31(1F):判断银子是否够5000否则跳转到:Label4
        instruct_2(226,1);   --  2(2):得到物品[闯王藏宝图][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_39(84);   --  39(27):打开场景山洞
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label4

    instruct_2(227,1);   --  2(2):得到物品[闯王藏宝图][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_39(85);   --  39(27):打开场景山洞
--end

