--function oldevent_716()
    instruct_3(-2,-2,1,0,0,0,0,2612,2612,2612,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(171,1);   --  2(2):得到物品[金刚伏魔圈][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(-2);   --  37(25):增加道德-2
    instruct_1(2886,210,0);   --  1(1):[???]说: 大胆狂徒，竟敢在少林寺偷*东西！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(223,4,0,0) ==false then    --  6(6):战斗[223]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

