--function oldevent_249()
    instruct_1(708,165,0);   --  1(1):[???]说: 真儿，他就是我们的恩公张*翠山的儿子，你以后要好好*待他，就像亲弟弟一样。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(709,81,0);   --  1(1):[???]说: 无忌，以后你就是我的亲弟*弟，姐姐疼你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(710,9,0);   --  1(1):[张无忌]说: 姐姐……你待我真好……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(711,165,0);   --  1(1):[???]说: 无忌这孩子真可怜，父母都*死了，唉，在这世上已经没*什么亲人了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(712,9,0);   --  1(1):[张无忌]说: 不，我还有义父，他双目失*明，一个人住在冰火岛，孤*苦伶仃的，咱们去把他接来*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(713,165,0);   --  1(1):[???]说: 也好，咱们这就打点行装，*过两天就动身，把谢法王接*回来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,15,0,0,0,0,250,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,16,0,0,0,0,250,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,-2,1,0,251,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

