--function oldevent_379()
    instruct_14();   --  14(E):场景变黑
    instruct_37(2);   --  37(25):增加道德2
    instruct_26(61,19,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_25(47,36,25,31);   --  25(19):场景移动47-36--25-31
    instruct_1(1471,238,0);   --  1(1):[???]说: 爷爷，四爷爷，你们快宰了*这姓白的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1472,43,0);   --  1(1):[白万剑]说: 哼，你们以二敌一，算什么*好汉。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1473,162,0);   --  1(1):[???]说: 嘿嘿，我丁不三本来就不是*什么好汉。你听好了，我是*和你单打独斗，老四也是和*你单打独斗，我们可不是以*二敌一。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1474,163,0);   --  1(1):[???]说: 我叫他下去，他不肯。他叫*我停手，我也不听他的。我*们俩同时和你单打独斗！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1475,43,0);   --  1(1):[白万剑]说: 岂有此理！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1476,38,0);   --  1(1):[石破天]说: 你们别打了，白师父是好人*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1477,245,1);   --  1(1):[???]说: 住手！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(47,36,26,36);   --  30(1E):主角走动47-36--26-36
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1478,245,1);   --  1(1):[???]说: 你们两个真是为老不尊，明*明两人欺负一个，还恬不知*耻！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1479,162,0);   --  1(1):[???]说: 老四，我耳朵没毛病吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1480,163,0);   --  1(1):[???]说: 气死我了！气死我了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1481,245,1);   --  1(1):[???]说: 不就是二打一么，冲着我来*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1482,162,0);   --  1(1):[???]说: 嘿嘿，老四，这小子吹牛的*本事比你还强。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1483,163,0);   --  1(1):[???]说: 气死我了！气死我了！小子*，拿命来！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(168,4,0,0) ==false then    --  6(6):战斗[168]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1484,163,0);   --  1(1):[???]说: ……你……我今天没吃饱，*你等着……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1485,162,0);   --  1(1):[???]说: 丁当，我们走。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1486,238,0);   --  1(1):[???]说: 你——哼！*天哥……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_19(25,31);   --  19(13):主角移动至19-1F
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1494,43,0);   --  1(1):[白万剑]说: 多谢少侠救命之恩。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1495,0,1);   --  1(1):[AAA]说: 白大侠不必这么客气。在下*还有一事相求。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1496,43,0);   --  1(1):[白万剑]说: 少侠请讲
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1497,0,1);   --  1(1):[AAA]说: 这个石……石帮主是我朋友*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1498,43,0);   --  1(1):[白万剑]说: 既是少侠开口，今日暂且放*过这小贼，改日再落到我手*里，哼！告辞！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_19(25,28);   --  19(13):主角移动至19-1C
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1487,38,0);   --  1(1):[石破天]说: 大哥哥，谢谢你了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1488,0,1);   --  1(1):[AAA]说: 你和雪山派到底有什么仇啊*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1489,38,0);   --  1(1):[石破天]说: 我也不知道，他们说我是雪*山派的叛徒，可是我自己也*不知道是怎么回事。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,0,1);   --  1(1):[AAA]说: …………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1490,38,0);   --  1(1):[石破天]说: 那个白师父是好人，他可能*是认错人了。我要回长乐帮*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1491,0,1);   --  1(1):[AAA]说: 你知道自己是长乐帮帮主？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1492,38,0);   --  1(1):[石破天]说: 我也不知道，好多事情我都*不知道，是他们告诉我的。*贝先生是好人，他还给我治*病呢。他说让我去帮他们接*个什么铜牌子，不然他们都*会死的。所以我必须要回去*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1493,0,1);   --  1(1):[AAA]说: 唉，你还真是好人啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(94,15,0,0,0,0,381,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[长乐帮]:场景事件编号 [15]
    instruct_3(94,16,1,0,382,0,0,5152,5152,5152,-2,-2,-2);   --  3(3):修改事件定义:场景[长乐帮]:场景事件编号 [16]
    instruct_3(94,17,0,0,0,0,0,5144,5144,5144,-2,-2,-2);   --  3(3):修改事件定义:场景[长乐帮]:场景事件编号 [17]
    instruct_3(94,18,0,0,0,0,0,5150,5150,5150,-2,-2,-2);   --  3(3):修改事件定义:场景[长乐帮]:场景事件编号 [18]
    instruct_3(94,2,1,0,383,0,0,7070,7070,7070,-2,-2,-2);   --  3(3):修改事件定义:场景[长乐帮]:场景事件编号 [2]
    instruct_3(94,9,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[长乐帮]:场景事件编号 [9]
    instruct_3(39,9,1,0,386,0,0,5274,5274,5274,-2,-2,-2);   --  3(3):修改事件定义:场景[凌霄城]:场景事件编号 [9]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

