--function oldevent_240()
    instruct_37(2);   --  37(25):增加道德2
    instruct_26(60,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,7,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(630,0,1);   --  1(1):[AAA]说: 你就是臭名昭着的张召重吗*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(631,80,0);   --  1(1):[???]说: 你是何人？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(632,0,1);   --  1(1):[AAA]说: 我是红花会的朋友，想和你*商量点事。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(633,80,0);   --  1(1):[???]说: 哼，想救文泰来？陈家洛呢*？无尘呢？他们有本事就来*啊。怎么让你这么个小毛孩*子来送死！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(634,0,1);   --  1(1):[AAA]说: 救不救文泰来，那是红花会*的事。我今天来，是因为听*说张大人的柔云剑术出神入*化，想来领教一二。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(635,80,0);   --  1(1):[???]说: 飞蛾扑火，不自量力！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(636,0,1);   --  1(1):[AAA]说: 张大人可别太自信喽。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(637,80,0);   --  1(1):[???]说: 那你就划下道来吧。是单挑*，还是群殴？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(638,0,1);   --  1(1):[AAA]说: 单挑，你一个挑我们一帮；*群殴，我们一帮殴你一个。*公平吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(639,80,0);   --  1(1):[???]说: 哈哈哈，原来你是来消遣老*夫的。左右，给我拿下。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(142,4,0,0) ==false then    --  6(6):战斗[142]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(640,208,0);   --  1(1):[???]说: 张大人，不好了，那要犯被*人救走了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(641,80,0);   --  1(1):[???]说: 什么？好啊，原来你是在跟*我使稳君计！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(642,0,1);   --  1(1):[AAA]说: 你才知道啊，晚喽。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,13,0,0,0,0,0,8240,8240,8240,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,2,0,0,0,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,26,0,0,0,0,0,5970,5970,5970,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,24,0,0,0,0,0,6784,6784,6784,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,7006,7006,7006,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(643,154,0);   --  1(1):[???]说: 四哥，你终于……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(644,151,0);   --  1(1):[???]说: 放心，四哥没事。多谢少当*家、众家兄弟，还有这位少*侠。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(645,0,1);   --  1(1):[AAA]说: 文四爷客气了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(646,151,0);   --  1(1):[???]说: 姓张的，咱们的帐是不是该*算算了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(647,80,0);   --  1(1):[???]说: 哼，你们人多势众，又连使*诡计，我今天认栽了。这笔*帐我迟早会讨回来的。我和*别人还有约，恕不奉陪了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(648,0,1);   --  1(1):[AAA]说: 狗贼别跑。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(649,75,0);   --  1(1):[???]说: 少侠不必追赶。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(650,0,1);   --  1(1):[AAA]说: 难道就这么放过他？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(651,75,0);   --  1(1):[???]说: 我们已经打探清楚，他和威*震河朔王维扬有比武之约，*现在他一定是去恒山山麓了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(652,0,1);   --  1(1):[AAA]说: 既然如此，我们就马上赶去*恒山吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(653,75,0);   --  1(1):[???]说: 文四哥伤势未愈，红花会还*有些事情要安排。少侠请先*走一步，我们随后就到。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(654,0,1);   --  1(1):[AAA]说: 也好，咱们就恒山见。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(655,154,0);   --  1(1):[???]说: 感谢少侠救我夫君。这是我*家传的鸳鸯刀法，就赠与少*侠吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(162,1);   --  2(2):得到物品[鸳鸯刀法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(38,1,0,0,0,0,242,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[恒山山麓]:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

