--function oldevent_49()
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_2(146,1);   --  2(2):得到物品[连城诀][1]
    instruct_3(3,5,1,0,645,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [5]
    instruct_3(3,6,1,0,645,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [6]
    instruct_3(3,8,1,0,645,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [8]
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(37,2,0) ==false then    --  16(10):队伍是否有[狄云]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_28(0,80,100,2,0) ==false then    --  28(1C):判断AAA品德80-100是则跳转到:Label1
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_37(1);   --  37(25):增加道德1
    instruct_1(233,37,0);   --  1(1):[狄云]说: 连城诀终于找到了，丁大哥*也可以安息了。这是丁大哥*的遗物，就送给你吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(71,1);   --  2(2):得到物品[神照经][1]
    instruct_0();   --  0(0)::空语句(清屏)
--end

