--function oldevent_887()
    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,27,0,0,0,0,0,6078,6078,6078,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,28,0,0,0,0,0,7216,7216,7216,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,29,0,0,0,0,0,7002,7002,7002,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,30,0,0,0,0,0,7146,7146,7146,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_19(26,23);   --  19(13):主角移动至1A-17
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3526,26,0);   --  1(1):[任我行]说: 盈盈，他们把你救出来了？*好。冲儿，你和盈盈的事情*我都知道了，也是机缘巧合*，你也学会了老夫的吸星大*法，所以你的内伤也好了起*来。今天老夫要回黑木崖找*东方不败算账去，你可愿意*助老夫一臂之力？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3527,73,0);   --  1(1):[任盈盈]说: 冲哥，当初东方不败使奸计*害得我爹爹铁牢内呆了十几*年，不见天日，要是没有你*们现在我们父女还不能相见*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3528,35,0);   --  1(1):[令狐冲]说: 好！前辈不提我也要协助前*辈去黑木崖会会东方不败。*小兄弟，此次风险太大，甚*至有生命危险，咱们就此别*过，如果这次我们能顺利得*胜，我再去找你，咱们在一*起闯荡江湖。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3529,0,1);   --  1(1):[AAA]说: 令狐大哥怎么能这么说话？*我不是贪生怕死之徒，如任*前辈不弃，咱们一起去，我*愿助你们一臂之力。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3530,26,0);   --  1(1):[任我行]说: 哈哈哈哈哈！直爽，你这个*朋友我任我行交定了，咱们*也不用客气，我和向左使现*在就去黑木崖摸摸情况，你*们三个娃娃尽快赶来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3531,35,0);   --  1(1):[令狐冲]说: 小兄弟，感谢你帮我救出盈*盈，这是风老前辈传给我的*剑法，你也学学吧。我和盈*盈先回小村，等小兄弟你准*备好了，我们再一同前往黑*木崖。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(114,1);   --  2(2):得到物品[独孤九剑][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(104,73,1,0,974,0,0,7002,7002,7002,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [73]
    instruct_3(104,65,1,0,954,0,0,7146,7146,7146,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [65]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(70,15,1,0,121,0,0,5722,5748,5722,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [15]
    instruct_3(70,35,1,0,161,0,0,7002,7002,7002,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [35]
    instruct_21(35);   --  21(15):[令狐冲]离队
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

