--function oldevent_770()
    instruct_1(3116,0,1);   --  1(1):[AAA]说: 令狐兄在此学琴，望能早日*康复。我继续去寻找我要的*东西。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3117,35,0);   --  1(1):[令狐冲]说: 小兄弟请便。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,55,0,0,0,0,775,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,56,0,0,0,0,775,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
    instruct_3(-2,57,0,0,0,0,775,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
--end

