--function oldevent_385()
    instruct_26(61,19,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_25(28,24,28,17);   --  25(19):场景移动28-24--28-17
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1508,41,0);   --  1(1):[张三]说: 侠客岛赏善罚恶使者，*前来拜见雪山派掌门！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1509,43,0);   --  1(1):[白万剑]说: 尊驾二位便是侠客岛的赏善*罚恶使者吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1510,42,0);   --  1(1):[李四]说: 正是。*不知那位是雪山派掌门人？**我们奉侠客岛岛主之命，手*持铜牌前来，邀请贵派掌门*赴敝岛相叙，喝碗腊八粥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(28,17,28,24);   --  25(19):场景移动28-17--28-24
    instruct_1(1511,0,1);   --  1(1):[AAA]说: ＜凭我过人的直觉，这侠客*岛上一定有天书的线索，  *不是有本书与"侠"字有  关*联吗？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(28,24,28,19);   --  30(1E):主角走动28-24--28-19
    instruct_1(1512,0,1);   --  1(1):[AAA]说: 二位使者，我可以去侠客岛*么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1513,42,0);   --  1(1):[李四]说: 恐怕不行，侠客岛所邀请的*是各门派的掌门及对武学有*特殊见解的武林高手。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1514,0,1);   --  1(1):[AAA]说: 白大侠，你的掌门之位可不*可以让给我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1515,43,0);   --  1(1):[白万剑]说: 这位少侠，白某再次谢过你*的救命之恩。不过白某乃是*雪山派掌门，断无让与旁人*之理。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1516,0,1);   --  1(1):[AAA]说: 这样吧，咱俩比试一场，看*看谁更有资格去。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(59,3,0,0) ==false then    --  6(6):战斗[59]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1517,0,1);   --  1(1):[AAA]说: 前辈 ，承让了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1518,43,0);   --  1(1):[白万剑]说: 少侠武功高强，白某佩服，*看来我是无脸去喝这腊八粥*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1519,41,0);   --  1(1):[张三]说: 好！*这位兄弟，十二月初八，*请到侠客岛喝碗腊八粥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,5,1,0,389,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,9,1,0,387,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,1,0,389,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,1,0,389,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,1,0,389,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(94,16,1,0,392,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[长乐帮]:场景事件编号 [16]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(198,1);   --  2(2):得到物品[赏善罚恶令][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(1);   --  37(25):增加道德1
--end

