--function oldevent_90()
    instruct_1(373,247,1);   --  1(1):[???]说: 小宝兄，你真强啊。这两个*美眉终于被你搞定啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(374,225,0);   --  1(1):[???]说: 那是，我自有妙计，哈哈*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(375,247,1);   --  1(1):[???]说: 能不能传授兄弟几手？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(376,225,0);   --  1(1):[???]说: 这可不行，泡妞乃我看家本*领，从不外传。不过兄弟要*是需要帮忙……
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,126) ==true then    --  9(9):是否要求加入?否则跳转到:Label0
        instruct_1(377,247,1);   --  1(1):[???]说: 好啊，求之不得啊
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(378,225,0);   --  1(1):[???]说: 没有兄弟的帮忙，我也搞不*到这两个如花似玉的美娇娘*，哈哈，老婆们，咱也帮帮*少侠的忙，跟我去小村！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(104,63,1,0,987,0,0,7050,7050,7050,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [63]
        instruct_3(104,55,1,0,988,0,0,7036,7036,7036,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [55]
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
        instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_3(70,48,1,0,869,870,0,8256,8256,8256,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [48]
        instruct_3(70,49,1,0,187,0,0,7030,7030,7030,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [49]
        instruct_3(70,50,1,0,189,0,0,7036,7036,7036,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [50]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label0

    instruct_1(379,0,1);   --  1(1):[AAA]说: 不必了，韦兄还是在此尽享*艳福吧。
    instruct_0();   --  0(0)::空语句(清屏)
--end

