--function oldevent_583()

    if instruct_28(0,75,999,6,0) ==false then    --  28(1C):判断AAA品德75-999是则跳转到:Label0
        instruct_1(2527,250,0);   --  1(1):[???]说: 阿弥陀佛，施主当慈悲为怀*。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2528,250,0);   --  1(1):[???]说: 施主能够扶危济困，善哉善*哉。这本刀谱就赠与施主，*望施主用于正途。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2529,0,1);   --  1(1):[AAA]说: 多谢大师。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(160,1);   --  2(2):得到物品[慈悲刀法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,584,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

