--function oldevent_416()

    if instruct_16(38,2,0) ==false then    --  16(10):队伍是否有[石破天]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_26(61,19,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(1561,38,1);   --  1(1):[石破天]说: 大哥，这没有什麽好看的，*我们走了好不好．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1562,0,1);   --  1(1):[AAA]说: 贤弟，小声一点，别吵到两*位岛主练功．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1563,38,1);   --  1(1):[石破天]说: ＜这些字怎麽如此古怪，看*上一眼，便会头晕？＞**＜至阳穴好热，原来这些蝌*蚪看似乱钻乱游，其实还是*和内息有关＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1564,39,0);   --  1(1):[龙岛主]说: 这位石兄弟双眼注目这”太*玄经”，原来是位精通蝌蚪*文的大方家．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1565,38,1);   --  1(1):[石破天]说: 小人一个字也不识，只是瞧*这些小蝌蚪十分好玩，便多*看了一会．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1566,40,0);   --  1(1):[木岛主]说: 这就是了，这部”太玄经”*以古蝌蚪文写成，我本来正*自奇怪，石兄弟年纪轻轻，*居然有此奇才，识得这种古*奥文字．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1567,38,1);   --  1(1):[石破天]说: ＜我还是别打扰二位岛主好*了．．．可是这蝌蚪还真好*玩．．．＞*＜咦！这些蝌蚪怎麽在我身*体各处跑了起来．．．．．*怎麽这样地舒畅．．．．＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1568,0,1);   --  1(1):[AAA]说: 贤弟，你干什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1569,38,1);   --  1(1):[石破天]说:  啊！好累．*我怎麽觉得好累．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1570,0,1);   --  1(1):[AAA]说: 贤弟，你总算清醒过来了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1571,38,1);   --  1(1):[石破天]说: 怎麽，*难道我昏迷过去了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1572,0,1);   --  1(1):[AAA]说: 是啊！原先我以为你又着魔*了，後来龙岛主说你正悟出*神功，我才没有去吵你，前*後算起来已有三天了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1573,38,1);   --  1(1):[石破天]说: 是吗？已经三天了，*难怪我觉得好饿．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1574,39,0);   --  1(1):[龙岛主]说: 石兄弟，我兄弟俩闷在心中*数十年的大疑团，终於得以*解开，真是太感激你了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1575,38,1);   --  1(1):[石破天]说: 我怎麽．．怎麽解破的?
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1576,39,0);   --  1(1):[龙岛主]说: 石兄弟何必如此谦虚？你参*透了这首”侠客行”的石壁*图谱，不但是现今武林中的*第一人，除了当年在石壁上*雕写图谱的那位前辈之外，*只怕古往今来，也极少有人*及得上你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1577,38,1);   --  1(1):[石破天]说: 小人不敢，小人不敢．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1578,39,0);   --  1(1):[龙岛主]说: 这石壁上的蝌蚪古文，在下*与木兄弟所识还不到一成，*不知石兄弟肯赐予指教麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1579,38,1);   --  1(1):[石破天]说: 我跟两位说了便是，我看这*条蝌蚪，”中注穴”中便有*跳动;*再看这条蝌蚪，”太赫穴”*便大跳一下．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1580,40,0);   --  1(1):[木岛主]说: 原来．．原来．．石帮主看*的是一条条．．那个蝌蚪，*不是看一个个字．．．*那麽石帮主如何能通解全篇*”太玄经”？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1581,38,1);   --  1(1):[石破天]说: 小人自幼没读过书，当真一*字不识，惭愧的紧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1582,40,0);   --  1(1):[木岛主]说: 你不识字？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1583,38,1);   --  1(1):[石破天]说: 不识字．我．．回去之後，*定要去学识字，否则人人都*识字，我却不识得，给人笑*话，多不好意思．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1584,39,0);   --  1(1):[龙岛主]说: 你既不识字，那麽这些壁上*许许多多的注释，却是谁解*给你听的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1585,38,1);   --  1(1):[石破天]说: 没人解给我听．*我．．．只是瞧着图形，胡*思乱想，忽然之间，图上的*云头或小剑什麽的，就和身*体内的热气连在一起了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1586,40,0);   --  1(1):[木岛主]说: 你不识字，却能解通图谱，*这．．．如何能够？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1587,39,0);   --  1(1):[龙岛主]说: 难道冥冥之中真有天意？*还是这位石兄弟真有天纵英*才．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1588,40,0);   --  1(1):[木岛主]说: ．．．．．*我懂了，我懂了．*大哥，原来如此．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1589,39,0);   --  1(1):[龙岛主]说: 啊！是了．是了．*石兄弟，幸亏你不识字，才*得解破这个大疑团．*唉！原来这许许多多注释文*字，每一句都在导人误入歧*途．可是参研图谱之人，又*有那个肯不去钻研注解．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1590,39,0);   --  1(1):[龙岛主]说: 原来这篇”太玄经”也不是*真的蝌蚪文，只不过．．．*只不过是一些经脉穴道的线*路方位而已．***唉，三十年的光阴，三十年*的光阴！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1591,40,0);   --  1(1):[木岛主]说: 白首太玄经！*兄弟，你的头发也真是雪白*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1592,39,0);   --  1(1):[龙岛主]说: 此岛名为侠客岛，是因为我*们兄弟二人在此间还发现了*另一部奇书，叫《侠客行》*。我二人发下誓愿，谁能解*得了这壁上图谱，便奖此书*曾与谁。如今图谱已解，这*本书就赠与石帮主吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1593,38,0);   --  1(1):[石破天]说: 我不识字，这本书要来也没*有用。这位大哥好像正在找*这本书吧，那我就把这本书*送给大哥好了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1594,247,1);   --  1(1):[???]说: 多谢石兄弟，多谢二位岛主*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1595,39,0);   --  1(1):[龙岛主]说: 兄弟，你我心愿已了，我们*也该歇息了．这腊八粥之约*以後也不必了．*我们这就去告诉各位掌门不*用再钻研此图解了．**公子，你们也可赶紧离去。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1596,0,1);   --  1(1):[AAA]说: 前辈，告辞了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(154,1);   --  2(2):得到物品[侠客行][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(80,1);   --  2(2):得到物品[太玄经][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,16,0,0,0,0,419,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,0,0,0,0,419,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,0,0,0,0,419,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,3,1,0,418,0,0,5136,5136,5136,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,2,1,0,417,0,0,5132,5132,5132,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    -- instruct_33(38,102,1);   --  33(21):石破天学会武功太玄神功
    instruct_46(38,1000);   --  46(2E):石破天增加内力1000
    instruct_47(38,50);   --  47(2F):石破天增加攻击力50
--end

