--function oldevent_925()

    if instruct_4(195,2,0) ==false then    --  4(4):是否使用物品[铁铲]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3740,0,1);   --  1(1):[AAA]说: 根据攻略显示，蔡邕之墓里*可以挖到广陵散，我挖！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(-1,6704,6714);   --  27(1B):显示动画
    instruct_27(-1,6704,6714);   --  27(1B):显示动画
    instruct_27(-1,6716,6742);   --  27(1B):显示动画
    instruct_27(-1,6716,6742);   --  27(1B):显示动画
    instruct_27(-1,6716,6742);   --  27(1B):显示动画
    instruct_27(-1,6716,6742);   --  27(1B):显示动画
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,1,0,0,0,0,6698,6698,6698,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(212,1);   --  2(2):得到物品[广陵散琴曲][1]
    instruct_0();   --  0(0)::空语句(清屏)
--end

