--function oldevent_448()
    instruct_3(-2,-2,1,0,0,0,0,7092,7092,7092,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_17(-2,0,41,25,990);   --  17(11):修改场景贴图:当前场景层0坐标29-19
    instruct_17(-2,0,42,25,990);   --  17(11):修改场景贴图:当前场景层0坐标2A-19
    instruct_17(-2,0,43,25,990);   --  17(11):修改场景贴图:当前场景层0坐标2B-19
    instruct_17(-2,0,44,25,990);   --  17(11):修改场景贴图:当前场景层0坐标2C-19
    instruct_17(-2,0,45,25,990);   --  17(11):修改场景贴图:当前场景层0坐标2D-19
    instruct_17(-2,0,46,25,990);   --  17(11):修改场景贴图:当前场景层0坐标2E-19
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

