--function oldevent_284()
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_25(28,24,31,19);   --  25(19):场景移动28-24--31-19
    instruct_37(2);   --  37(25):增加道德2
    instruct_1(951,0,1);   --  1(1):[AAA]说: 好啊！成崑，*原来你躲在这里，**怎麽，几个坏蛋聚在这里，*是不是又在一起商量什麽*坏勾当？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(952,18,0);   --  1(1):[成崑]说: 哼！*上次的事全被你坏了，*我这次饶不了你。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(13,3,0,0) ==false then    --  6(6):战斗[13]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(953,0,1);   --  1(1):[AAA]说: 今天真是大快人心，*替武林除了一个大害。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(219,1);   --  2(2):得到物品[一颗头颅][1]
    instruct_0();   --  0(0)::空语句(清屏)
--end

