--function oldevent_545()

    if instruct_4(196,1,0) ==false then    --  4(4):是否使用物品[大燕传国玉玺]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(196,-1);   --  32(20):物品[大燕传国玉玺]+[-1]
    instruct_1(2300,0,1);   --  1(1):[AAA]说: 慕容公子，你要找的大燕国*传国玉玺在这里。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2301,51,0);   --  1(1):[慕容复]说: 真的找到了！有了它，我大*燕复国有望。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2303,0,1);   --  1(1):[AAA]说: 那慕容公子可否履行诺言，*告知在下《天龙八部》一书*的下落。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2304,51,0);   --  1(1):[慕容复]说: 等会，有了传国玉玺并不能*证明我慕容复的身份，那麽*别人就不会听我号召……大*燕皇帝世系谱表呢？大燕皇*帝世系谱表呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2305,0,1);   --  1(1):[AAA]说: 慕容公子并未叫我找那什麽*大燕皇帝世系谱表啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2306,51,0);   --  1(1):[慕容复]说: 没有大燕皇帝世系谱表，别*人怎会相信我慕容复是王孙*的後代。你快去找大燕皇帝*世系谱表，找到了我才跟你*说《天龙八部》的下落。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2307,76,0);   --  1(1):[???]说: 表哥，做人怎可言而无信，*你说好要告诉这位公子的，*怎可反悔。你不说，我可要*告诉他了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2308,51,0);   --  1(1):[慕容复]说: 你敢！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,76,0);   --  1(1):[???]说: …………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2309,0,1);   --  1(1):[AAA]说: 好，我就再信你一次，去帮*你找那什麽世系谱表。希望*到时慕容公子别再失信。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2310,51,0);   --  1(1):[慕容复]说: 记得，若你想知道《天龙八*部》的下落，就快去找大燕*皇帝世系谱表。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,546,547,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

