--function oldevent_782()

    if instruct_16(35,2,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,5,1,0,0,0,0,7170,7170,7170,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3151,0,1);   --  1(1):[AAA]说: 令狐大哥，你怎么了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,35,0);   --  1(1):[令狐冲]说: …………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,6,0,0,0,0,0,7002,7002,7002,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3152,73,0);   --  1(1):[任盈盈]说: 冲哥，冲哥，你怎么了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3153,0,1);   --  1(1):[AAA]说: ＜不是吧，冲哥？他俩那些*天不光是在学琴吧……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3154,73,0);   --  1(1):[任盈盈]说: 少侠，冲哥他怎么会这样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3155,0,1);   --  1(1):[AAA]说: 我也不知道啊，我们按你说*的去找平一指，可是平大夫*也治不了，他说只有少林易*筋经或许可以化解令狐大哥*体内的真气。于是我们就到*少室山来了，刚走到这里，*令狐大哥支持不住，晕倒了*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3156,73,0);   --  1(1):[任盈盈]说: 多谢少侠这些日子对冲哥的*照顾，我来送他上少林吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3157,0,1);   --  1(1):[AAA]说: 可是你一个女子，上少林寺*恐怕不方便吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3158,73,0);   --  1(1):[任盈盈]说: 少侠放心，我自有办法。为*了冲哥，我豁出去了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_21(35);   --  21(15):[令狐冲]离队
    instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,4,0,0,0,0,784,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3159,0,1);   --  1(1):[AAA]说: 我还是继续找我的天书吧，*以后有空再到少林看望他们*。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_60(37,10,2286,15,0) ==false then    --  60(3C):判断场景37事件位置10是否有贴图2286是则跳转到:Label1
        instruct_3(37,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[五毒教]:场景事件编号 [5]
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

--end

