--function oldevent_301()

    if instruct_60(-2,38,2286,0,46) ==true then    --  60(3C):判断场景-2事件位置38是否有贴图2286否则跳转到:Label0

        if instruct_16(49,0,42) ==true then    --  16(10):队伍是否有[虚竹]否则跳转到:Label1
            instruct_3(-2,38,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
            instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
            instruct_14();   --  14(E):场景变黑
            instruct_13();   --  13(D):重新显示场景
            instruct_1(2599,49,0);   --  1(1):[虚竹]说: 谢谢施主送我回少林，我这*就去了。佛祖曾经对我说，*如果有人送我回少林，那这*个人就是个好人，因为他放*弃了小无相功、天山六阳掌*、天山折梅手、八荒六合功*等武功，因此佛祖要给这个*人加上十点道德。施主，你*真是个好人，再会。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_21(49);   --  21(15):[虚竹]离队
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_37(10);   --  37(25):增加道德10
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label1

    end    --:Label0


    if instruct_60(-2,36,2286,0,935) ==true then    --  60(3C):判断场景-2事件位置36是否有贴图2286否则跳转到:Label2
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,36,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
        instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
        instruct_3(-2,0,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,34,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,35,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,1,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,33,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,6,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,3,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_30(53,19,50,19);   --  30(1E):主角走动53-19--50-19
        instruct_30(50,19,50,40);   --  30(1E):主角走动50-19--50-40
        instruct_30(50,40,46,40);   --  30(1E):主角走动50-40--46-40
        instruct_1(1024,0,1);   --  1(1):[AAA]说: 咦？今天少林寺怎么这么大*阵势？难道是专门迎接我的*吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1025,70,0);   --  1(1):[玄慈]说: 施主远道而来，不知有何见*教？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1026,0,1);   --  1(1):[AAA]说: 我……随便看看……*＜嘿嘿*，老和尚想不到吧，我是来*替明教报仇的，想把少林寺*夷为平地……＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1027,70,0);   --  1(1):[玄慈]说: 据老衲所知，施主此来是要*为明教报仇，想把少林寺夷*为平地。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1028,0,1);   --  1(1):[AAA]说: 你——！*＜谢法王和范右使怎么还没*到，要坏……＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1029,70,0);   --  1(1):[玄慈]说: 明教已然覆灭，阁下何必再*添杀戮。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1030,0,1);   --  1(1):[AAA]说: 谁说明教覆灭了，金毛狮王*谢逊和光明右使范遥还都在*呢。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1031,70,0);   --  1(1):[玄慈]说: 他二人已然皈依我佛。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1032,245,1);   --  1(1):[???]说: 什么？不可能！老和尚，我*要见他二人！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(80,1,0,1) ==false then    --  6(6):战斗[80]是则跳转到:Label3
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label3

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1033,70,0);   --  1(1):[玄慈]说: 少林寺乃佛门圣地，施主不*要再打了，阿弥陀佛，我这*就带施主去见他二人
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,35,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,41,0,0,0,0,0,8232,8232,8232,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
        instruct_3(-2,40,0,0,0,0,0,8232,8232,8232,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
        instruct_3(-2,45,0,0,0,0,0,8232,8232,8232,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
        instruct_3(-2,44,0,0,0,0,0,6388,6388,6388,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
        instruct_3(-2,46,0,0,0,0,0,5334,5334,5334,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
        instruct_3(-2,43,0,0,0,0,0,5294,5294,5294,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
        instruct_3(-2,34,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,33,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_19(33,50);   --  19(13):主角移动至21-32
        instruct_25(33,50,33,50);   --  25(19):场景移动33-50--33-50
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1034,13,0);   --  1(1):[谢逊]说: 无我相、无人相、无众生相*、无寿者相……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1035,0,1);   --  1(1):[AAA]说: 谢法王，真的是你？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1036,13,0);   --  1(1):[谢逊]说: 弟子罪孽深重，盼方丈收留*，赐予剃度。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1037,0,1);   --  1(1):[AAA]说: 啊？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1038,114,0);   --  1(1):[???]说: 老僧收你为徒。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1039,13,0);   --  1(1):[谢逊]说: 弟子不敢望此福缘。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1040,114,0);   --  1(1):[???]说: 空固是空，圆亦是空，我相*人相，好不懵懂！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1041,13,0);   --  1(1):[谢逊]说: 师父是空，弟子是空，无罪*无业，无德无功！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1042,114,0);   --  1(1):[???]说: 善哉，善哉！你归我门下，*仍是叫作谢逊，你懂了么？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1043,13,0);   --  1(1):[谢逊]说: 弟子懂得。牛屎谢逊，皆是*虚影，身既无物，何况于名*？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1044,0,1);   --  1(1):[AAA]说: ＜糟糕糟糕，看来成昆老贼*的计划要泡汤，我得赶紧另*想出路……＞**谢法王，这，那，我要的*《倚天屠龙记》一书怎么办*啊？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1045,10,0);   --  1(1):[范遥]说: 小兄弟，我们俩受少林高僧*点化，已知我明教真正的仇*人其实是成昆，只要你帮我*们除掉成昆，这本倚天屠龙*记就送给你。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1046,13,0);   --  1(1):[谢逊]说: 师父恕罪，弟子也有此念。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1047,70,0);   --  1(1):[玄慈]说: 杀恶人即使善念，那成昆为*祸武林……阿弥陀佛……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1048,0,1);   --  1(1):[AAA]说: 好，一言为定，我这就去找*成昆。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1049,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，善哉善哉。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1049,169,0);   --  1(1):[???]说: 阿弥陀佛，善哉善哉。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1049,170,0);   --  1(1):[???]说: 阿弥陀佛，善哉善哉。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
        instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
        instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
        instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
        instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
        instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
        instruct_3(-2,12,-2,0,-2,303,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_3(9,0,0,0,0,0,302,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [0]
        instruct_3(9,1,0,0,0,0,0,5296,5296,5296,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [1]
        instruct_3(9,2,0,0,0,0,0,6092,6092,6092,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [2]
        instruct_3(9,3,0,0,0,0,0,6788,6788,6788,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [3]
        instruct_3(9,4,0,0,0,0,0,5892,5892,5892,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [4]
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2


    if instruct_60(-2,37,2286,0,1815) ==true then    --  60(3C):判断场景-2事件位置37是否有贴图2286否则跳转到:Label4
        instruct_37(3);   --  37(25):增加道德3
        instruct_26(40,13,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(40,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(40,15,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(40,14,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,37,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
        instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
        instruct_3(-2,0,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,34,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,35,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,1,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,33,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,6,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,3,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(-2,48,0,0,0,0,0,6380,6380,6380,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
        instruct_3(-2,58,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
        instruct_3(-2,57,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
        instruct_3(-2,56,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
        instruct_3(-2,55,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
        instruct_3(-2,54,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
        instruct_3(-2,53,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
        instruct_3(-2,52,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
        instruct_3(-2,51,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
        instruct_3(-2,50,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
        instruct_3(-2,49,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
        instruct_3(-2,59,0,0,0,0,0,6304,6304,6304,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        instruct_3(-2,61,1,0,572,0,0,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
        instruct_3(-2,60,1,0,572,0,0,7136,7136,7136,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
        instruct_3(-2,62,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
        instruct_3(-2,63,0,0,0,0,0,5330,5330,5330,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
        instruct_3(-2,64,0,0,0,0,0,8212,8212,8212,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
        instruct_3(-2,65,0,0,0,0,0,7128,7128,7128,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
        instruct_3(-2,66,0,0,0,0,0,7126,7126,7126,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
        instruct_3(-2,70,0,0,0,0,0,8216,8216,8216,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_30(53,19,52,19);   --  30(1E):主角走动53-19--52-19
        instruct_30(52,19,52,37);   --  30(1E):主角走动52-19--52-37
        instruct_40(2);   --  40(28):改变主角站立方向2
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_25(52,37,43,37);   --  25(19):场景移动52-37--43-37
        instruct_25(43,37,43,44);   --  25(19):场景移动43-37--43-44
        instruct_25(43,44,52,44);   --  25(19):场景移动43-44--52-44
        instruct_25(52,44,52,37);   --  25(19):场景移动52-44--52-37
        instruct_25(52,37,48,36);   --  25(19):场景移动52-37--48-36
        instruct_1(2419,48,0);   --  1(1):[游坦之]说: 少林寺玄慈方丈，少林派是*武林中各门派之首，丐帮是*江湖第一大帮，向来并峙中*原，不相统属。今日咱们却*要分个高下，胜者为武林盟*主，败者服从武林盟主号令*，不得有违。天下各位英雄*好汉，今日都聚集在此，有*哪一位不服，尽可向武林盟*主挑战。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2420,70,0);   --  1(1):[玄慈]说: 阿弥陀佛。丐帮数百年来，*乃中原武林的侠义正道，天*下英雄，无不瞻仰。庄帮主*新任帮主，敝派得讯迟了，*未及遣使道贺，不免有简慢*之罪，谨此谢过。却不知庄*帮主今日何以忽兴问罪之师*，还盼见告。天下英雄，俱*在此间，是非曲直，自由公*论。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2421,48,0);   --  1(1):[游坦之]说: 我大宋南有辽国，西有西夏*、吐蕃，北有大理，四夷虎*视眈眈，这个……这个……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2422,245,1);   --  1(1):[???]说: 什么"南有辽国，北有大理"*，好大一个丐帮，竟由你这*种不学无术之人出任帮主，*岂不让天下英雄笑话！你要*争武林盟主是吗？不用玄慈*方丈动手，我先来领教领教*丐帮得降龙十八掌和打狗棒*法！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2423,48,0);   --  1(1):[游坦之]说: 降龙十八掌？……这个……*这个……
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(197,4,0,0) ==false then    --  6(6):战斗[197]是则跳转到:Label5
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label5

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2424,245,1);   --  1(1):[???]说: 你这是什么毒功！！身为丐*帮帮主，为什么不用降龙十*八掌？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2425,48,0);   --  1(1):[游坦之]说: 这个……这是……因为……*这个武功比降龙十八掌厉害*……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2426,50,0);   --  1(1):[乔峰]说: 谁说这邪门毒功胜过了降龙*十八掌？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,69,0,0,0,0,0,8240,8240,8240,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,68,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_30(52,37,52,43);   --  30(1E):主角走动52-37--52-43
        instruct_30(52,43,45,43);   --  30(1E):主角走动52-43--45-43
        instruct_40(3);   --  40(28):改变主角站立方向3
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2427,247,1);   --  1(1):[???]说: 乔大哥、阿朱姑娘！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2428,50,0);   --  1(1):[乔峰]说: 小兄弟好。今后不要再叫我*乔大哥了。我是契丹人，萧*峰！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2429,247,1);   --  1(1):[???]说: 乔也罢，萧也罢，汉人也好*，契丹也好，你始终是我的*好大哥！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2430,50,0);   --  1(1):[乔峰]说: 哈哈哈，好兄弟！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2431,0,2);   --  1(1):[AAA]说: 众人：*姓乔的，你杀了我的兄长，*血仇未曾得报，今日和你拼*了！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2432,0,2);   --  1(1):[AAA]说: 众人：*这乔峰乃契丹胡虏，人人得*而诛之，今日可再也不能容*他或者走下少室山！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2433,51,0);   --  1(1):[慕容复]说: ＜这乔峰如今已被逐出丐帮*，成为中原武林的公敌，我*正好趁此机会，收揽人心，*以为己助。＞  萧兄，你是*契丹英雄，视我中原豪杰有*如无物，区区姑苏慕容复今*日想领教阁下高招。在下死*在萧兄掌下，也算是为中原*豪杰尽了一分微力，虽死犹*荣。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2434,245,1);   --  1(1):[???]说: 住口！你与萧大哥素无恩怨*，为何一再苦苦相逼！你处*心积虑，收买人心，就为了*你那虚无缥缈的皇帝梦！要*碰我大哥，先过我这一关！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(198,4,0,0) ==false then    --  6(6):战斗[198]是则跳转到:Label6
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label6

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2435,48,0);   --  1(1):[游坦之]说: 杀父之仇，不共戴天，姓萧*的，今日便来做个了断！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2436,50,0);   --  1(1):[乔峰]说: 尽管来吧，萧某何惧！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(199,4,0,0) ==false then    --  6(6):战斗[199]是则跳转到:Label7
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label7

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2437,103,0);   --  1(1):[???]说: 久闻降龙十八掌天下无双，*贫僧也要领教一二。
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(200,4,0,0) ==false then    --  6(6):战斗[200]是则跳转到:Label8
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label8

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2438,98,0);   --  1(1):[???]说: ＜这萧峰武功卓绝，而且似*乎与段正淳他们交情不错，*不如今日借着人多势众，将*之除去……＞**我们也上！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2439,207,0);   --  1(1):[???]说: 这萧峰乃是契丹胡虏，武林*公敌，更是我们丐帮的叛徒*，丐帮兄弟们，一起上啊！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2440,245,1);   --  1(1):[???]说: 想仗着人多欺负人吗？来吧*！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(81,4,0,0) ==false then    --  6(6):战斗[81]是则跳转到:Label9
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label9

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2441,76,0);   --  1(1):[???]说: 啊……表哥小心！……公子*手下留情啊！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2442,245,1);   --  1(1):[???]说: 哼，看在王姑娘的面子上，*今日姑且留你一命！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2443,51,0);   --  1(1):[慕容复]说: ＜我……我今日数次惨败，*居然还要女人求情来保住性*命，我还有何颜面活在这世*上，不如干脆……＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2444,113,0);   --  1(1):[???]说: 住手！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,67,0,0,0,0,0,7132,7132,7132,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2445,113,0);   --  1(1):[???]说: 你有儿子没有？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2446,51,0);   --  1(1):[慕容复]说: 我尚未婚配，何来子嗣？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2447,113,0);   --  1(1):[???]说: 你有祖宗没有？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2448,51,0);   --  1(1):[慕容复]说: 自然有！我自愿就死，与你*何干？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2449,113,0);   --  1(1):[???]说: 你高祖有儿子，你曾祖、祖*父、父亲都有儿子，便是你*没儿子！嘿嘿，大燕国当年*慕容恪、慕容垂何等英雄，*却不料都变成了断种绝代的*无后之人！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2450,51,0);   --  1(1):[慕容复]说: 这……慕容复见识短绌，得*蒙高人指点迷津，大恩大德*，没齿难忘。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2451,113,0);   --  1(1):[???]说: 萧大侠武功卓绝，果然名不*虚传，老夫想领教几招！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2452,50,0);   --  1(1):[乔峰]说: 不敢！请！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2453,112,0);   --  1(1):[???]说: 哈哈哈……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,71,0,0,0,0,0,7134,7134,7134,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2454,113,0);   --  1(1):[???]说: 你……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2454,112,0);   --  1(1):[???]说: 你……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2455,113,0);   --  1(1):[???]说: 你在少林寺中一躲数十年，*所为何事？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2456,112,0);   --  1(1):[???]说: 我也正要问你，你在少林寺*中一躲数十年，又所为何事*？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2457,113,0);   --  1(1):[???]说: 我藏身少林，是为了寻找一*些东西。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2458,112,0);   --  1(1):[???]说: 我也是为了寻找一些东西，*我想找得东西已经找到，我*想你要找的东西也已经找到*了，否则我们三次较量，该*当分出了高下。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2459,113,0);   --  1(1):[???]说: 不错，尊驾武功了得，你我*互相钦服，不用再较量了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2460,112,0);   --  1(1):[???]说: 甚好！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2461,50,0);   --  1(1):[乔峰]说: ＜这个声音……不正是那日*救我出聚贤庄的黑衣人吗？*……＞ **恩公，请受萧峰一拜！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2462,112,0);   --  1(1):[???]说: 恩公？哈哈哈，你再仔细看*看我！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2463,50,0);   --  1(1):[乔峰]说: 你……你是我爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2464,112,0);   --  1(1):[???]说: 好孩儿，好孩儿，我正是你*爹爹。咱爷俩一般的身形相*貌。不用记认，谁都知道我*是你的老子。那日雁门关外*，中原豪杰不问情由，便杀*了你不会武功的妈妈。孩儿*，你说此仇该不该报？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2465,50,0);   --  1(1):[乔峰]说: 杀母之仇，不共戴天，焉可*不报？智光大师、谭公、谭*婆、赵钱孙等人皆已死于非*命，可是孩儿至今不知那位*带头大哥是谁。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2466,112,0);   --  1(1):[???]说: 那些人都是我杀的！*那个带头大哥就在少室山！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2467,50,0);   --  1(1):[乔峰]说: 是谁？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2468,70,0);   --  1(1):[玄慈]说: 萧老施主，雁门关外一役，*老衲铸成大错。众家兄弟为*老衲包涵此事，又一一送命*。老衲今日再死，实在已经*晚了。**慕容博慕容老施主，*当日你假传音讯，说道契丹*武士要大举来少林寺夺取武*学典籍，以致酿成种种大错*，你可也曾有丝毫内疚于心*吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2469,113,0);   --  1(1):[???]说: 方丈大师，你眼光好生厉害*，居然将我认了出来
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2470,51,0);   --  1(1):[慕容复]说: 爹爹，你……你没有……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2471,70,0);   --  1(1):[玄慈]说: 慕容老施主，老衲今日听你*对令郎的劝导言语，才知你*姑苏慕容氏竟是帝王之裔，*所谋者大。那么你假传音讯*的用意，也就明白不过了。*只是你所图谋的大事，却也*终究难成，那不是枉自害死*了这许多无辜的性命么？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2472,113,0);   --  1(1):[???]说: 谋事在人，成事在天！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2473,112,0);   --  1(1):[???]说: 慕容老贼，原来你才是罪魁*祸首，上来领死吧！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2474,113,0);   --  1(1):[???]说: 哈哈哈，恕不奉陪！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2475,112,0);   --  1(1):[???]说: 想跑？追！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2476,50,0);   --  1(1):[乔峰]说: 追！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2477,51,0);   --  1(1):[慕容复]说: 爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,59,0,0,0,0,0,-2,-2,-2,0,17,52);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        instruct_3(-2,71,0,0,0,0,0,-2,-2,-2,-2,16,50);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
        instruct_3(-2,69,0,0,0,0,0,-2,-2,-2,-2,16,52);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,67,0,0,0,0,0,-2,-2,-2,-2,17,50);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2478,0,1);   --  1(1):[AAA]说: 恩……他们竟然跑向了少林*的藏经阁，我得过去看看
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_19(26,52);   --  19(13):主角移动至1A-34
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_25(26,52,15,54);   --  25(19):场景移动26-52--15-54
        instruct_1(2479,0,1);   --  1(1):[AAA]说: ＜这老和尚是何方神圣？竟*然能降服萧远山和慕容博两*位老英雄？＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2480,114,0);   --  1(1):[???]说: 你二人由生到死、由死到生*地走了一遍，心中还有什么*放不下？倘若适才就此死了*，还有什么兴复大燕、报复*妻仇的念头？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2481,112,0);   --  1(1):[???]说: 弟子生平杀人，无虑百数，*倘若被我所杀之人的眷属皆*来向我复仇索命，弟子虽死*百次，亦自不足。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2482,114,0);   --  1(1):[???]说: 你呢？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2483,113,0);   --  1(1):[???]说: 庶民如尘土，帝王亦如尘土*。大燕不复国是空，复国亦*是空。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2484,114,0);   --  1(1):[???]说: 大彻大悟，善哉善哉，你二*人这就随我去吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2477,50,0);   --  1(1):[乔峰]说: 爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2477,51,0);   --  1(1):[慕容复]说: 爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,35,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,34,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,33,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,62,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
        instruct_3(-2,66,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
        instruct_3(-2,65,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
        instruct_3(-2,64,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
        instruct_3(-2,63,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
        instruct_3(-2,70,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
        instruct_3(-2,58,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
        instruct_3(-2,57,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
        instruct_3(-2,56,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
        instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
        instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
        instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
        instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
        instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
        instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
        instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
        instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
        instruct_3(-2,68,0,0,0,0,0,-2,-2,-2,-2,25,52);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_3(-2,69,0,0,0,0,0,-2,-2,-2,-2,26,53);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,71,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
        instruct_3(-2,67,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_3(-2,59,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
        instruct_19(26,52);   --  19(13):主角移动至1A-34
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2485,50,0);   --  1(1):[乔峰]说: 好兄弟，你是个顶天立地的*好男儿，我知道你在寻找《*天龙八部》一书，此书我今*日就赠送与你。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(147,1);   --  2(2):得到物品[天龙八部][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2486,0,0);   --  1(1):[AAA]说: 多谢大哥。不知大哥今后有*何打算？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2508,50,0);   --  1(1):[乔峰]说: 我会与阿朱去塞外。塞外牛*羊，绝不是空许约！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2488,104,0);   --  1(1):[???]说: 大哥，你待我真好。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2489,50,0);   --  1(1):[乔峰]说: 这降龙十八掌乃天下至刚的*掌法，我不想此掌法从此失*传，今日也一并传给你吧。*希望你将此掌法用于正途，*发扬光大。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(86,1);   --  2(2):得到物品[降龙十八掌][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2490,0,1);   --  1(1):[AAA]说: 多谢大哥。大哥教诲，小弟*紧记在心。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2491,50,0);   --  1(1):[乔峰]说: 阿朱，我们走吧。兄弟，日*后有缘，也许还有相见之日*。告辞了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,68,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_3(-2,69,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(77,0,1,0,1061,0,0,6414,6414,6414,-2,-2,-2);   --  3(3):修改事件定义:场景[万鳄岛]:场景事件编号 [0]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label4

    instruct_0();   --  0(0)::空语句(清屏)
--end

