--function oldevent_45()

    if instruct_4(206,0,331) ==true then    --  4(4):是否使用物品[唐诗选集]？否则跳转到:Label0
        instruct_3(3,5,1,0,644,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [5]
        instruct_3(3,6,1,0,644,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [6]
        instruct_3(3,8,1,0,644,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [8]
        instruct_1(229,0,1);   --  1(1):[AAA]说: 咦，有字显示出来了，"连*城诀……天宁寺大佛后……*"
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,5,1,0,44,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(63,17,0,0,0,0,48,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [17]
        instruct_3(-2,-2,1,0,47,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_32(206,-1);   --  32(20):物品[唐诗选集]+[-1]
        instruct_3(63,1,0,0,0,0,0,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [1]
        instruct_3(63,2,0,0,0,0,0,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [2]
        instruct_3(63,3,0,0,0,0,0,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [3]
        instruct_3(63,4,0,0,0,0,0,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [4]
        instruct_3(63,5,0,0,0,0,0,6770,6770,6770,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [5]
        instruct_3(63,6,0,0,0,0,0,6770,6770,6770,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [6]
        instruct_3(63,7,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [7]
        instruct_3(63,8,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [8]
        instruct_3(63,9,0,0,0,0,0,6780,6780,6780,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [9]
        instruct_3(63,10,0,0,0,0,0,6780,6780,6780,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [10]
        instruct_3(63,11,0,0,0,0,0,6780,6780,6780,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [11]
        instruct_3(63,12,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [12]
        instruct_3(63,13,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [13]
        instruct_3(63,14,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [14]
        instruct_3(63,15,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [15]
        instruct_3(63,16,0,0,0,0,0,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [16]
        instruct_3(63,18,1,0,49,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [18]
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
--end

