--function oldevent_598()
    instruct_1(2591,49,0);   --  1(1):[虚竹]说: 佛祖啊，我找不到回少林的*路了，请您指引我一条明路*吧。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(2,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(2592,0,1);   --  1(1):[AAA]说: 小和尚，不如我送你回少林*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2593,49,0);   --  1(1):[虚竹]说: 哇哇哇，佛祖显灵了……
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,75,999,7,0) ==false then    --  28(1C):判断AAA品德75-999是则跳转到:Label1
        instruct_1(2594,49,0);   --  1(1):[虚竹]说: 施主眼中充满戾气，恐入魔*道，小僧知道，这一定是佛*祖对我的考验，阿弥陀佛，*小僧不能与你同行。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1


    if instruct_20(53,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
        instruct_1(2595,49,0);   --  1(1):[虚竹]说: 师傅说的没错，佛祖真是灵*验啊，阿弥陀佛。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,15,1,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
        instruct_3(-2,2,1,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(28,38,1,0,0,0,0,2286,2286,2286,-2,-2,-2);   --  3(3):修改事件定义:场景[少林寺]:场景事件编号 [38]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_10(49);   --  10(A):加入人物[虚竹]
        do return; end
    end    --:Label2

    instruct_1(2596,49,0);   --  1(1):[虚竹]说: 阿弥陀佛，你队伍已满，我无法加入。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2597,0,1);   --  1(1):[AAA]说: 那你就去小村等我吧
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2598,49,0);   --  1(1):[虚竹]说: 阿弥陀佛，小僧不知道去小*村的路。
    instruct_0();   --  0(0)::空语句(清屏)
--end

