--function oldevent_366()
    instruct_1(1373,238,0);   --  1(1):[???]说: 怎么办，怎么办……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1374,0,1);   --  1(1):[AAA]说: 姑娘有何为难之事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1375,238,0);   --  1(1):[???]说: 我的天哥练功走火入魔，需*要玄冰碧火酒来调和内息，*你能不能帮我去拿来？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1376,0,1);   --  1(1):[AAA]说: 去哪拿啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1377,238,0);   --  1(1):[???]说: 就在隔壁。我爷爷的几个徒*弟在那看着，我不方便露面*，你帮帮忙吧，我不会亏待*你的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1378,247,1);   --  1(1):[???]说: 哈哈，原来你让我去偷你自*己家的东西啊。好吧，看你*急的那副样子，我这个人最*心软了。你爷爷的徒弟，不*会很厉害吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1379,238,0);   --  1(1):[???]说: 几个草包，很容易打发。你*快去啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,367,372,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,22,1,0,369,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,23,1,0,369,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,24,1,0,369,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
--end

