--function oldevent_762()
    instruct_1(3067,106,0);   --  1(1):[???]说: 少侠来我王府有何贵干啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3068,0,1);   --  1(1):[AAA]说: 久仰王老爷子金刀无敌的大*名，今日特来拜见。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3069,106,0);   --  1(1):[???]说: 呵呵呵，什么金刀无敌，江*湖上的朋友往老朽脸上贴金*啦，呵呵呵……
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3070,0,1);   --  1(1):[AAA]说: 我觉得也是，什么金刀无敌*，纯粹胡吹大气。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3071,106,0);   --  1(1):[???]说: 你——！小娃娃，你今日来*此，是来挑衅的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3072,0,1);   --  1(1):[AAA]说: 我就是想见识一下，什么样*的刀能叫做无敌金刀！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3073,106,0);   --  1(1):[???]说: 哈哈，小娃娃，原来是来考*教老朽的功夫来了，好，就*让你尝尝我金刀的厉害！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(209,4,0,0) ==false then    --  6(6):战斗[209]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3074,0,1);   --  1(1):[AAA]说: 这就是金刀啊，我看也没什*么了不起嘛，我替你保管好*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(47,1);   --  2(2):得到物品[金刀][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,106,0);   --  1(1):[???]说: …………
    instruct_3(-2,-2,1,0,763,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(-5);   --  37(25):增加道德-5
--end

