--function oldevent_369()
    instruct_37(1);   --  37(25):增加道德1
    instruct_1(1382,199,0);   --  1(1):[???]说: 什么人！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1383,0,1);   --  1(1):[AAA]说: 啊，是我。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1384,199,0);   --  1(1):[???]说: 你是谁？想干什么！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1385,247,1);   --  1(1):[???]说: 这个，我想借一下那个什么*"玄冰碧火酒"。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1386,199,0);   --  1(1):[???]说: 原来是来偷酒的，小子，着*家伙！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(166,3,0,0) ==false then    --  6(6):战斗[166]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1387,0,1);   --  1(1):[AAA]说: 唉，何必逼我动手呢？何必*呢？何——必——呢——？
    instruct_0();   --  0(0)::空语句(清屏)
--end

