--function oldevent_757()
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_37(1);   --  37(25):增加道德1
    instruct_13();   --  13(D):重新显示场景
    instruct_25(48,36,30,22);   --  25(19):场景移动48-36--30-22
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3027,148,0);   --  1(1):[???]说: 我这股真气，从中渎而至风*市、环跳，在他渊液之间来*回，必能治好他的内伤。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3035,147,0);   --  1(1):[???]说: 不对不对，应该以真气游走*他足厥阴肝经诸经脉……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3036,146,0);   --  1(1):[???]说: 还是我的法子好。这小子的*内伤，是属于心包络，须得*以真气通他肾络三焦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3037,144,0);   --  1(1):[???]说: 这般以真气在他渊液间来回*，我看不大妥当，还是先治*他的足少阴肾经为是。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3031,145,0);   --  1(1):[???]说: 他胸口中掌，受了内伤，自*然当以治他手太阳肺经为主*。我用真气贯注他中府、尺*泽、孔最、列缺、太渊、少*商诸穴，最是对症。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3033,143,0);   --  1(1):[???]说: 这小子头脑发昏，心智胡涂*，须得治他阳明胃经。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3038,145,0);   --  1(1):[???]说: 咱们便试一试，到底谁说得*对。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3034,245,1);   --  1(1):[???]说: 你们六个怪物，还不快住手*！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(206,3,0,0) ==false then    --  6(6):战斗[206]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_19(31,23);   --  19(13):主角移动至1F-17
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_46(35,-200);   --  46(2E):令狐冲增加内力-200
    instruct_45(35,-50);   --  45(2D):令狐冲增加轻功-50
    instruct_48(35,-200);   --  48(30):令狐冲增加生命-200
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3039,0,1);   --  1(1):[AAA]说: 令狐兄，你感觉怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3040,35,0);   --  1(1):[令狐冲]说: 这六个家伙夹杂不清，稀里*糊涂，本来是一片好心要为*我治伤，可是各按各的治法*，我现在体内真气乱窜，少*侠快送我回华山。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3041,0,1);   --  1(1):[AAA]说: 好，令狐兄，我送你回去。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(61,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_10(35);   --  10(A):加入人物[令狐冲]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,11,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_3(57,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [0]
        instruct_3(57,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [1]
        instruct_3(57,15,1,0,759,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [15]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(3042,35,0);   --  1(1):[令狐冲]说: 可惜，你的队伍已满，我无*法加入。
    instruct_0();   --  0(0)::空语句(清屏)
--end

