--function oldevent_908()

    if instruct_16(35,2,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,12,0,0,0,0,0,7156,7156,7156,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,0,0,0,7142,7142,7142,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_37(5);   --  37(25):增加道德5
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(48,36,21,22);   --  25(19):场景移动48-36--21-22
    instruct_1(3637,36,0);   --  1(1):[林平之]说: 我的剑谱早已尽数交给你爹*爹了，自己没私自留下一招*半式，你又何必苦苦的跟着*我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3638,79,0);   --  1(1):[???]说: 你老是疑心我爹爹图你的剑*谱，当真好没来由。你如此*损我爹爹，当我是甚么人了*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3639,36,0);   --  1(1):[林平之]说: 哼，令狐冲在福州抢到了剑*谱，毕竟还是拿不去，却落*入了你爹爹手中……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3640,79,0);   --  1(1):[???]说: 不，不会的！爹爹说，剑谱*给大师哥拿了去，我曾求他*还给你，他说甚么也不肯。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3641,36,0);   --  1(1):[林平之]说: 现下说与你知，也不相干。*那日在福州，那几人抢了剑*谱，却被令狐冲杀死。剑谱*自然是令狐冲得去了。可是*当他身受重伤、昏迷不醒之*际，我搜他身上，剑谱却已*不知去向。剑谱既不在令狐*冲身上，定是给你爹娘取了*去。一回华山，我每晚都躲*在你爹娘卧室之侧的悬崖上*，要从他们的谈话之中，查*知剑谱的所在。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3642,79,0);   --  1(1):[???]说: 每天晚上？你真有毅力。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3643,36,0);   --  1(1):[林平之]说: 为报大仇，不得不然。有一*天晚上，你妈妈问你爹爹你*为何要冤枉冲儿偷了我的辟*邪剑谱？说那日令狐冲受伤*昏迷，你妈妈替他止血治伤*时，曾经看到过剑谱，第二*次替他换药，那剑谱就不见*了，其时令狐冲仍然昏迷未*醒。那段时候除了你父母二*人，并无别人进房。还说你*爹爹苦心焦虑，为了保全本*派。只是那辟邪剑法练之有*损无益，劝你爹爹万万不要*修炼。你爹爹说要听你娘的*劝，找时间就设法把剑谱交*给我，再慢慢想法替令狐冲*洗刷清白。你娘说这剑谱于*人有损，不可让我见到，让*你爹爹毁去为是。你爹爹同*意把剑谱毁去，然后立刻开*窗把剑谱扔下天生崖，老天*有眼，剑谱挂在树丫上，我*捡了回来。正是我家祖传的*辟邪剑谱。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3644,79,0);   --  1(1):[???]说: 妈妈只道爹爹将剑谱掷入了*天声峡中，其实爹爹早将剑*法记熟，剑谱于他已然无用*，却让你因此而学得了剑法*，是不是？嗯，天意如此。*冥冥之中，老天爷一切早有*安排，要你由此而报你父母*的仇了。那……那……那也*很好，也好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3645,36,0);   --  1(1):[林平之]说: 你爹爹处心积虑，就是要得*到这辟邪剑谱。从他派你和*令狐冲去福州，到收我为徒*，再把你许配于我，一起去*福建，彻头彻尾都是你爹爹*的阴谋，他把一切都推倒令*狐冲身上，目的就是要得到*我林家的辟邪剑谱。嘿嘿，*君子剑，好一个君子剑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3646,79,0);   --  1(1):[???]说: 我爹爹，我爹爹，他……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3647,35,1);   --  1(1):[令狐冲]说: ＜我师父，他……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,14,0,0,0,0,0,5206,5206,5206,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3648,198,0);   --  1(1):[???]说: 林少侠，你们的对话在下全*都听到了，岳不群那狗贼设*奸计夺得了五岳盟主，左掌*门在下奉嵩山左掌门之命，*前来邀请林兄弟随我去见他*老人家，你是福州林家辟邪*剑门的唯一传人，便是辟邪*剑门的掌门，左掌门自当以*礼相待，好生相敬。你和他*在一起，共谋报此大仇，岂*不甚妙？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3649,36,0);   --  1(1):[林平之]说: 左掌门愿与在下结盟，在下*是高攀了。岳不群设计私吞*我林家辟邪剑谱，我诛杀岳*不群之心，与左掌门一般无*异。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3650,79,0);   --  1(1):[???]说: 啊——啊~~~！你~~你~~你*好狠心呀。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,13,1,0,0,0,0,5436,5436,5436,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3651,198,0);   --  1(1):[???]说: 好，林兄弟既然杀了岳不群*的女儿表明心迹，咱们这就*去见左掌门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3652,35,1);   --  1(1):[令狐冲]说: 小师妹！！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3653,245,1);   --  1(1):[???]说: 你们这两个狗贼，杀了人就*要偿命。哪里走。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(34,4,0,0) ==false then    --  6(6):战斗[34]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_3(-2,14,1,0,0,0,0,5434,5434,5434,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,12,1,0,0,0,0,7144,7144,7144,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_19(22,23);   --  19(13):主角移动至16-17
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3654,35,0);   --  1(1):[令狐冲]说: 小师妹，小师妹，你怎么样*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3655,79,0);   --  1(1):[???]说: 大师兄，我不行了……你，*我对不起你……但你别，别*怪小林子……他很可怜的…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3656,35,0);   --  1(1):[令狐冲]说: 小师妹——！！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3657,244,1);   --  1(1):[???]说: 令狐大哥，岳姑娘已经走了*，不要过度悲伤了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,15,1,0,0,0,0,5962,5962,5962,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,24,0,0,0,0,0,5174,5174,5174,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,25,0,0,0,0,0,5174,5174,5174,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,16,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,19,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,17,0,0,0,0,0,5190,5190,5190,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,20,0,0,0,0,0,5190,5190,5190,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,18,0,0,0,0,0,5198,5198,5198,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,22,0,0,0,0,0,5198,5198,5198,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,5206,5206,5206,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,23,0,0,0,0,0,5206,5206,5206,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_40(3);   --  40(28):改变主角站立方向3
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3658,19,0);   --  1(1):[岳不群]说: 令狐冲，你勾结魔教妖人，*居然杀害了我女儿女婿，你*们还想走么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3659,35,1);   --  1(1):[令狐冲]说: 师父！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3660,245,1);   --  1(1):[???]说: 岳不群，你这个伪君子，原*来一切都是你的阴谋！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(56,4,0,0) ==false then    --  6(6):战斗[56]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2

    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3661,245,1);   --  1(1):[???]说: 这种卑鄙小人，留在世间只*能危害武林，我来取他性命*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3662,35,0);   --  1(1):[令狐冲]说: 小兄弟且慢，怎么说我和他*都师徒一场，请看在我的面*子上饶过他吧
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3663,19,0);   --  1(1):[岳不群]说: 少侠如能放过在下，在下愿*以此物献给少侠。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(151,1);   --  2(2):得到物品[笑傲江湖][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3664,245,1);   --  1(1):[???]说: 原来《笑傲江湖》一书一直*在你手上，岳不群，你还真*是深藏不露啊。好，那就看*在令狐兄弟的面子上，今天*饶你不死，世间自有公道，*如你以后还胡作非为，自然*有人会对付你的。滚吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(57,1,0,0,909,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [1]
    instruct_3(57,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [32]
    instruct_37(5);   --  37(25):增加道德5
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

