--function oldevent_566()
    instruct_37(5);   --  37(25):增加道德5
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_25(43,30,29,27);   --  25(19):场景移动43-30--29-27
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2385,50,0);   --  1(1):[乔峰]说: 薛神医，请您一定要治好这*位姑娘。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2386,45,0);   --  1(1):[薛慕华]说: 哼！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2387,104,0);   --  1(1):[???]说: 乔大哥……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2388,50,0);   --  1(1):[乔峰]说: 各位既已和乔某喝过了这绝*交酒，咱们从前的交情就一*笔勾销。哪一个先来决一死*战！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(43,30,29,30);   --  30(1E):主角走动43-30--29-30
    instruct_30(29,30,29,28);   --  30(1E):主角走动29-30--29-28
    instruct_1(2389,50,0);   --  1(1):[乔峰]说: 尊驾何人？要取乔某性命，*尽管来吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2390,0,1);   --  1(1):[AAA]说: 乔兄误会了。我深信乔兄为*人，大丈夫光明磊落，那些*杀人放火的勾当，绝非乔兄*所为。我今日来此，誓要与*乔兄并肩作战！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2391,50,0);   --  1(1):[乔峰]说: 哈哈哈……今日，相交多年*的好友都跟乔某喝了这绝交*酒，没想到一位素昧平生的*小兄弟却愿与我共患难。好*兄弟，就让你我二人联手抗*敌，看看他们都有些什么本*领！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(192,4,0,0) ==false then    --  6(6):战斗[192]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景

    if instruct_6(193,4,0,0) ==false then    --  6(6):战斗[193]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景

    if instruct_6(194,4,0,0) ==false then    --  6(6):战斗[194]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景

    if instruct_6(195,4,0,0) ==false then    --  6(6):战斗[195]是则跳转到:Label3
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label3

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景

    if instruct_6(196,4,0,0) ==false then    --  6(6):战斗[196]是则跳转到:Label4
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label4

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2392,50,0);   --  1(1):[乔峰]说: ＜今日众人是都冲着我来的*，怎能让这个小兄弟跟着我*无辜受牵连……＞，小兄弟*，多谢你了，接招！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2393,0,1);   --  1(1):[AAA]说: 啊，乔兄，你……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(54,0,1,0,567,0,0,6416,6416,6416,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [0]
    instruct_3(54,32,1,0,567,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [32]
    instruct_19(11,42);   --  19(13):主角移动至B-2A
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_27(-1,6014,6024);   --  27(1B):显示动画
    instruct_3(-2,31,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_1(2394,244,1);   --  1(1):[???]说: 啊……我这是在哪里啊？啊*……想起来了……乔帮主…*…乔帮主用他最后的内力把*我送出了聚贤庄，那他呢？
    instruct_0();   --  0(0)::空语句(清屏)
--end

