--function oldevent_243()
    instruct_37(-2);   --  37(25):增加道德-2
    instruct_26(60,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,7,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,0,0,0,0,0,0,7034,7034,7034,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,7,0,0,0,0,0,7050,7050,7050,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,3,0,0,0,0,0,5970,5970,5970,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,0,0,0,0,6058,6058,6058,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,0,0,0,6786,6786,6786,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,5892,5892,5892,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,2,0,0,0,0,0,5454,5454,5454,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(50,36,33,36);   --  30(1E):主角走动50-36--33-36
    instruct_1(693,0,1);   --  1(1):[AAA]说: 这不是张大人么？怎么这么*惨？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(694,80,0);   --  1(1):[???]说: 少侠救我，他们一群人欺负*我一个。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(695,75,0);   --  1(1):[???]说: 又是你，几次三番坏我红花*会的事，到底是何用意？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(696,0,1);   --  1(1):[AAA]说: 其实……我没……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(697,80,0);   --  1(1):[???]说: 少侠，我知道你一直要找十*四天书。最近我得到了《书*剑恩仇录》一书，准备送与*少侠，刚才被陈家洛抢去了*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(698,0,1);   --  1(1):[AAA]说: 陈总舵主，这天书对我至关*重要，还望赠与在下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(699,75,0);   --  1(1):[???]说: 哼，天书乃武林至宝，怎能*交与你这种匪类。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(700,0,1);   --  1(1):[AAA]说: 如此，得罪了。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(144,3,0,0) ==false then    --  6(6):战斗[144]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(701,152,0);   --  1(1):[???]说: 对付这种人，不必讲什么江*湖道义，大伙一起上！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(140,3,0,0) ==false then    --  6(6):战斗[140]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(152,1);   --  2(2):得到物品[书剑恩仇录][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(702,75,0);   --  1(1):[???]说: 这下子武功厉害，大家暂避*一时。反正张召重护驾不利*，不是杀头，也要坐牢。我*们今日就放过他，咱们走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(703,0,1);   --  1(1):[AAA]说: 张大人，你没事吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(704,80,0);   --  1(1):[???]说: 还好，多亏少侠及时赶到。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(705,0,1);   --  1(1):[AAA]说: 张大人今后有什么打算？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(706,80,0);   --  1(1):[???]说: 这群红花会的反贼，胆大包*天，那天没能劫走朝廷要犯*，居然就胁持了皇帝。我现*在回去，恐怕要被问个渎职*之罪。干脆暂避一时吧。我*先帮你找天书，以报答你的*救命之恩。待风声过后，再*找机会回朝中复职。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(707,0,1);   --  1(1):[AAA]说: ＜要在我这避难啊……＞，*能得张大人相助，真是如虎*添翼啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,85,1,0,981,0,0,7034,7034,7034,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [85]

    if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_10(80);   --  10(A):加入人物[张召重]
        do return; end
    end    --:Label2

    instruct_1(12,80,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(70,52,1,0,175,0,0,7034,7034,7034,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [52]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

