--function oldevent_232()
    instruct_26(60,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,7,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_30(24,39,24,32);   --  30(1E):主角走动24-39--24-32
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(570,74,0);   --  1(1):[霍青桐]说: 此书乃我回教圣物，决不允*许外人拿走。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(571,0,1);   --  1(1):[AAA]说: ＜书？圣物？难道是天书？*＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(572,208,0);   --  1(1):[???]说: 这是当今皇上的圣旨，谁敢*不从！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(573,0,1);   --  1(1):[AAA]说: ＜原来是官兵……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(574,74,0);   --  1(1):[霍青桐]说: 哼，我们远在回疆，向来独*立，皇帝是你们的，与我回*人何干？我们回人但有一口*气在，也要誓死保护自己的*圣物。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(575,208,0);   --  1(1):[???]说: 哼，臭丫头，敬酒不吃吃罚*酒，那就别怪我们不客气了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(576,0,1);   --  1(1):[AAA]说: ＜一边是官兵，一边是回人*，我该帮哪一方呢？该帮助*回人么？＞

    if instruct_11(0,705) ==true then    --  11(B):是否住宿否则跳转到:Label0
        instruct_37(2);   --  37(25):增加道德2
        instruct_1(577,0,1);   --  1(1):[AAA]说: 你们这些官兵，总是欺压老*百姓，我早就看不过眼了，*回族弟兄们莫慌，我来助你*们。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(578,208,0);   --  1(1):[???]说: 哪来的不开眼的小子，活的*不耐烦了！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(141,3,0,0) ==false then    --  6(6):战斗[141]是则跳转到:Label1
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label1

        instruct_3(-2,13,0,0,0,0,0,6094,6094,6094,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
        instruct_3(-2,23,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
        instruct_3(-2,22,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
        instruct_3(-2,21,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
        instruct_3(-2,20,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
        instruct_3(-2,19,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
        instruct_3(-2,18,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
        instruct_3(-2,17,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
        instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
        instruct_3(-2,15,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
        instruct_3(-2,14,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(579,208,0);   --  1(1):[???]说: 唉呦，唉呦，……轻点……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(580,74,0);   --  1(1):[霍青桐]说: 多谢少侠助我族人保护圣物。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(581,0,1);   --  1(1):[AAA]说: 路见不平，拔刀相助，姑娘*太客气了。刚才听姑娘说，*这圣物是一本书？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(582,74,0);   --  1(1):[霍青桐]说: 不瞒恩公，这是回教的圣经*《可兰经》。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(583,0,1);   --  1(1):[AAA]说: 哦。*＜原来不是天书啊……＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,25,0,0,0,0,0,7006,7006,7006,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
        instruct_3(-2,16,0,0,0,0,0,5972,5972,5972,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
        instruct_3(-2,29,0,0,0,0,0,6056,6056,6056,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,31,0,0,0,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,5890,5890,5890,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,32,0,0,0,0,0,6784,6784,6784,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(584,75,0);   --  1(1):[???]说: 少侠好身手！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(585,0,1);   --  1(1):[AAA]说: 过奖，这位公子怎样称呼？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(586,75,0);   --  1(1):[???]说: 在下姓陈，名家洛。这是我*们红花会的众位兄弟。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(587,0,1);   --  1(1):[AAA]说: 原来是红花会陈当家。久仰*红花会大名，今日一见，果*然英雄了得。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(588,75,0);   --  1(1):[???]说: 少侠过奖。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(589,0,1);   --  1(1):[AAA]说: 却不知红花会群豪为何来此*？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(590,75,0);   --  1(1):[???]说: 我们的红花会的四当家文泰*来被官兵所擒，我们一路跟*踪这群官兵而来。适才本要*出手相助，但见少侠身手不*凡，我们也就不必多此一举*了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(591,74,0);   --  1(1):[霍青桐]说: 原来陈公子也是要助我回部*，霍青桐在此谢过。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(592,152,0);   --  1(1):[???]说: 总舵主，我们搜查一遍，没*发现文四弟。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(593,75,0);   --  1(1):[???]说: 把那个带头的官兵抓来问问*。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(594,152,0);   --  1(1):[???]说: 是。***快说，你们把文四弟藏到哪了？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(595,208,0);   --  1(1):[???]说: 唉呦，唉呦，……轻点……*，我说，我说，那位文，文*……，文大侠已经被我们张*大人押往死囚牢了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(596,75,0);   --  1(1):[???]说: 哪个张大人？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(597,208,0);   --  1(1):[???]说: 是，是，张，张召重，张大*人。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(598,153,0);   --  1(1):[???]说: 这张召重武功非比寻常，一*路柔云剑术出神入化，我们*需得小心行事。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(599,152,0);   --  1(1):[???]说: 哼，那正好，我要和他比比*剑法！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(600,75,0);   --  1(1):[???]说: 我们还有要事在身，就不在*此打扰了，这位少侠，还有*霍姑娘，在下告辞了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(601,0,1);   --  1(1):[AAA]说: 既是红花会有事，我也愿相*助搭救文四当家。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(602,74,0);   --  1(1):[霍青桐]说: 是啊，我也愿相助，陈公子*，让我和你一起去吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(603,75,0);   --  1(1):[???]说: 这是我红花会自己的事，怎*好麻烦二位。我看霍姑娘和*这位少侠聊得很投机呀……*多保重，告辞了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(604,74,0);   --  1(1):[霍青桐]说: 你——！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
        instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
        instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
        instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
        instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
        instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
        instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(8,20,1,0,237,0,0,7006,7006,7006,-2,-2,-2);   --  3(3):修改事件定义:场景[死囚牢]:场景事件编号 [20]
        instruct_3(8,19,1,0,237,0,0,5972,5972,5972,-2,-2,-2);   --  3(3):修改事件定义:场景[死囚牢]:场景事件编号 [19]
        instruct_3(8,16,1,0,237,0,0,6056,6056,6056,-2,-2,-2);   --  3(3):修改事件定义:场景[死囚牢]:场景事件编号 [16]
        instruct_3(8,17,1,0,237,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:场景[死囚牢]:场景事件编号 [17]
        instruct_3(8,18,1,0,237,0,0,5890,5890,5890,-2,-2,-2);   --  3(3):修改事件定义:场景[死囚牢]:场景事件编号 [18]
        instruct_3(8,22,1,0,237,0,0,6784,6784,6784,-2,-2,-2);   --  3(3):修改事件定义:场景[死囚牢]:场景事件编号 [22]
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label0

    instruct_37(-2);   --  37(25):增加道德-2
    instruct_1(605,0,1);   --  1(1):[AAA]说: 俗话说民不与官斗。我还是*帮着官兵好了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,28,0,0,0,0,0,7006,7006,7006,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,29,0,0,0,0,0,6056,6056,6056,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,31,0,0,0,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,5890,5890,5890,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,32,0,0,0,0,0,6784,6784,6784,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,27,0,0,0,0,0,5972,5972,5972,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(606,75,0);   --  1(1):[???]说: 回民弟兄们莫慌，我来助你*们。*道长、赵三哥，你们去帮助*回民杀官兵，其他人跟我来*，对付这个小子。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(138,3,0,0) ==false then    --  6(6):战斗[138]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label2

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(607,74,0);   --  1(1):[霍青桐]说: 啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(608,75,0);   --  1(1):[???]说: 好厉害，我们先避其锋芒，*走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,13,0,0,0,0,0,6094,6094,6094,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(609,208,0);   --  1(1):[???]说: 小子，你功夫不错嘛。要不*是你，今天恐怕还有些麻烦*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(610,0,1);   --  1(1):[AAA]说: 多谢军爷称赞。却不知军爷*到此是为了什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(611,208,0);   --  1(1):[???]说: 皇上有旨，要回部交出其圣*物《可兰经》。我们这是奉*旨行事。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(583,0,1);   --  1(1):[AAA]说: 哦。*＜原来不是天书啊……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(612,208,0);   --  1(1):[???]说: 你小子武功不错，我们张大*人一定会很欣赏你的。现在*红花会这帮反贼闹得厉害，*我们张大人抓住了他们得一*个匪首，姓文的，关押在死*囚牢。红花会这帮人肯定要*去闹事，小兄弟这么好的功*夫，不如和我们一起去报效*朝廷吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(613,0,1);   --  1(1):[AAA]说: 多谢军爷栽培。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,13,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,0,1,0,234,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,1,0,235,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,1,0,235,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(8,0,1,0,241,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[死囚牢]:场景事件编号 [0]
    instruct_3(8,1,1,0,241,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[死囚牢]:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

