--function oldevent_758()

    if instruct_20(66,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label0
        instruct_1(3043,0,1);   --  1(1):[AAA]说: 令狐兄，我送你回去。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(57,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [0]
        instruct_3(57,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [1]
        instruct_3(57,15,1,0,759,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [15]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_10(35);   --  10(A):加入人物[令狐冲]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3042,35,0);   --  1(1):[令狐冲]说: 可惜，你的队伍已满，我无*法加入。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_0();   --  0(0)::空语句(清屏)
--end

