--function oldevent_523()
    instruct_37(1);   --  37(25):增加道德1
    instruct_26(40,13,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,15,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,14,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_25(30,44,30,24);   --  25(19):场景移动30-44--30-24
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2228,103,0);   --  1(1):[???]说: 吐蕃国晚辈鸠摩智，参见前*辈大师。有常无常，双树枯*荣，南北西东，非假非空。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2229,102,0);   --  1(1):[???]说: ＜大轮明王博学精深，果然*名不虚传，一见面就道破了*我所参枯禅的来历＞明王远*来，老衲未克远迎。明王慈*悲。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2230,103,0);   --  1(1):[???]说: 天龙威名，小僧素所敬慕，*今日得见庄严宝相，大是欢*喜。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2231,102,0);   --  1(1):[???]说: 不知明王此来，有何赐教？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2232,103,0);   --  1(1):[???]说: 不敢。小僧生平有一至交，*是大宋姑苏人氏，复姓慕容*，单名一个"博"字。不意大*英雄天不假年，慕容先生西*归极乐。慕容先生当年论及*天下剑法，深信大理天龙寺*"六脉神剑"为天下诸剑中第*一，恨未得见，引为平生最*大憾事。小僧今日此来，便*是想借贵寺《六脉神剑经》*，焚于慕容先生坟前，以告*慰其在天之灵。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_19(32,26);   --  19(13):主角移动至20-1A
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2233,245,0);   --  1(1):[???]说: 你这番僧好没道理，人家好*好的剑谱，你居然要拿去烧*了，岂有此理！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2234,103,0);   --  1(1):[???]说: 这位施主可是天龙寺之人？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2235,245,1);   --  1(1):[???]说: 不是！怎么样？我是段公子*的朋友。听了你刚才那些话*，想想我就来气，你到底有*什么能耐，这么放肆！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2236,103,0);   --  1(1):[???]说: 少侠是要考教小僧的武艺了*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2237,245,1);   --  1(1):[???]说: 少废话！你要抢经，先过我*这关！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2238,102,0);   --  1(1):[???]说: 良机莫失，凝神观剑，自观*自学，不违祖训。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2239,53,0);   --  1(1):[段誉]说: ＜枯荣大师这句话是对我说*的？让我自行学习六脉神剑*？＞
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(100,1,0,1) ==false then    --  6(6):战斗[100]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2240,0,1);   --  1(1):[AAA]说: ＜这番僧可真厉害！＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2241,103,0);   --  1(1):[???]说: 啊，枯荣大师，你——
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2242,102,0);   --  1(1):[???]说: 阿弥陀佛——
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2243,103,0);   --  1(1):[???]说: ＜枯荣这老僧自知不敌，竟*然将图谱烧了……＞***＜他在烧图谱之前，已命那*蓝衫少年默默记诵，还当我*不知？哼，既然没了死图谱*，我要活图谱也是一样！…*…＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,24,0,0,0,0,0,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2244,53,0);   --  1(1):[段誉]说: 你干什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2245,103,0);   --  1(1):[???]说: 这位小施主心中记得六脉神*剑的图谱，原来的图谱已烧*，小施主就是活图谱。在慕*容先生坟前将他活活烧死，*也是一样，哈哈哈，贫僧去*也——
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(52,0,0,0,0,0,529,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [0]
    instruct_3(52,17,0,0,0,0,0,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [17]
    instruct_3(52,14,0,0,0,0,0,7108,7108,7108,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

