--function oldevent_575()
    instruct_1(2512,252,0);   --  1(1):[???]说: 我该不该去呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2513,0,1);   --  1(1):[AAA]说: 这位前辈在为何事烦恼？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2514,252,0);   --  1(1):[???]说: 唉，我嫁给了谭公，可是我*那师兄始终对我一往情深，*如今他来找我，你说我应该*出去和她相会吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_11(62,0) ==false then    --  11(B):是否住宿是则跳转到:Label0
        instruct_1(2515,0,1);   --  1(1):[AAA]说: 前辈既已嫁为人妇，理应恪*守妇道，不该再有私情，否*则怎对得起谭公呢？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2516,252,0);   --  1(1):[???]说: 你说得对啊……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2517,253,0);   --  1(1):[???]说: 好小子，说得有道理。这是*我钓鱼的秘方，就送给你吧*。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(177,1);   --  2(2):得到物品[渔叟钓法][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,5,1,0,577,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,0,1,0,578,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,7,1,0,582,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
        do return; end
    end    --:Label0

    instruct_1(2518,0,1);   --  1(1):[AAA]说: 既然这位赵钱孙先生对您一*往情深，在外苦苦守候，你*还是应该出去见他一面。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2519,252,0);   --  1(1):[???]说: 你说得对啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,6,1,0,577,0,0,7130,7130,7130,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,0,1,0,579,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,7,1,0,580,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

