--function oldevent_84()
    instruct_1(323,224,0);   --  1(1):[???]说: 汪帮主，你可好久没来了，*想死奴家了
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(324,0,2);   --  1(1):[AAA]说: 嫖客：*好宝贝儿，我这不是来了嘛*，来，亲一个
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(325,224,0);   --  1(1):[???]说: 上次奴家和你说的事，怎么*样了，我三舅的邻居的外甥*女的男朋友，你到底安排了*没有啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(326,0,2);   --  1(1):[AAA]说: 嫖客：*宝贝儿求我，当然早就安排*好了，有个武馆科班出身的*小子，没啥背景，已经让我*撵到伙房去，你的三舅的邻*居的外甥女的男朋友来顶替*他的位置。别说这些啦，宝*贝快上来，今晚要和你大战*三百合。
--end

