--function oldevent_692()
    instruct_1(2831,255,0);   --  1(1):[???]说: 年轻人，你来啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2832,246,1);   --  1(1):[???]说: 死老头，就会这句，难道会*说这句话就是贤者吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2833,255,0);   --  1(1):[???]说: 不，作为贤者，我还有更重*要的事情要对你说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2834,0,1);   --  1(1):[AAA]说: 我就知道，你总会再给我一*些提示的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2835,255,0);   --  1(1):[???]说: 在江湖上行走，最重要的就*是使自己保持在正道之上。*旁边这个镜子……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2836,0,1);   --  1(1):[AAA]说: 这个镜子能看道德值，对吧*？我从小到大看这个镜子不*知多少遍了，每次都是显示*50，不知道是不是劣质产品*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2837,255,0);   --  1(1):[???]说: 那是因为你还没有踏入江湖*，当你真正踏入江湖的时候*，这个镜子才会开始起作用*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2838,0,1);   --  1(1):[AAA]说: 那就是现在开始起作用喽。*好吧，没有别的事了吧，我*走了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2839,255,0);   --  1(1):[???]说: 临走之前，我还有一句话重*要的话要提醒你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2840,0,1);   --  1(1):[AAA]说: 好，最后一句，你说吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2841,255,0);   --  1(1):[???]说: 在江湖上行走，最重要的就*是使自己保持在正道之上*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2842,245,1);   --  1(1):[???]说: 死老头，你还有完没完啊*……再见！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,693,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

