--function oldevent_89()
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_25(29,43,29,32);   --  25(19):场景移动29-43--29-32
    instruct_1(150,86,0);   --  1(1):[???]说: …………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(334,225,1);   --  1(1):[???]说: ＜咦？这个妞好正点啊，我*韦小宝发誓一定要娶他做老*婆＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(335,0,1);   --  1(1):[AAA]说: 韦兄，你瞎叨咕什么呢？好*像有人受伤了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(336,229,0);   --  1(1):[???]说: 冯锡范，你为何对我忽施暗*算？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(337,150,0);   --  1(1):[???]说: 我奉命拿你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(338,139,0);   --  1(1):[???]说: 陈永华，你还把我放在眼里*么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(339,229,0);   --  1(1):[???]说: 二公子何出此言？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(340,150,0);   --  1(1):[???]说: 嘿嘿，台湾就快成你姓陈的*一个人的了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(341,229,0);   --  1(1):[???]说: 不，台湾绝不是姓陈的一个*人的，也不是某些人的，台*湾是所有台湾人的台湾，是*所有中国人的台湾。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(342,139,0);   --  1(1):[???]说: 你目无主上，不敬重我，就*是不敬重父王。我瞧你所作*所为，早有不臣之心，哼，*你在中原拚命培植自己势力*，扩充天地会，哪里还把台*湾郑家放在心上。你想自立*为王，是不是？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(343,229,0);   --  1(1):[???]说: 绝无此事！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(344,139,0);   --  1(1):[???]说: 你早得到此书，却不肯交给*我，你心里还有父王没有？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(345,0,1);   --  1(1):[AAA]说: ＜有书？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(346,150,0);   --  1(1):[???]说: 二公子不用跟他多废话，看*我扁死他！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(347,229,0);   --  1(1):[???]说: 扁我？我拼了这条命，也要*倒扁，坚决倒扁！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(348,225,1);   --  1(1):[???]说: 不好，那是我师父，快救人*。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(136,4,0,0) ==false then    --  6(6):战斗[136]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_19(27,33);   --  19(13):主角移动至1B-21
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_17(-2,1,27,31,8256);   --  17(11):修改场景贴图:当前场景层1坐标1B-1F
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(349,225,1);   --  1(1):[???]说: 哼，你竟敢害我师父，获得*不耐烦了，看我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(350,86,0);   --  1(1):[???]说: 你别杀他！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(351,225,1);   --  1(1):[???]说: ＜乖乖，我老婆怎么帮他说*话，想让我当王八吗？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(352,86,0);   --  1(1):[???]说: 你别杀他，要杀就杀我吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(353,225,1);   --  1(1):[???]说: 好啊，那我就先杀你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(354,86,0);   --  1(1):[???]说: 郑公子，永别了，我们来世*再做夫妻。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(355,225,1);   --  1(1):[???]说: 你们两个我只能放一个，你*说我该放谁呢？姓郑的，你*怎么不说话？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(356,139,0);   --  1(1):[???]说: ……求求你放了我，我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(357,86,0);   --  1(1):[???]说: 郑公子！不要向他求饶！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(358,139,0);   --  1(1):[???]说: 求少侠放了我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(359,225,1);   --  1(1):[???]说: 我要是放了你，就得杀这妞*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(360,86,0);   --  1(1):[???]说: 郑公子，你是做大事的人，*还是让他杀了我吧……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,139,0);   --  1(1):[???]说: …………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(361,225,1);   --  1(1):[???]说: ……唉，没想到我老婆这么*喜欢这小白脸……算了，看*在我老婆的份上，今天就放*了你们……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(362,86,0);   --  1(1):[???]说: 谁是你老婆？我死也不会嫁*给你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(363,139,0);   --  1(1):[???]说: 谢谢几位少侠……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(364,245,1);   --  1(1):[???]说: 滚吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(365,225,1);   --  1(1):[???]说: 师父，你没事吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(366,229,0);   --  1(1):[???]说: 小宝，你来的正好。我没事*。多谢这位少侠相助。你的*事情我都听说了，虽然我没*有十四天书，但这里有半部*四十二章经，也许可以帮上*你的忙。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_43(228,54,0) ==false then    --  43(2B):是否有物品半部四十二章经是则跳转到:Label1
        instruct_2(228,1);   --  2(2):得到物品[半部四十二章经][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(367,0,1);   --  1(1):[AAA]说: 多谢总舵主。人言"平生不*识陈近南，纵是英雄也枉然*"，今日能得见总舵主一面*，真乃三生有幸啊。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(368,229,0);   --  1(1):[???]说: 江湖上朋友的谬赞，少侠客*气了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(369,225,1);   --  1(1):[???]说: 师父，我们好不容易见了面*，就一起多住几日。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(370,229,0);   --  1(1):[???]说: 小宝，师父还有要事。反清*复明的大业一日未成，为师*是不会休息的。小宝，这位*少侠，咱们后会有期。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(371,0,1);   --  1(1):[AAA]说: 总舵主慢走！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_17(-2,1,27,31,0);   --  17(11):修改场景贴图:当前场景层1坐标1B-1F
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_26(1,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(1,7,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(372,247,1);   --  1(1):[???]说: 又是半部四十二章经？我看*看……哈哈，正好可以合成*一部完整的四十二章经。不*过这本书到底有什么用呢？*没什么用的话，拿在手里也*是累赘，还不如烧了算了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(229,1);   --  2(2):得到物品[四十二章经][1]
    instruct_32(228,-1);   --  32(20):物品[半部四十二章经]+[-1]
    instruct_1(367,0,1);   --  1(1):[AAA]说: 多谢总舵主。人言"平生不*识陈近南，纵是英雄也枉然*"，今日能得见总舵主一面*，真乃三生有幸啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(368,229,0);   --  1(1):[???]说: 江湖上朋友的谬赞，少侠客*气了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(369,225,1);   --  1(1):[???]说: 师父，我们好不容易见了面*，就一起多住几日。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(370,229,0);   --  1(1):[???]说: 小宝，师父还有要事。反清*复明的大业一日未成，为师*是不会休息的。小宝，这位*少侠，咱们后会有期。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(371,0,1);   --  1(1):[AAA]说: 总舵主慢走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_17(-2,1,27,31,0);   --  17(11):修改场景贴图:当前场景层1坐标1B-1F
    instruct_3(69,11,1,0,90,0,0,8256,8256,8256,-2,-2,-2);   --  3(3):修改事件定义:场景[丽春院]:场景事件编号 [11]
    instruct_3(69,10,1,0,91,0,0,7036,7036,7036,-2,-2,-2);   --  3(3):修改事件定义:场景[丽春院]:场景事件编号 [10]
    instruct_3(69,12,1,0,92,0,0,7030,7030,7030,-2,-2,-2);   --  3(3):修改事件定义:场景[丽春院]:场景事件编号 [12]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(388,225,1);   --  1(1):[???]说: 唉，遇见两个大美女，都被*你放跑了，看来跟着你你甭*想泡到妞了，我要自己去追*！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_0();   --  0(0)::空语句(清屏)
--end

