--function oldevent_490()

    if instruct_43(177,6,0) ==false then    --  43(2B):是否有物品渔叟钓法是则跳转到:Label0
        instruct_1(1960,0,1);   --  1(1):[AAA]说: 水里好像有什么东西在游动*……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1961,0,1);   --  1(1):[AAA]说: 水里好像有什么东西在游动*，看我把它钓上来！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1962,247,1);   --  1(1):[???]说: 哈哈，收获不错。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(233,1);   --  2(2):得到物品[金娃娃][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

