--function oldevent_740()
    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_25(22,26,24,17);   --  25(19):场景移动22-26--24-17
    instruct_1(2917,200,0);   --  1(1):[???]说: 贾老二，你看旁边桌上那妞*，身材要得，脸蛋更是要得*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(24,17,18,16);   --  25(19):场景移动24-17--18-16
    instruct_1(2918,35,0);   --  1(1):[令狐冲]说: （这次青城派大举南来，有*些古怪，师父叫我们来探探*动静。小师妹，要沉住气，*假装没听见。）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2920,79,0);   --  1(1):[???]说: （好，大师哥，我听你的）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(18,16,24,17);   --  25(19):场景移动18-16--24-17
    instruct_1(2919,200,0);   --  1(1):[???]说: 余兄弟，你要是喜欢，咱就*想想办法，把这妞弄回去，*嘿嘿嘿……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,23,0,0,0,0,0,5862,5862,5862,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2921,36,0);   --  1(1):[林平之]说: 甚么东西，两个不带眼的狗*崽子，却到我们福州府来撒*野！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2922,200,0);   --  1(1):[???]说: 贾老二，你看这个小白脸眉*清目秀，要上台去唱花旦，*真勾引得人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2923,200,0);   --  1(1):[???]说: 这位兔儿爷，我越瞧你越不*像男人，准是个大姑娘乔装*改扮的。你这脸蛋儿又红又*白，给我香个面孔好不好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2924,36,0);   --  1(1):[林平之]说: 我乃福威镖局的少镖头，你*天大胆子，到太岁头上动土*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2925,200,0);   --  1(1):[???]说: 福威镖局？从来没听见过！*那是干甚么的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2926,36,0);   --  1(1):[林平之]说: 专打狗崽子的！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2927,245,1);   --  1(1):[???]说: 说的好，我来帮你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(24,17,18,16);   --  25(19):场景移动24-17--18-16
    instruct_1(2928,35,0);   --  1(1):[令狐冲]说: 小师妹，你知不知道这青城*派最厉害的招数叫什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2929,79,0);   --  1(1):[???]说: 不知道，叫什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2930,35,0);   --  1(1):[令狐冲]说: 叫“屁股向后平沙落雁式”*我这就让他们演给你瞧瞧。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(203,3,0,0) ==false then    --  6(6):战斗[203]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,26,0,0,0,0,0,7624,7624,7624,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,0,0,0,0,0,7142,7142,7142,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,24,0,0,0,0,0,7144,7144,7144,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,28,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,25,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_19(21,20);   --  19(13):主角移动至15-14
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2931,200,0);   --  1(1):[???]说: 你，你这兔儿爷，你竟敢杀*了我家少爷，咱们这梁子算*结下了，你们等着瞧吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2932,0,1);   --  1(1):[AAA]说: 看来对方来头不善，林兄弟*还是小心为是。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2933,36,0);   --  1(1):[林平之]说: 我想以我家福威镖局名头并*无大事。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2934,35,0);   --  1(1):[令狐冲]说: 这几个人都是四川青城派的*，你杀了的似乎是青城派余*观主的儿子，恐怕福威镖局*会有麻烦啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2935,0,1);   --  1(1):[AAA]说: 刚才见二位剑法不凡，不知*是那一派门下，怎样称呼？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2936,35,0);   --  1(1):[令狐冲]说: 在下华山令狐冲。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2937,79,0);   --  1(1):[???]说: 在下华山岳灵珊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2938,0,1);   --  1(1):[AAA]说: 华山派是名门大派，今日一*见果然名不虚传。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2939,35,0);   --  1(1):[令狐冲]说: 过奖过奖。林兄弟，我看这*青城派绝不会善罢甘休，你*还是回福威镖局早做准备吧*。我和师妹也要回华山禀明*家师。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2940,36,0);   --  1(1):[林平之]说: 也好，那咱们后会有期。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2941,79,0);   --  1(1):[???]说: 后会有期
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2941,0,1);   --  1(1):[AAA]说: 后会有期
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(56,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [3]
    instruct_3(56,0,1,0,744,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [0]
    instruct_37(1);   --  37(25):增加道德1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

