--function oldevent_919()
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,12,0,0,0,0,0,7156,7156,7156,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,0,0,0,7142,7142,7142,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_37(5);   --  37(25):增加道德5
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(48,36,21,22);   --  25(19):场景移动48-36--21-22
    instruct_1(3637,36,0);   --  1(1):[林平之]说: 我的剑谱早已尽数交给你爹*爹了，自己没私自留下一招*半式，你又何必苦苦的跟着*我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3638,79,0);   --  1(1):[???]说: 你老是疑心我爹爹图你的剑*谱，当真好没来由。你如此*损我爹爹，当我是甚么人了*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3639,36,0);   --  1(1):[林平之]说: 哼，令狐冲在福州抢到了剑*谱，毕竟还是拿不去，却落*入了你爹爹手中……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3640,79,0);   --  1(1):[???]说: 不，不会的！爹爹说，剑谱*给大师哥拿了去，我曾求他*还给你，他说甚么也不肯。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3641,36,0);   --  1(1):[林平之]说: 现下说与你知，也不相干。*那日在福州，那几人抢了剑*谱，却被令狐冲杀死。剑谱*自然是令狐冲得去了。可是*当他身受重伤、昏迷不醒之*际，我搜他身上，剑谱却已*不知去向。剑谱既不在令狐*冲身上，定是给你爹娘取了*去。一回华山，我每晚都躲*在你爹娘卧室之侧的悬崖上*，要从他们的谈话之中，查*知剑谱的所在。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3642,79,0);   --  1(1):[???]说: 每天晚上？你真有毅力。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3643,36,0);   --  1(1):[林平之]说: 为报大仇，不得不然。有一*天晚上，你妈妈问你爹爹你*为何要冤枉冲儿偷了我的辟*邪剑谱？说那日令狐冲受伤*昏迷，你妈妈替他止血治伤*时，曾经看到过剑谱，第二*次替他换药，那剑谱就不见*了，其时令狐冲仍然昏迷未*醒。那段时候除了你父母二*人，并无别人进房。还说你*爹爹苦心焦虑，为了保全本*派。只是那辟邪剑法练之有*损无益，劝你爹爹万万不要*修炼。你爹爹说要听你娘的*劝，找时间就设法把剑谱交*给我，再慢慢想法替令狐冲*洗刷清白。你娘说这剑谱于*人有损，不可让我见到，让*你爹爹毁去为是。你爹爹同*意把剑谱毁去，然后立刻开*窗把剑谱扔下天生崖，老天*有眼，剑谱挂在树丫上，我*捡了回来。正是我家祖传的*辟邪剑谱。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3644,79,0);   --  1(1):[???]说: 妈妈只道爹爹将剑谱掷入了*天声峡中，其实爹爹早将剑*法记熟，剑谱于他已然无用*，却让你因此而学得了剑法*，是不是？嗯，天意如此。*冥冥之中，老天爷一切早有*安排，要你由此而报你父母*的仇了。那……那……那也*很好，也好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3645,36,0);   --  1(1):[林平之]说: 你爹爹处心积虑，就是要得*到这辟邪剑谱。从他派你和*令狐冲去福州，到收我为徒*，再把你许配于我，一起去*福建，彻头彻尾都是你爹爹*的阴谋，他把一切都推倒令*狐冲身上，目的就是要得到*我林家的辟邪剑谱。嘿嘿，*君子剑，好一个君子剑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3646,79,0);   --  1(1):[???]说: 我爹爹，我爹爹，他……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3728,36,0);   --  1(1):[林平之]说: 我现在一定要找个安全的地*方躲起来，否则让你爹知道*我练了辟邪剑法，他一定会*杀了我的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(21,22,48,36);   --  25(19):场景移动21-22--48-36
    instruct_30(48,36,21,36);   --  30(1E):主角走动48-36--21-36
    instruct_30(21,36,21,23);   --  30(1E):主角走动21-36--21-23
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3729,0,1);   --  1(1):[AAA]说: 二位刚才的谈话我都听到了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3730,36,0);   --  1(1):[林平之]说: 什么？你，你，你想怎样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3731,0,1);   --  1(1):[AAA]说: 林贤弟不要紧张。既然林贤*弟怕被岳不群追杀，不妨到*小村来，我可以保护你的安*全。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3732,36,0);   --  1(1):[林平之]说: 你，你，你为什么要帮我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3733,0,1);   --  1(1):[AAA]说: 我在寻找十四天书，需要武*功高强的人帮忙。林贤弟已*练成家传的辟邪剑法，武功*之高，当世罕见，我只是想*多一个帮手而已。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3734,36,0);   --  1(1):[林平之]说: 好，既然如此，我这就去小*村。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3735,79,0);   --  1(1):[???]说: 小林子，我已经嫁给你了，*我就是你的妻子，今后你走*到哪，我就跟你到哪。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(104,54,1,0,980,0,0,7018,7018,7018,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [54]
    instruct_3(104,47,1,0,955,0,0,7154,7154,7154,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [47]
    instruct_41(36,78,1);   --  41(29):林平之得到物品辟邪剑谱1
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(70,42,1,0,173,0,0,7018,7018,7018,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [42]
    instruct_3(70,25,1,0,123,0,0,5862,5886,5862,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [25]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_37(-1);   --  37(25):增加道德-1
--end

