--function oldevent_344()
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_30(47,47,47,40);   --  30(1E):主角走动47-47--47-40
    instruct_30(47,40,45,40);   --  30(1E):主角走动47-40--45-40
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1243,247,1);   --  1(1):[???]说: 咦？想不到这大功坊的地下*还有宝藏？这次打赌赚的值*啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1244,54,0);   --  1(1):[袁承志]说: 青青的父亲曾经留给她母亲*一幅藏宝图，经过我多日寻*访，发现藏宝地点应该就是*在大功坊，所以青青才会提*出以大功坊为赌注的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1245,247,1);   --  1(1):[???]说: 哈哈，原来你们是早有预谋*啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1246,91,0);   --  1(1):[???]说: 我这叫神机妙算！*……袁大哥……*我……怎么突然这么困……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1247,244,1);   --  1(1):[???]说: 我……好像也……很困……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1248,54,0);   --  1(1):[袁承志]说: 不好，有人放毒！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(96,12,0,0,0,0,0,7060,7060,7060,-2,-2,-2);   --  3(3):修改事件定义:场景[五仙教]:场景事件编号 [12]
    instruct_3(96,9,0,0,0,0,0,7042,7042,7042,-2,-2,-2);   --  3(3):修改事件定义:场景[五仙教]:场景事件编号 [9]
    instruct_3(96,0,0,0,0,0,345,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[五仙教]:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_27(-1,6014,6024);   --  27(1B):显示动画
    instruct_1(1249,0,1);   --  1(1):[AAA]说: 头好沉……我怎么睡在这了*？……袁大哥和温姑娘呢？*……咦，这里有封信……什*么？五仙教抓走了温姑娘！*袁大哥已经赶去了，我也去*看看吧。
    instruct_0();   --  0(0)::空语句(清屏)
--end

