--function oldevent_5()

    if instruct_16(1,2,0) ==false then    --  16(10):队伍是否有[胡斐]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_37(2);   --  37(25):增加道德2
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(3,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [17]
    instruct_3(24,11,1,0,6,0,0,7012,7012,7012,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [11]
    instruct_3(24,1,1,0,6,0,0,5212,5212,5212,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [1]
    instruct_3(24,2,1,0,0,0,0,5224,524,5224,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [2]
    instruct_3(24,3,1,0,0,0,0,5224,5224,5224,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [3]
    instruct_3(24,4,1,0,0,0,0,5220,5220,5220,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [4]
    instruct_3(24,5,1,0,0,0,0,5220,5220,5220,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [5]
    instruct_3(24,6,1,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [6]
    instruct_3(24,7,1,0,0,0,0,5218,5218,5218,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(41,31,36,31);   --  30(1E):主角走动41-31--36-31
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(31,31,34,31);   --  25(19):场景移动31-31--34-31
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(46,3,0);   --  1(1):[苗人凤]说: 你们是田归农请来的吧！神*龙教何时跟田归农搭在一起*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(47,203,0);   --  1(1):[???]说: 还多亏了田兄，我们才知道*"飞狐外传"一书在你这．识*相的话就快将书交出来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(48,3,0);   --  1(1):[苗人凤]说: 田归农呢？他怎麽不敢出来*见我．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(49,72,0);   --  1(1):[田归农]说: 嘿嘿，苗兄，好久不见，别*来无恙乎？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(50,3,0);   --  1(1):[苗人凤]说: 姓田的，亏你还有脸来见我*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(51,72,0);   --  1(1):[田归农]说: 苗兄，何必这么大的火气，*伤了你我兄弟的和气。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(52,3,0);   --  1(1):[苗人凤]说: ……**她还好吗？……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(53,72,0);   --  1(1):[田归农]说: 我看你是见不到她了．这药*是从毒手药王那弄来的断肠*草粉末，药效也真够狠，现*下你双眼已瞎，我看"打遍*天下无敌手"的金面佛苗人*凤，今日要上西天了，兄弟*们，上！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(54,245,1);   --  1(1):[???]说: 苗大侠，我帮你拿贼。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(3,5,0,0) ==false then    --  6(6):战斗[3]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_3(24,11,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [11]
    instruct_3(24,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [2]
    instruct_3(24,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [3]
    instruct_3(24,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [4]
    instruct_3(24,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [5]
    instruct_3(24,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [6]
    instruct_3(24,7,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(55,3,0);   --  1(1):[苗人凤]说: 小兄弟，你尊姓大名，与我*可有渊源？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(56,0,1);   --  1(1):[AAA]说: 丈夫结交，但重义气，*只需肝胆相照，何必提名道*姓。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(57,3,0);   --  1(1):[苗人凤]说: 好，苗人凤独来独往，生平*只有两个知交，一个是辽东*大侠胡一刀，另一个便是你*这位不知姓名没见过面的小*兄弟。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(58,1,1);   --  1(1):[胡斐]说: 你说什麽。那你为何要杀死*胡大侠。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(59,3,0);   --  1(1):[苗人凤]说: 这说来话长……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(60,0,1);   --  1(1):[AAA]说: 大哥，*我们先想办法救苗大侠，*这事以後再说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(61,0,1);   --  1(1):[AAA]说: 苗大侠，既然这药是毒手药*王所配制，那我们去求毒手*药王救治，或能解得。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(62,3,0);   --  1(1):[苗人凤]说: 要求毒手药王吗？那是徒劳*往返，不用去了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(63,0,1);   --  1(1):[AAA]说: 不，天下无难事！这位毒手*药王住在那里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(64,3,0);   --  1(1):[苗人凤]说: 听说此人在洞庭湖畔隐居。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(65,0,1);   --  1(1):[AAA]说: 我这就去了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(66,0,1);   --  1(1):[AAA]说: 苗大侠，你要照顾好自己，*等我从毒手药王那求取到解*药回来帮你医治。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,9,0,0,0,0,7,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(49,2,1,0,8,0,0,5210,5210,5210,-2,-2,-2);   --  3(3):修改事件定义:场景[药王庄]:场景事件编号 [2]
    instruct_3(3,9,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [9]
    instruct_3(3,12,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [12]
    instruct_3(3,11,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [11]
    instruct_3(3,10,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [10]
    instruct_0();   --  0(0)::空语句(清屏)
--end

