--function oldevent_764()
    instruct_1(3075,208,0);   --  1(1):[???]说: 师父说我的五虎断门刀已练*到十成，威力巨大。可是我*从未和人交过手，不知道到*底是真是假。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(3076,0,1);   --  1(1):[AAA]说: 那我就来陪你练练吧。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(208,22,0,0) ==false then    --  6(6):战斗[208]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(3077,208,0);   --  1(1):[???]说: 哈哈哈，我的刀法果然厉害*，看来我将成为下一个金刀*无敌啦。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,1,0,765,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3078,208,0);   --  1(1):[???]说: 什么烂刀法，居然一点也不*管用，哼，给你吧，我不学*了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(143,1);   --  2(2):得到物品[五虎断门刀][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(-1);   --  37(25):增加道德-1
--end

