--function oldevent_556()
    instruct_26(40,13,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,15,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,14,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,26,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,31,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,32,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,37,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,38,0,0,0,0,0,6152,6152,6152,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,39,0,0,0,0,0,5132,5132,5132,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,40,0,0,0,0,0,7130,7130,7130,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,41,0,0,0,0,0,5136,5136,5136,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,42,0,0,0,0,0,7990,7990,7990,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,43,0,0,0,0,0,6298,6298,6298,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,44,0,0,0,0,0,6310,6310,6310,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,45,0,0,0,0,0,6086,6086,6086,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,46,0,0,0,0,0,6086,6086,6086,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(39,30,16,28);   --  25(19):场景移动39-30--16-28
    instruct_1(2352,207,0);   --  1(1):[???]说: 这位是天台山智光大师、这*两位是冲霄洞谭氏伉俪、这*几位是姑苏慕容公子及其亲*随，这位是……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2353,251,0);   --  1(1):[???]说: 我叫"赵钱孙李，周吴郑王"*，我没名字，这个世界上，*我只关心小娟一人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2354,252,0);   --  1(1):[???]说: 唉，师兄……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2355,253,0);   --  1(1):[???]说: 你，哼！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2356,50,0);   --  1(1):[乔峰]说: 各位同来我丐帮，不知所为*何事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2357,51,0);   --  1(1):[慕容复]说: 我们今天来，是为了武林同*道和丐帮的兄弟们着想，来*澄清一件大事。智光大师，*就请你把雁门关外乱石谷前*的大战，讲述给大家听罢。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2359,250,0);   --  1(1):[???]说: 唉，杀孽太重，杀孽太重……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2360,51,0);   --  1(1):[慕容复]说: 此事关系武林安危，关乎我*大宋命运以及丐帮的前途，*还请智光大师不要推辞。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2361,250,0);   --  1(1):[???]说: 好，老衲从前做错了事，也*不必隐瞒，照实说来便是。*那是三十年前，中原豪杰接*到讯息，说契丹国有大批武*士来偷袭少林，想将寺中秘*藏数百年的武功图谱，一举*夺去……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2362,250,0);   --  1(1):[???]说: ……最后我们把那个契丹男*婴寄养在少室山下的农家。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2363,50,0);   --  1(1):[乔峰]说: 智光大师，那……那少室山*下的农人，他，他，他姓什*么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2364,250,0);   --  1(1):[???]说: 你既已猜到，我也不必隐瞒*。那农人姓乔，名字叫做三*槐。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2365,50,0);   --  1(1):[乔峰]说: 不，不！你胡说八道，捏造*了这么一篇鬼话来诬陷我…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2367,251,0);   --  1(1):[???]说: 汉人也不是什么都好，契丹*人也不是猪狗不如。明明是*契丹人，却硬要冒充汉人。*嘿嘿，嘿嘿……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2366,51,0);   --  1(1):[慕容复]说: 谭氏伉俪，还有这位赵钱孙*，当年都曾参加乱石谷血战*，难道大家都在一起骗你不*成？乔峰，这是汪帮主的亲*笔遗书，你自己看吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2368,50,0);   --  1(1):[乔峰]说: ……这丐帮帮主，我是决计*不当了……青山不改，绿水*长流，众位好兄弟，咱们再*见了。乔某是汉人也好，是*契丹人也好，有生之年，决*不伤一条汉人的性命！告辞*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2369,104,0);   --  1(1):[???]说: ＜这乔帮主，真是英雄啊＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2370,51,0);   --  1(1):[慕容复]说: ＜这回逼走了乔峰，丐帮群*龙无首，应该比较容易控制*，日后复兴大燕，丐帮应是*个有力的帮手。不过此时不*宜太张扬＞，各位丐帮的长*老、兄弟们，我们今日此来*，是为了天下苍生，是为了*千千万万大宋的黎民百姓。*既然此事已真像大白，在下*也当告辞。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2371,253,0);   --  1(1):[???]说: 我们也走吧
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2372,251,0);   --  1(1):[???]说: 小娟……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2373,250,0);   --  1(1):[???]说: 阿弥陀佛……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,12,1,0,557,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,1,0,557,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_19(41,30);   --  19(13):主角移动至29-1E
    instruct_3(100,3,1,0,558,0,0,6226,6226,6226,-2,-2,-2);   --  3(3):修改事件定义:场景[天台山]:场景事件编号 [3]
    instruct_3(66,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[冲霄洞]:场景事件编号 [6]
    instruct_3(66,7,1,0,560,0,0,6524,6524,6524,-2,-2,-2);   --  3(3):修改事件定义:场景[冲霄洞]:场景事件编号 [7]
    instruct_3(66,0,1,0,559,0,0,5432,5432,5432,-2,-2,-2);   --  3(3):修改事件定义:场景[冲霄洞]:场景事件编号 [0]
    instruct_3(66,5,0,0,559,0,0,5436,5436,5436,-2,-2,-2);   --  3(3):修改事件定义:场景[冲霄洞]:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2374,244,1);   --  1(1):[???]说: 乔帮主是契丹人？这是真的*么？我再去找这几个证人问*问看。
    instruct_0();   --  0(0)::空语句(清屏)
--end

