--function oldevent_3()
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(1,7,0) ==false then    --  16(10):队伍是否有[胡斐]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(17,72,0);   --  1(1):[田归农]说: 他的女人是我的，宝藏也是*我的，武功也是我的，哈哈*哈……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(18,72,0);   --  1(1):[田归农]说: 你可是辽东大侠胡一刀之子*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(19,1,1);   --  1(1):[胡斐]说: 你，你是什么人？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(20,72,0);   --  1(1):[田归农]说: 你可知道你的杀父仇人是谁*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(21,1,1);   --  1(1):[胡斐]说: 前辈如果知道，还望见教。*胡某感激不尽。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(22,72,0);   --  1(1):[田归农]说: 你可知道"打遍天下无敌手*金面佛"苗人凤？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(23,1,1);   --  1(1):[胡斐]说: 苗大侠的武功人品，是在下*一直久仰的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(24,72,0);   --  1(1):[田归农]说: 嘿嘿，你父胡一刀就是死在*苗人凤剑下！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(25,1,1);   --  1(1):[胡斐]说: 什么？……你怎么知道？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(26,72,0);   --  1(1):[田归农]说: 此事乃我亲眼所见，绝无虚*假。你可以找苗人凤当面对*质。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(27,1,1);   --  1(1):[胡斐]说: 如此多谢了，我这就去找苗*人凤。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(28,72,0);   --  1(1):[田归农]说: 且慢，你可有本事战胜苗人*凤？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(29,1,1);   --  1(1):[胡斐]说: 父仇不共戴天，胡某尽力而*为。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(30,72,0);   --  1(1):[田归农]说: 这位少侠，你可是在找十四*天书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(31,0,1);   --  1(1):[AAA]说: 你怎么什么都知道？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(32,72,0);   --  1(1):[田归农]说: 哈哈，这就是我的本事。我*还可以告诉你，苗人凤身上*，就有你要的东西！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(33,0,1);   --  1(1):[AAA]说: 你告诉我们这些，你有什么*企图？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(34,72,0);   --  1(1):[田归农]说: 少侠果然是明白人。不瞒少*侠，我也要从苗人凤身上找*一幅地图。你要报父仇，你*要找天书，我们有共同的敌*人苗人凤，无奈这苗人凤武*艺太高强。我们不妨一起合*作，我有办法让苗人凤束手*就擒。怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(35,1,1);   --  1(1):[胡斐]说: 大丈夫处世当光明磊落。父*仇虽大，胡某也绝不做小人*勾当。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,180) ==true then    --  9(9):是否要求加入?否则跳转到:Label1
        instruct_37(-2);   --  37(25):增加道德-2
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(104,84,1,0,973,0,0,7012,7012,7012,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [84]
        instruct_3(3,9,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [9]
        instruct_3(3,12,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [12]
        instruct_3(3,11,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [11]
        instruct_3(3,10,1,0,638,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [10]
        instruct_1(36,0,1);   --  1(1):[AAA]说: 胡大哥，我觉得这位先生说*的有道理，只要能达到我们*的目的，用什么手段不重要*。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(37,1,1);   --  1(1):[胡斐]说: 哼！我胡某看错人了！告辞*！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_21(1);   --  21(15):[胡斐]离队
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(38,244,1);   --  1(1):[???]说: 唉，胡大哥，怎么那么心急*啊！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(39,72,0);   --  1(1):[田归农]说: 少侠，我们不必管他。要除*掉苗人凤，光靠你我二人还*不够，我们还要再找一个人*。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(40,0,0);   --  1(1):[AAA]说: 谁？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(41,72,0);   --  1(1):[田归农]说: 一个跌打医生！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(24,0,0,0,0,0,33,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [0]
        instruct_3(50,1,1,0,32,0,0,5168,5168,5168,-2,-2,-2);   --  3(3):修改事件定义:场景[閰基居]:场景事件编号 [1]

        if instruct_20(5,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_10(72);   --  10(A):加入人物[田归农]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label2

        instruct_1(12,72,0);   --  1(1):[田归农]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(70,40,1,0,159,0,0,7012,7012,7012,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [40]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(2);   --  37(25):增加道德2
    instruct_1(42,72,0);   --  1(1):[田归农]说: 少侠不妨再考虑考虑。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,4,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(24,0,0,0,0,0,5,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[苗人凤居]:场景事件编号 [0]
    instruct_3(3,9,1,0,637,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [9]
    instruct_3(3,12,1,0,637,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [12]
    instruct_3(3,11,1,0,637,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [11]
    instruct_3(3,10,1,0,637,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [10]
--end

