--function oldevent_884()

    if instruct_16(35,2,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,29,0,0,0,0,0,5952,5952,5952,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_13();   --  13(D):重新显示场景
    instruct_25(22,26,21,16);   --  25(19):场景移动22-26--21-16
    instruct_1(3503,35,0);   --  1(1):[令狐冲]说: 咦？那不是衡山派的莫大师*伯吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3504,0,1);   --  1(1):[AAA]说: 不错，我们过去看看。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,30,0,0,0,0,0,7158,7158,7158,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_19(22,17);   --  19(13):主角移动至16-11
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3505,20,0);   --  1(1):[莫大]说: 唉，有多少风流，便有多少*罪孽。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3506,35,1);   --  1(1):[令狐冲]说: 晚辈令狐冲拜见莫师伯。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3507,20,0);   --  1(1):[莫大]说: 令狐兄弟，魔教的任大小姐*对你情深一往，你可千万不*能辜负她啊。我劝你尽管去*少林将那位任大小姐救了出*来，娶她为妻便是。别人不*来喝你的喜酒，我莫大偏来*喝你三杯。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3508,35,1);   --  1(1):[令狐冲]说: 去少林救任小姐？莫师伯，*到底少林派为甚么要拘留任*小姐？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3509,20,0);   --  1(1):[莫大]说: 你是当真不知，还是明知故*问？你的内伤后来怎地却好*了？是修习了少林派的‘易*筋经’神功，是不是？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3510,35,1);   --  1(1):[令狐冲]说: 不是。少林派方丈玄慈大师*慈悲为怀，答允传授少林派*无上内功。只是小侄不愿改*投少林派，而这门少林神功*又不能传授派外之人，只好*辜负了方丈大师的一番美意*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3511,20,0);   --  1(1):[莫大]说: 少林派和你向来并无渊源，*决不能随便传人以本门的无*上神功。玄慈大师答应以‘*易筋经’相授，是因为那日*那日黑木崖任大小姐求见方*丈，说道只须方丈救了你的*性命，她便任由少林寺处置*，要杀要剐，绝不皱眉。这*位任大小姐虽然出身魔教，*但待你的至诚至情，她去到*少林，自无生还之望，但为*了救你，她……她是全不顾*己了。玄慈大师不愿就此杀*她，却也不能放她，因此将*她囚禁在少林寺后的山洞之*中。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3512,35,1);   --  1(1):[令狐冲]说: 原来如此。盈盈对我情意深*重，我这就去去闯少林，能*救得出她来，那是最好，如*救不出来盈盈，我宁愿死在*少林。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3513,20,0);   --  1(1):[莫大]说: 好，这才是有情有意的真丈*夫！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3514,0,1);   --  1(1):[AAA]说: 令狐大哥，我陪你一起去。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(28,12,1,0,885,-2,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[少林寺]:场景事件编号 [12]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

