--function oldevent_1049()
    instruct_1(3916,64,0);   --  1(1):[周伯通]说: 来来来，最近有没有学会新*武功，跟老顽童来玩两招．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3917,0,1);   --  1(1):[AAA]说: 前辈，我带你去见一个人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3918,64,0);   --  1(1):[周伯通]说: 去见谁啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3919,0,1);   --  1(1):[AAA]说: 我说出此人的名字来，*你可不许拂袖便走．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3920,64,0);   --  1(1):[周伯通]说: 世间我有两个人不见．*一位是段皇爷，一位是他的*贵妃瑛姑．*除了这二人之外，我老顽童*谁都见得．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3921,0,1);   --  1(1):[AAA]说: ＜看来只有使个激将之计＞*原来你曾输在他们手里，武*功不及，因此害怕见他们．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3922,64,0);   --  1(1):[周伯通]说: 不是，不是！老顽童行事卑*鄙下流，对不起他二人，因*此没脸和他们相见．*段皇爷甚至连皇帝也不做而*去做和尚，可见我实在对不*起他之极了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3923,0,1);   --  1(1):[AAA]说: 一灯大师之所以出家，是为*了对你不起，不是你对他不*起，难道你不知道麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3924,64,0);   --  1(1):[周伯通]说: 他有什麽对不起我的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3925,0,1);   --  1(1):[AAA]说: 只为旁人害你儿子，*他狠心见死不救．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3926,64,0);   --  1(1):[周伯通]说: 什麽我的儿子？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3927,0,1);   --  1(1):[AAA]说: 你和瑛姑生的孩子啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3928,64,0);   --  1(1):[周伯通]说: 什麽！*我有儿子！．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3929,0,1);   --  1(1):[AAA]说: 周老前辈，瑛姑如此这般思*念你，你始终不肯和他相见*，於心何忍？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3930,64,0);   --  1(1):[周伯通]说: 她在那里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3931,0,1);   --  1(1):[AAA]说: 他现正居住在黑龙潭，在铁*掌山的南边．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(21,11,1,0,1052,0,0,6154,6154,6154,-2,-2,-2);   --  3(3):修改事件定义:场景[黑龙潭]:场景事件编号 [11]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3932,0,1);   --  1(1):[AAA]说: 咦，老顽童呢？*怎麽一溜烟的就不见了，*希望是去找瑛姑了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(3);   --  37(25):增加道德3
--end

