--function oldevent_62()
    instruct_1(272,225,0);   --  1(1):[???]说: 一呀摸，二呀摸，摸到姐姐*的头发边……唉，我韦小宝*什么时候能离开这里，一定*要发大财，取一堆漂亮老婆*，开个特大的妓院，哈哈…*…
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(2,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_26(1,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(1,7,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(273,225,0);   --  1(1):[???]说: 出去玩？＜这个家伙看着好*像挺能打的，跟着他不会吃*亏……我娘现在不在这……*哈哈，就这么定了……＞，*好啊，出去找漂亮老婆，好*爽好爽。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(274,225,0);   --  1(1):[???]说: 韦小宝随队行动
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(71,20,0,0,0,0,63,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[神龙教]:场景事件编号 [20]
    instruct_3(76,12,0,0,0,0,89,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[台湾]:场景事件编号 [12]
    instruct_3(76,0,1,0,0,0,0,6292,6292,6292,-2,-2,-2);   --  3(3):修改事件定义:场景[台湾]:场景事件编号 [0]
    instruct_3(76,1,1,0,0,0,0,5956,5956,5956,-2,-2,-2);   --  3(3):修改事件定义:场景[台湾]:场景事件编号 [1]
    instruct_3(76,2,1,0,0,0,0,6306,6306,6306,-2,-2,-2);   --  3(3):修改事件定义:场景[台湾]:场景事件编号 [2]
    instruct_3(76,11,1,0,0,0,0,7030,7030,7030,-2,-2,-2);   --  3(3):修改事件定义:场景[台湾]:场景事件编号 [11]
--end

