--function oldevent_572()
    instruct_1(2492,0,1);   --  1(1):[AAA]说: 王姑娘，段公子，你们还在*这啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2493,76,0);   --  1(1):[???]说: 我……我在等我表哥……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2494,53,0);   --  1(1):[段誉]说: 我要陪着王姑娘。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2495,244,1);   --  1(1):[???]说: 王姑娘一心想着慕容公子，*可是慕容公子的心里只有复*兴大燕。段公子一心想着王*姑娘，可是王姑娘的心里却*只有慕容公子。唉……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2496,76,0);   --  1(1):[???]说: 这……我表哥他……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2497,53,0);   --  1(1):[段誉]说: 王姑娘，我会帮你劝慕容公*子，让他回心转意的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2498,76,0);   --  1(1):[???]说: 段公子，你……你对我真好*……*这位少侠说的对，我表*哥心里只有复兴大燕，根本*没有我。段公子，我以前一*直待你不好，你……还愿意*接受我吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2499,53,0);   --  1(1):[段誉]说: 愿意愿意，只要能让你开心*，我什么都愿意。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2500,76,0);   --  1(1):[???]说: 我总听你说，有个石像和我*一模一样，你能带我去看看*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2501,53,0);   --  1(1):[段誉]说: 好啊好啊，我们这就走。少*侠，多谢你了，后会有期。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,61,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
    instruct_3(-2,60,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
    instruct_3(42,6,1,0,573,0,0,6308,6308,6308,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山洞]:场景事件编号 [6]
    instruct_3(42,7,1,0,573,0,0,6296,6296,6296,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山洞]:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

