--function oldevent_518()
    instruct_1(2189,0,1);   --  1(1):[AAA]说: 他们说的"傻乎乎的公子哥"*是怎么回事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2190,90,0);   --  1(1):[???]说: 哎呀，你不说我都忘了，是*段誉段大哥，刚才还在的，*不知道跑到哪里去了。应该*就在这附近的，这位大哥，*我们一起去找他好不好？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,90) ==true then    --  9(9):是否要求加入?否则跳转到:Label0

        if instruct_20(38,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
            instruct_1(2191,247,1);   --  1(1):[???]说: 好啊，我们一起走吧
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_10(90);   --  10(A):加入人物[钟灵]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(42,11,1,0,519,0,0,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山洞]:场景事件编号 [11]
            do return; end
        end    --:Label1

        instruct_1(12,90,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(70,53,1,0,195,0,0,7038,7038,7038,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [53]
        instruct_3(42,11,1,0,519,0,0,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山洞]:场景事件编号 [11]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2192,90,0);   --  1(1):[???]说: 啊？像我这么可爱的女生要*和你同行，居然拒绝？你是*不是男人啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_0();   --  0(0)::空语句(清屏)
--end

