--function oldevent_916()
    instruct_1(3722,0,1);   --  1(1):[AAA]说: 岳先生，如今你已做了五岳*派掌门，《笑傲江湖》一书*应该让与在下了吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3723,19,0);   --  1(1):[岳不群]说: 这《笑傲江湖》乃是武林奇*书，如今属于五岳派，纵是*我曾经答应把此书给你，可*是我五岳派的其他人都不同*意，我也没有办法啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3724,245,1);   --  1(1):[???]说: 怎么？你想反悔？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3725,19,0);   --  1(1):[岳不群]说: 嘿嘿嘿……我岳某人虽然很*愿意将此书给你，可是我五*岳派中还有些人想领教一下*少侠的功夫……
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(56,4,0,0) ==false then    --  6(6):战斗[56]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(151,1);   --  2(2):得到物品[笑傲江湖][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3726,245,1);   --  1(1):[???]说: 你这个人渣！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,19,0);   --  1(1):[岳不群]说: …………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,917,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

