--function oldevent_480()
    instruct_1(1908,120,0);   --  1(1):[???]说: 峰峦如聚，波涛如怒，山河*表里潼关路，望西都，意踯*躅。伤心秦汉经行处，宫阙*万间都做了土。兴，百姓苦*！亡，百姓苦！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_60(-2,16,2800,47,0) ==false then    --  60(3C):判断场景-2事件位置16是否有贴图2800是则跳转到:Label0

        if instruct_5(0,42) ==true then    --  5(5):是否选择战斗？否则跳转到:Label1
            instruct_37(-1);   --  37(25):增加道德-1

            if instruct_6(180,4,0,0) ==false then    --  6(6):战斗[180]是则跳转到:Label2
                instruct_15(0);   --  15(F):战斗失败，死亡
                do return; end
                instruct_0();   --  0(0)::空语句(清屏)
            end    --:Label2

            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_3(-2,10,1,0,491,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
        end    --:Label1

        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(1909,0,1);   --  1(1):[AAA]说: 青风相待，白云相爱。梦不*到紫罗袍共黄金带。一茅斋*，野花开，管甚谁家兴废谁*成败？陋巷单瓢亦乐哉。贫*，气如山！达，志如山！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1907,120,0);   --  1(1):[???]说: 哈哈哈，好好，过去吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(1);   --  37(25):增加道德1
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,10,1,0,491,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

