--function oldevent_315()

    if instruct_16(9,2,0) ==false then    --  16(10):队伍是否有[张无忌]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_37(1);   --  37(25):增加道德1
    instruct_1(1111,9,1);   --  1(1):[张无忌]说: 太师父，太师父，*无忌回来看你了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1112,5,0);   --  1(1):[张三丰]说: 无忌，真的是你。好孩子，*你没有死，翠山可有後了。*是蝶谷医仙将你医好的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1113,9,1);   --  1(1):[张无忌]说: 不是的。我是有了一番奇遇*。。。。如此如此。。。。*这般这般。。。*後来修习了九阳神功，*才将我身上的寒毒化去。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1114,5,0);   --  1(1):[张三丰]说: 很好，很好，真难为你了。*现在你已经做了明教的教主*，记得要约束教众，不可为*非作歹。*记得常存侠义之心，*才是我辈中人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1115,9,1);   --  1(1):[张无忌]说: 太师父教诲，无忌谨记在心*。。。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1124,5,0);   --  1(1):[张三丰]说: 这是当年我传授你爹的一套*武功，如今就传给你吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(169,1);   --  2(2):得到物品[倚天屠龙功][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1125,9,0);   --  1(1):[张无忌]说: 多谢太师父
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1116,5,0);   --  1(1):[张三丰]说: 呵呵呵，翠山有后了，翠山*有后了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_0();   --  0(0)::空语句(清屏)
--end

