--function oldevent_596()
    instruct_1(2588,247,1);   --  1(1):[???]说: 阿紫姑娘，跟我一起出去玩*吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2589,47,0);   --  1(1):[阿紫]说: 好啊好啊，整天呆在丐帮，*闷也闷死了。铁丑，咱们去*小村。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(104,74,1,0,961,0,0,6378,6378,6378,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [74]
    instruct_3(104,66,1,0,960,0,0,6374,6374,6374,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [66]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(70,24,1,0,135,0,0,6380,6380,6380,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [24]
    instruct_3(70,23,1,0,133,0,0,6374,6374,6374,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [23]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

