--function oldevent_872()
    instruct_1(3415,0,1);   --  1(1):[AAA]说: 田兄，久违了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3416,29,0);   --  1(1):[田伯光]说: 原来是你这小子，找我有什*么事？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(3417,0,1);   --  1(1):[AAA]说: 没什么事。路过此地，随便*看看。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_28(0,40,999,86,0) ==false then    --  28(1C):判断AAA品德40-999是则跳转到:Label1

        if instruct_42(6,0) ==false then    --  42(2A):队伍中是否有女性是则跳转到:Label2
            instruct_1(3419,29,0);   --  1(1):[田伯光]说: 你的队伍里连个女人都没有*，没意思，不去。
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label2

        instruct_1(3420,29,0);   --  1(1):[田伯光]说: 你小子虽然是个孬种，但总*还不是道貌岸然的伪君子，*况且你的队伍里还有漂亮小*妞，我就跟着你吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_37(-5);   --  37(25):增加道德-5
        instruct_3(104,56,1,0,953,0,0,7230,7230,7230,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [56]

        if instruct_20(18,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label3
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_10(29);   --  10(A):加入人物[田伯光]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label3

        instruct_1(12,29,0);   --  1(1):[田伯光]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(70,26,1,0,117,0,0,5912,5924,5912,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [26]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(3418,29,0);   --  1(1):[田伯光]说: 我最恨的就是道貌岸然的伪*君子！
    instruct_0();   --  0(0)::空语句(清屏)
--end

