--function oldevent_291()
    instruct_1(790,0,1);   --  1(1):[AAA]说: 莫非这二人竟是阳顶天夫妇*？这里有封信，看看写些什*麽：
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(791,221,0);   --  1(1):[???]说: 今余神功第四层初成，*即悉成崑之事，*血气翻涌不克自制，*真力将散，行当大归。*天也命也，复何如耶？**今余命在旦夕，*有负衣教主重托，*实为本教罪人。*盼夫人持余亲笔遗书，*召聚众人，令谢逊暂摄副教*主之位，处份本教重务。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(792,244,1);   --  1(1):[???]说: 原来阳教主是在练功时，*因知悉成崑的事後，*不慎走火入魔了。*而阳教主夫人。。。。*这里有把匕首，*看来是因愧疚而自杀了。*这个羊皮卷，大概就是他*当时在练的"神功"吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(74,1);   --  2(2):得到物品[乾坤大挪移][1]
    instruct_3(-2,3,1,0,292,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,1,-2,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,0,-2,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
--end

