--function oldevent_217()

    if instruct_4(201,2,0) ==false then    --  4(4):是否使用物品[断肠草]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_37(1);   --  37(25):增加道德1
    instruct_32(201,-1);   --  32(20):物品[断肠草]+[-1]
    instruct_1(503,0,1);   --  1(1):[AAA]说: 杨兄，你快将这服下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(504,58,1);   --  1(1):[杨过]说: 这是什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(505,0,1);   --  1(1):[AAA]说: 这是生长在情花丛旁的断肠*草。**我曾听人说过，凡毒蛇出没*之处，七步之内必有解毒之*药，其他毒物，无不如此。*这是天地间万物相生相克的*至理。**这断肠草正好生长在情花树*旁，虽说此草具有剧毒，但*我反覆思量，此草以毒攻毒*正是情花的对头克星。***服这毒草自是冒极大险，但*反正已无药可救，咱们就死*马当活马医，试它一试。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(506,58,0);   --  1(1):[杨过]说: 好，我便服这断肠草试试***……啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(507,0,1);   --  1(1):[AAA]说: 杨兄，怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,1,0,0,0,0,6186,6186,6186,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(508,58,0);   --  1(1):[杨过]说: 我杨某这条命是少侠你救回*来的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(509,0,1);   --  1(1):[AAA]说: 你身上的毒质当真都解了？*还好还好，我刚真捏了把冷*汗。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(510,58,0);   --  1(1):[杨过]说: 这次真谢谢少侠的帮忙，*让杨某从鬼门关回来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(511,0,1);   --  1(1):[AAA]说: 不知杨兄今後有何打算？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(512,58,0);   --  1(1):[杨过]说: 我要去寻找我的姑姑，咱们*后会有期。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_26(19,24,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

