--function oldevent_358()
    instruct_1(1359,0,1);   --  1(1):[AAA]说: 我已经将华山派灭了，该告*诉我《碧血剑》一书的下落*了吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1360,239,0);   --  1(1):[???]说: 哈哈哈，爹爹，女儿终于替*你报了仇啦。女儿这就随你*去啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1361,245,1);   --  1(1):[???]说: 等等，《碧血剑》在哪里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1362,239,0);   --  1(1):[???]说: 你已然灭了华山众人，却还*没找到《碧血剑》？哈哈哈*哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,14,1,0,359,0,0,5436,5436,5436,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(80,14,1,0,360,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1363,0,1);   --  1(1):[AAA]说: 她是什么意思？难道《碧血*剑》在华山？……
    instruct_0();   --  0(0)::空语句(清屏)
--end

