--function oldevent_517()
    instruct_14();   --  14(E):场景变黑
    instruct_37(1);   --  37(25):增加道德1
    instruct_26(40,13,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,15,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,14,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_25(49,36,41,36);   --  25(19):场景移动49-36--41-36
    instruct_1(2175,90,0);   --  1(1):[???]说: 哎哟，你干嘛？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2176,203,0);   --  1(1):[???]说: 哼！小姑娘，劝你还是老实*点！说，刚才那个傻乎乎的*公子哥跑哪去了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2177,90,0);   --  1(1):[???]说: 我怎么知道！我还想找他呢*！哎呦，救命啊——
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2178,203,0);   --  1(1):[???]说: 嘿嘿，你喊啊，这荒郊野外*的，你喊破喉咙也没有人来*就你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2179,90,0);   --  1(1):[???]说: 破喉咙，破喉咙——
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2180,245,1);   --  1(1):[???]说: 光天化日之下，几个大男人*，欺负一个小姑娘，成何体*统！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2181,203,0);   --  1(1):[???]说: 关你屁事！快给老子滚蛋！*少他妈找麻烦！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2182,0,1);   --  1(1):[AAA]说: 麻烦？嘿嘿，我就偏爱找麻*烦，你能把我怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2183,203,0);   --  1(1):[???]说: 小子，你找死！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(190,3,0,0) ==false then    --  6(6):战斗[190]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_19(41,37);   --  19(13):主角移动至29-25
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2184,90,0);   --  1(1):[???]说: 谢谢你救了我。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2185,0,1);   --  1(1):[AAA]说: 姑娘在这里做什么？怎么招*惹到这些家伙？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2186,90,0);   --  1(1):[???]说: 我也不知道啊。那个无量剑*派在比剑，我觉得好玩，来*看看热闹。那知道神龙教来*了，两边就打起来了。我的*闪电雕不小心咬伤了他们几*个人，他们就抓着我不放。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2187,0,1);   --  1(1):[AAA]说: 闪电雕？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2188,90,0);   --  1(1):[???]说: 是啊，我养的闪电雕，好可*爱的。可是不知道跑到哪里*去了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2189,0,1);   --  1(1):[AAA]说: 他们说的"傻乎乎的公子哥"*是怎么回事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2190,90,0);   --  1(1):[???]说: 哎呀，你不说我都忘了，是*段誉段大哥，刚才还在的，*不知道跑到哪里去了。应该*就在这附近的，这位大哥，*我们一起去找他好不好？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,104) ==true then    --  9(9):是否要求加入?否则跳转到:Label1
        instruct_3(104,67,1,0,991,0,0,7252,7252,7252,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [67]

        if instruct_20(38,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
            instruct_1(2191,247,1);   --  1(1):[???]说: 好啊，我们一起走吧
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_10(90);   --  10(A):加入人物[钟灵]
            instruct_3(42,11,1,0,519,0,0,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山洞]:场景事件编号 [11]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label2

        instruct_1(12,90,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(70,53,1,0,195,0,0,7038,7038,7038,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [53]
        instruct_3(42,11,1,0,519,0,0,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山洞]:场景事件编号 [11]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(2192,90,0);   --  1(1):[???]说: 啊？像我这么可爱的女生要*和你同行，居然拒绝？你是*不是男人啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,1,0,518,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
--end

