--function oldevent_395()

    if instruct_4(198,2,0) ==false then    --  4(4):是否使用物品[赏善罚恶令]？是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_32(198,-1);   --  32(20):物品[赏善罚恶令]+[-1]
    instruct_1(1533,41,0);   --  1(1):[张三]说: 公子请往里面走，*岛主已恭候多时了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,-2,0,396,0,0,5146,5146,5146,-2,30,50);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

