--function oldevent_512()
    instruct_1(2142,0,1);   --  1(1):[AAA]说: ＜这不是西毒欧阳锋吗？怎*么在这倒立……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2143,60,0);   --  1(1):[欧阳锋]说: 乖儿子，快叫爸爸！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2144,246,1);   --  1(1):[???]说: ＜不是吧，占我便宜……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2145,60,0);   --  1(1):[欧阳锋]说: 快叫爸爸，爸爸传授高深的*武功给你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2146,0,1);   --  1(1):[AAA]说: ＜高深的武功？＞
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_11(1,0) ==false then    --  11(B):是否住宿是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_37(-1);   --  37(25):增加道德-1
    instruct_1(2147,247,1);   --  1(1):[???]说: ＜你不是我的＞*爸爸！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2148,60,0);   --  1(1):[欧阳锋]说: 哈哈哈，乖儿子，我现在就*把九阴真经传给你
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(82,1);   --  2(2):得到物品[逆运真经][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2149,60,0);   --  1(1):[欧阳锋]说: 不对，不对，我脑子有点不*清楚，我要一个人想想……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

