--function oldevent_722()

    if instruct_4(234,2,0) ==false then    --  4(4):是否使用物品[介绍信]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_32(234,-1);   --  32(20):物品[介绍信]+[-1]
    instruct_1(2891,126,0);   --  1(1):[???]说: 哦？这是南贤所书啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2893,125,0);   --  1(1):[???]说: 南贤与先师重阳真人平辈论*交，既是他来书推荐，此事*全真教不应推辞。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2892,68,0);   --  1(1):[丘处机]说: 我曾有一位好友杨铁心，家*传的一套杨家枪法如今已无*传人，我就把这套枪法传给*你吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(186,1);   --  2(2):得到物品[杨家枪][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2894,0,1);   --  1(1):[AAA]说: 多谢诸位道长。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2895,128,0);   --  1(1):[???]说: 门口的弟子也是初学武功，*你可以和他切磋切磋。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,723,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(101,1,1,0,738,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[黎山洞]:场景事件编号 [1]
    instruct_3(36,4,1,0,730,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[青城派]:场景事件编号 [4]
    instruct_3(28,12,1,0,702,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[少林寺]:场景事件编号 [12]
    instruct_3(19,0,1,0,723,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[重阳宫]:场景事件编号 [0]
    instruct_3(70,3,1,0,692,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [3]
    instruct_39(102);   --  39(27):打开场景老祖居
    instruct_39(100);   --  39(27):打开场景天台山
    instruct_39(98);   --  39(27):打开场景明霞岛
    instruct_39(97);   --  39(27):打开场景紫烟岛
    instruct_39(96);   --  39(27):打开场景五仙教
    instruct_39(95);   --  39(27):打开场景大功坊
    instruct_39(94);   --  39(27):打开场景长乐帮
    instruct_39(99);   --  39(27):打开场景无量山
    instruct_39(92);   --  39(27):打开场景朱府
    instruct_39(83);   --  39(27):打开场景大功坊地窖
    instruct_39(82);   --  39(27):打开场景梅庄地牢
    instruct_39(81);   --  39(27):打开场景思过崖
    instruct_39(80);   --  39(27):打开场景华山后山
    instruct_39(79);   --  39(27):打开场景山洞
    instruct_39(78);   --  39(27):打开场景浡泥岛
    instruct_39(77);   --  39(27):打开场景万鳄岛
    instruct_39(76);   --  39(27):打开场景台湾
    instruct_39(75);   --  39(27):打开场景桃花岛
    instruct_39(74);   --  39(27):打开场景侠客岛
    instruct_39(73);   --  39(27):打开场景灵蛇岛
    instruct_39(71);   --  39(27):打开场景神龙教
    instruct_39(69);   --  39(27):打开场景丽春院
    instruct_39(68);   --  39(27):打开场景崑仑派
    instruct_39(66);   --  39(27):打开场景冲霄洞
    instruct_39(65);   --  39(27):打开场景山洞
    instruct_39(64);   --  39(27):打开场景田伯光居
    instruct_39(63);   --  39(27):打开场景天宁寺
    instruct_39(62);   --  39(27):打开场景破庙
    instruct_39(61);   --  39(27):打开场景高昇客栈
    instruct_39(60);   --  39(27):打开场景龙门客栈
    instruct_39(59);   --  39(27):打开场景金龙帮
    instruct_39(58);   --  39(27):打开场景衡山派
    instruct_39(57);   --  39(27):打开场景华山派
    instruct_39(56);   --  39(27):打开场景福威镖局
    instruct_39(55);   --  39(27):打开场景梅庄
    instruct_39(54);   --  39(27):打开场景聚贤庄
    instruct_39(53);   --  39(27):打开场景擂鼓山
    instruct_39(52);   --  39(27):打开场景燕子坞
    instruct_39(51);   --  39(27):打开场景丐帮
    instruct_39(50);   --  39(27):打开场景閰基居
    instruct_39(49);   --  39(27):打开场景药王庄
    instruct_39(48);   --  39(27):打开场景铁掌山
    instruct_39(47);   --  39(27):打开场景一灯居
    instruct_39(46);   --  39(27):打开场景金蛇山洞
    instruct_39(45);   --  39(27):打开场景程瑛居
    instruct_39(44);   --  39(27):打开场景蝴蝶谷
    instruct_39(43);   --  39(27):打开场景武当派
    instruct_39(42);   --  39(27):打开场景无量山洞
    instruct_39(41);   --  39(27):打开场景山洞
    instruct_39(40);   --  39(27):打开场景洛阳城
    instruct_39(39);   --  39(27):打开场景凌霄城
    instruct_39(38);   --  39(27):打开场景恒山山麓
    instruct_39(37);   --  39(27):打开场景五毒教
    instruct_39(35);   --  39(27):打开场景星宿海
    instruct_39(34);   --  39(27):打开场景崆峒派
    instruct_39(33);   --  39(27):打开场景峨嵋派
    instruct_39(32);   --  39(27):打开场景牛家村
    instruct_39(31);   --  39(27):打开场景恒山派
    instruct_39(30);   --  39(27):打开场景平一指居
    instruct_39(29);   --  39(27):打开场景泰山派
    instruct_39(27);   --  39(27):打开场景嵩山派
    instruct_39(26);   --  39(27):打开场景黑木崖
    instruct_39(24);   --  39(27):打开场景苗人凤居
    instruct_39(23);   --  39(27):打开场景洪七公居
    instruct_39(22);   --  39(27):打开场景绝情谷
    instruct_39(21);   --  39(27):打开场景黑龙潭
    instruct_39(20);   --  39(27):打开场景百花谷
    instruct_39(18);   --  39(27):打开场景古墓
    instruct_39(17);   --  39(27):打开场景回族部落
    instruct_39(16);   --  39(27):打开场景天龙寺
    instruct_39(13);   --  39(27):打开场景明教地道
    instruct_39(12);   --  39(27):打开场景灵鹫宫
    instruct_39(11);   --  39(27):打开场景光明顶
    instruct_39(9);   --  39(27):打开场景成崑居
    instruct_39(8);   --  39(27):打开场景死囚牢
    instruct_39(7);   --  39(27):打开场景山洞
    instruct_39(6);   --  39(27):打开场景蒙古包
    instruct_39(3);   --  39(27):打开场景有间客栈
    instruct_39(2);   --  39(27):打开场景雪山
    instruct_39(1);   --  39(27):打开场景河洛客栈
    instruct_39(0);   --  39(27):打开场景胡斐居
--end

