--function oldevent_256()
    instruct_37(1);   --  37(25):增加道德1
    instruct_1(747,0,1);   --  1(1):[AAA]说: 张兄弟，这朱长龄父女不是*好人，他们根本不认识你父*亲，他们骗你，目的就是为*了屠龙刀。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(748,9,0);   --  1(1):[张无忌]说: 啊？这是真的么？姐姐她…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,8,0,0,0,0,0,5752,5752,5752,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,0,0,0,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(749,165,0);   --  1(1):[???]说: 无忌，不要听他胡说八道。*你到底是什么人？挑拨我们*之间的关系！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(750,245,1);   --  1(1):[???]说: 哼，不知道是谁在胡说八道*！你们刚才在那间屋子里说*的话，我全都听见了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(751,165,0);   --  1(1):[???]说: 好小子，留你不得！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(752,9,0);   --  1(1):[张无忌]说: 啊？难道这是真的？你们…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(753,0,1);   --  1(1):[AAA]说: 张兄弟，你快跑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(732,165,0);   --  1(1):[???]说: 快追！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,5,0,0,0,0,0,5752,5752,5752,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,0,0,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_19(44,19);   --  19(13):主角移动至2C-13
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_25(44,17,44,17);   --  25(19):场景移动44-17--44-17
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(754,165,0);   --  1(1):[???]说: 无忌，我们一直待你很好，*你姐姐也很喜欢你，快过来*，那边危险……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(755,81,0);   --  1(1):[???]说: 好弟弟，快过来，姐姐疼你*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(756,9,0);   --  1(1):[张无忌]说: 你、你，你骗我？不，不…*…啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(757,0,1);   --  1(1):[AAA]说: 悬崖！危险！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(758,165,0);   --  1(1):[???]说: 我苦心经营这么久，居然被*你小子破坏了，拿命来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(759,245,1);   --  1(1):[???]说: 哼，你这种人渣！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(145,4,0,0) ==false then    --  6(6):战斗[145]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(68,3,1,0,257,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [3]
    instruct_3(68,13,1,0,257,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [13]
    instruct_3(11,106,0,0,0,0,259,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [106]
    instruct_3(11,107,0,0,0,0,259,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [107]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(760,244,1);   --  1(1):[???]说: 唉，无忌从这悬崖上摔下去*，凶多吉少啊。我去找找吧*。好像昆仑派就在这附近，*不妨去打听打听。
    instruct_0();   --  0(0)::空语句(清屏)
--end

