--function oldevent_428()
    instruct_37(-5);   --  37(25):增加道德-5
    instruct_26(61,19,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(1644,39,0);   --  1(1):[龙岛主]说: 太玄神功已被石兄弟破解，*此处没有来的必要了，少侠*请回吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1645,0,1);   --  1(1):[AAA]说: 什么是太玄神功我不知道。*我来此只是想问一下，这里*有没有十四天书的下落。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1646,40,0);   --  1(1):[木岛主]说: 有！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1647,0,1);   --  1(1):[AAA]说: 哦？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1648,39,0);   --  1(1):[龙岛主]说: 《侠客行》一书，就在侠客*岛！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1649,0,1);   --  1(1):[AAA]说: 那，能不能把这本书送给我*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1650,40,0);   --  1(1):[木岛主]说: 不可！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1651,39,0);   --  1(1):[龙岛主]说: 此书对侠客岛意义重大，只*要我兄弟二人还在，就绝不*允许别人拿走。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1652,0,1);   --  1(1):[AAA]说: 哦，这么说只要灭了你们俩*就行了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1653,38,0);   --  1(1):[石破天]说: 岛主，我来帮你们吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_47(38,50);   --  47(2F):石破天增加攻击力50
    instruct_46(38,1000);   --  46(2E):石破天增加内力1000
    instruct_35(38,1,102,900);   --  35(23):设置石破天武功1:太玄神功攻击力900

    if instruct_6(170,3,0,0) ==false then    --  6(6):战斗[170]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(154,1);   --  2(2):得到物品[侠客行][1]
    instruct_0();   --  0(0)::空语句(清屏)
--end

