--function oldevent_347()
    instruct_1(1308,247,1);   --  1(1):[???]说: 袁公子，真没想到在这遇见*你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1309,54,0);   --  1(1):[袁承志]说: 原来是你啊，我正要去找你*呢。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1310,0,1);   --  1(1):[AAA]说: 找我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1311,54,0);   --  1(1):[袁承志]说: 是啊，我这些年到处游历，*无意中发现了一本奇书《碧*血剑》，我想可能就是你要*寻找的天书之一吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1312,0,1);   --  1(1):[AAA]说: 太好了，这正是我要找的书*！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,75,999,0,103) ==true then    --  28(1C):判断AAA品德75-999否则跳转到:Label0
        instruct_37(1);   --  37(25):增加道德1
        instruct_1(1313,54,0);   --  1(1):[袁承志]说: 既然如此，这本书就送给你*吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1314,247,1);   --  1(1):[???]说: 哈哈，太好了，多谢袁公子！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(156,1);   --  2(2):得到物品[碧血剑][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1315,54,0);   --  1(1):[袁承志]说: 看到你高兴的样子，我的心*也再度活跃起来。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1316,0,1);   --  1(1):[AAA]说: 那袁公子何不与我一同闯荡*江湖？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(104,75,1,0,966,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [75]

        if instruct_20(24,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
            instruct_1(1317,54,0);   --  1(1):[袁承志]说: 好，愿陪少侠走一遭！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_10(54);   --  10(A):加入人物[袁承志]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_1(12,54,0);   --  1(1):[袁承志]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(70,18,1,0,145,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [18]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1318,54,0);   --  1(1):[袁承志]说: 不过少侠近来在江湖上似乎*做了不少不道德的事情啊…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,348,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

