--function oldevent_398()
    instruct_1(1535,39,0);   --  1(1):[龙岛主]说: 在下和木兄弟僻处荒岛，今*日得见高贤，大感荣宠．只*是荒岛之上，诸物简陋，款*待未周，还请见谅。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1536,40,1);   --  1(1):[木岛主]说: 少侠远道而来，请饮一碗腊*八粥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(21,1);   --  2(2):得到物品[腊八粥][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1537,0,1);   --  1(1):[AAA]说: 在下心中有个疑问，*想请教前辈？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1538,40,0);   --  1(1):[木岛主]说: 但说无妨。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1539,0,1);   --  1(1):[AAA]说: 不知两位岛主为何花下偌大*心机，将各大掌门召来，并*将之杀害。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1540,39,0);   --  1(1):[龙岛主]说: 公子此言差矣！*道路传言，焉能尽信。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1541,0,1);   --  1(1):[AAA]说: 依岛主之言，*这些武林高手，一个都没有*死？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1542,40,0);   --  1(1):[木岛主]说: 凡人皆有寿数天年，*大限既届，若非大罗金仙，*焉得不死？*侠客岛并无杀害任何一人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1543,0,1);   --  1(1):[AAA]说: 那这些人为何都消失了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1544,39,0);   --  1(1):[龙岛主]说: 此事且听我们慢慢道来。***大约三十年前，我和木兄弟*订交，意气相投，本想联手*江湖，在武林中赏善罚恶，*好好做一番事业。***不意甫出江湖，便发现了一*张地图。从那图旁所注的小*字中细加参详，得悉图中所*绘的无名荒岛之上，藏有一*份惊天动地的武功秘诀。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1545,0,1);   --  1(1):[AAA]说: 那座无名荒岛就是这侠客岛*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1546,39,0);   --  1(1):[龙岛主]说: 公子说的不错。*地图上这座无名荒岛，*便是眼前所在之侠客岛了。*我们依着图中所示，在岛上*寻找了十八天，终於找到了*武功秘诀的所在。*原来那是一首古诗的图解，*含义极是深奥繁复。我二人*大喜之下，即按图解修习。*但我俩修习数月後，忽然对*这图解中所示武功产生了歧*见。*我说该当如此练，木兄却说*我想法错了，须得那样练。*也许我二人资质太差，而图*解中所示的功夫又太深奥，*以至专研了几个月，仍是疑*难不解。*後来我和木兄弟详行计议，*看来若要通解全图，非集思*广义不可。*常言道的好：三个臭皮匠，*抵个诸葛亮。咱们何不广邀*天下奇材异能之士同来岛上*各竭心思，一齐参研。***恰好其时岛上的"断肠蚀骨*腐心草"开花，此草若再配*以其他佐使之药熬成热粥，*服後於我辈练武之士大有裨*益，於是我二人派出使者，*邀请当世名门大派掌门人，*各教教主，各帮帮主，来到*敝岛喝碗腊八粥。喝过粥後*再请他们去参研图解。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1547,0,1);   --  1(1):[AAA]说: 如此说来，你们邀人来喝腊*八粥，纯是一番好意了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1548,40,0);   --  1(1):[木岛主]说: 是的。而且我们并无禁止任*何人离去，而是每位武林之*士皆沉迷於此图解的专研。*但可惜的是，到如今大家还*是没有完全领悟出此古诗图*解。*唉！我们虽找了许多饱读诗*书的贤士来此，但也无法解*开这古诗之谜。*现在就请少侠入洞内参研，*或许天从因缘，破解此诗的*福份就落在少侠身上。*若少侠想离去，也可自行离*去。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,2,-2,0,399,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,0,400,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,0,-2,0,401,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_26(-2,4,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(-2,5,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(-2,6,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

