--function oldevent_8()
    instruct_1(67,0,1);   --  1(1):[AAA]说: 这位姑娘，请问这里是药王*庄吗？*＜莫非她就是毒手药王？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(72,2,0);   --  1(1):[程灵素]说: 你到药王庄来所为何事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(68,0,1);   --  1(1):[AAA]说: 金面佛苗大侠中毒受伤，所*用毒药，乃奸人自前辈处盗*来，望前辈慈悲赐予解药。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(69,2,0);   --  1(1):[程灵素]说: 哼！姜师兄又随意将毒药给*予外人，江湖上的人又将这*笔帐记在师父头上了。*这次又是中了什麽毒？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(70,246,1);   --  1(1):[???]说: 原来毒手药王是你师父，害*我前辈长前辈短的乱叫，你*也不怕折寿吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(71,2,0);   --  1(1):[程灵素]说: 我又没叫你叫，是你自己爱*叫的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(73,0,1);   --  1(1):[AAA]说: 还请姑娘请药王前辈出来，*在下想向他求取断肠草的解*药。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(74,2,0);   --  1(1):[程灵素]说: 我师父已经过世了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(75,0,1);   --  1(1):[AAA]说: 那这该如何是好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(76,2,0);   --  1(1):[程灵素]说: 这断肠草的毒并不太难解。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(77,0,1);   --  1(1):[AAA]说: 原来姑娘已得到药王先生的*真传，还请姑娘惠赐解药。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(78,2,0);   --  1(1):[程灵素]说: 给你解药也是可以，只要你*帮我办一件事。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(79,0,1);   --  1(1):[AAA]说: 什麽事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(80,2,0);   --  1(1):[程灵素]说: 你功夫好不好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(81,0,1);   --  1(1):[AAA]说: 自然不差。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(82,2,0);   --  1(1):[程灵素]说: 口气倒是很大。*好，那我要你帮我找回一样*东西。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(83,0,1);   --  1(1):[AAA]说: 什麽东西？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(84,2,0);   --  1(1):[程灵素]说: 七心海棠。***这东西自从被我姜师兄盗出*去後，现在不知流落何方。**若不赶快找回来的话，不知*又有多少笔烂帐要记在我药*王庄的头上。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(85,0,1);   --  1(1):[AAA]说: 那我要到那里去找？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(86,2,0);   --  1(1):[程灵素]说: 我如果知道还要你去找吗？*不过你可以多留意一些滥施*毒药，迷药害人的家伙。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(87,0,1);   --  1(1):[AAA]说: 尚不知姑娘芳名？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(88,2,0);   --  1(1):[程灵素]说: 程灵素。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(89,0,1);   --  1(1):[AAA]说: 那，灵姑娘，告辞了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,0,9,11,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(50,0,0,0,0,0,10,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[閰基居]:场景事件编号 [0]
--end

