--function oldevent_890()
    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,83,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
    instruct_3(-2,84,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [84]
    instruct_3(-2,85,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [85]
    instruct_13();   --  13(D):重新显示场景
    instruct_30(28,28,15,28);   --  30(1E):主角走动28-28--15-28
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3534,0,1);   --  1(1):[AAA]说: 你就是东方不败？*＜怎麽看起来像个娘们？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3535,27,0);   --  1(1):[东方不败]说: 啊！你便是到梅庄救走任我*行的那小子．我早想见你一*见，看看是怎样的一位俊俏　*郎君．***哼，依我看也是平平无奇，*比起我那莲弟来，可差的远*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3536,0,1);   --  1(1):[AAA]说: 任教主、向大哥，你们怎么*样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3537,26,0);   --  1(1):[任我行]说: 还好，死不了。这东方不败*已经练成葵花宝典上的武功*，你们可千万小心。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3538,27,0);   --  1(1):[东方不败]说: 任教主，这部《葵花宝典》*是你传给我的．我一直念着*你的好处．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3539,26,0);   --  1(1):[任我行]说: 是吗？*因此你将我关在西湖湖底，*教我不见天日．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3540,27,0);   --  1(1):[东方不败]说: 我没杀你，是不是？***只须我叫江南四友不送水给*你喝，你能捱的了十天半月*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3541,26,0);   --  1(1):[任我行]说: 这样说来，你待我还算不错*了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3542,27,0);   --  1(1):[东方不败]说: 正是．我让你在杭州西湖颐*养天年．*常言道，上有天堂，下有苏*杭．西湖风景，那是天下有*名的了，孤山梅庄，更是西*湖景色绝佳之处．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3543,26,0);   --  1(1):[任我行]说: 原来你让我在西湖湖底的黑*牢中颐养天年．*那可要多谢你了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3544,27,0);   --  1(1):[东方不败]说: 任教主，你待我的种种好处*我永远记得．*你破格提拔，连年升我职，*甚至连本教至宝的”葵花宝*典”也传给了我．此恩此德*东方不败永不敢忘．*初时我一心只想做日月神教*教主，想什麽千秋万载，一*统江湖，於是处心积虑的谋*你的位，翦除你的羽翼．*我初当教主，那可意气风发*了，说什麽文成武德，中兴*圣教，当真是不要脸的胡吹*法螺．**直到後来修习”葵花宝典”*才慢慢悟到了人生妙谛．**其後勤修内功，数年之後，*终於明白了天人化生，万物*滋长的要道．*如今，我最羡慕的就是那些*青春年少的娇媚女子，如果*能易地而处，别说日月神教*的教主，就算是皇帝老子，*我也不做．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3545,0,1);   --  1(1):[AAA]说: 你这男扮女装的老旦，*真令人恶心．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3546,27,0);   --  1(1):[东方不败]说: 大胆！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(54,4,0,0) ==false then    --  6(6):战斗[54]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,0,1,0,895,0,0,5910,5910,5910,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,1,0,895,0,0,5908,5908,5908,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,94,1,0,896,0,0,7218,7218,7218,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [94]
    instruct_3(-2,86,0,0,0,0,0,7966,7966,7966,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [86]
    instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,95,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [95]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3547,26,0);   --  1(1):[任我行]说: 东方不败，今日终於．．．*终於教你落在我手里．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3548,27,0);   --  1(1):[东方不败]说: 任教主，终究是．．是．．*终究是．．是我输了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3549,26,0);   --  1(1):[任我行]说: 哈！哈！*你这大号，可得改一改罢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3550,27,0);   --  1(1):[东方不败]说: 倘若单打独斗，*你们是不能打败我的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3551,26,0);   --  1(1):[任我行]说: 不错，你武功比我高，*我很是佩服．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3552,27,0);   --  1(1):[东方不败]说: 你能这麽说，*足见男子汉大丈夫气概．**唉，冤孽，冤孽，我练了那*”葵花宝典”，照着宝典上*的秘方，自宫练气，炼丹服*药，渐渐的胡子没有了，说*话声音变了，性子也变了．**我从此不爱女子，把七个小*妾都杀了，却．．．却把全*副心意放在莲弟身上．*倘若我生为女儿身，那就好*了．*任教主，你快把我杀了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3553,26,0);   --  1(1):[任我行]说: 我现在不想杀你了，*我也找个地方安养你好了．**来人啊，把他带下去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3554,27,0);   --  1(1):[东方不败]说: 你好狠毒！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,86,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [86]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3555,33,0);   --  1(1):[黑白子]说: 恭喜教主，今日诛却大逆．*从此我教在教主庇荫之下，*扬威四海．*教主千秋万载，一统江湖．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3556,26,0);   --  1(1):[任我行]说:  胡说八道！什麽千秋万载*？哈！哈！哈！《葵花宝典*》啊《葵花宝典》，你终于*又回到我手里了，可惜，这*并不是常人可以练的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3557,0,1);   --  1(1):[AAA]说: 这话怎讲？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3558,26,0);   --  1(1):[任我行]说: 这宝典的第一页就注明着，*”欲练神功，引刀自宫”，*老夫可不会没了脑子，去干*这等傻事．*哈哈，哈哈．．．．**可是宝典上所载的武功实在*厉害，任何学武之人，一见*之後却不能不动心．*东方不败，饶你奸诈似鬼，*也猜不透老夫传你”葵花宝*典”的用意．*你野心勃勃，意存拔扈，*难道老夫瞧不出来吗？*哈哈，哈哈！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3559,0,1);   --  1(1):[AAA]说: ＜原来当初任教主以”葵花*  宝典”传他，当初便没怀*  善意．＞*＜两人尔虞我诈各怀心机＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3560,0,2);   --  1(1):[AAA]说: 任我行将那《葵花宝典》放*在双掌中一搓，功力到处，*原已十分陈旧的册页登时化*为碎片。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3561,0,1);   --  1(1):[AAA]说: 这种害人东西，毁了最好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3562,26,0);   --  1(1):[任我行]说: 小兄弟，这一役诛奸复位，*你实占首功．不如加入我日*月神教，我可以给你个副教*主做做，待我百年之后，这*教主的位置就是你的，如何*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3563,0,1);   --  1(1):[AAA]说: ＜区区一个教主，我很希罕*吗？＞任教主的好意，在下*心领了。我还要去寻找十四*天书，恕不能从命。告辞了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,35,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,16,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(57,1,1,0,898,0,0,5696,5696,5696,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [1]
    instruct_3(57,0,1,0,0,0,0,5694,5694,5694,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [0]
    instruct_3(57,32,1,0,900,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [32]
--end

