--function oldevent_559()
    instruct_1(2377,0,1);   --  1(1):[AAA]说: 啊……谭公谭婆竟然被人打*死了？难道……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(40,13,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,15,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,14,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,0,1,0,562,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,5,1,0,562,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_26(40,7,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

