--function oldevent_697()

    if instruct_4(174,2,0) ==false then    --  4(4):是否使用物品[银两]？是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0


    if instruct_31(5,5,0) ==false then    --  31(1F):判断银子是否够5是则跳转到:Label1
        instruct_1(2848,256,0);   --  1(1):[???]说: 五两银子，一文不能少。
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_32(174,-5);   --  32(20):物品[银两]+[-5]
    instruct_1(2849,246,1);   --  1(1):[???]说: 还你还你！不就五两银子嘛*，整天唠叨个没完！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2850,256,0);   --  1(1):[???]说: 恩，很好。鉴于你如此诚恳*的还钱态度，我就再送你一*件宝物。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2851,247,1);   --  1(1):[???]说: 宝物？什么宝物？……最好*是十四天书，这样我就不用*找了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2852,256,0);   --  1(1):[???]说: 拿着。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(195,1);   --  2(2):得到物品[铁铲][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2853,246,1);   --  1(1):[???]说: 一把铲子？？*这算什么宝物啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2854,256,0);   --  1(1):[???]说: 这不是一把普通的铲子，它*有着非凡的来历。你知道盘*古开天地的故事吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2855,244,1);   --  1(1):[???]说: 你不要告诉我盘古是用这把*铲子开天地的……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2856,256,0);   --  1(1):[???]说: 其实，盘古开天地的故事与*这把铲子毫无关系……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2857,245,1);   --  1(1):[???]说: 那你说它干嘛！！！*快说正经的，这把铲子是哪*来的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2858,256,0);   --  1(1):[???]说: 其实这是小小猪留给你的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2859,0,1);   --  1(1):[AAA]说: 你不是在耍我吧？他留给我*一把铲子干啥用？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2860,256,0);   --  1(1):[???]说: 我也不是十分清楚。好像小*小猪说让你到什么西部农村*去，教那些上不起武馆的穷*孩子练武。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2861,0,1);   --  1(1):[AAA]说: 有什么报酬？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2862,256,0);   --  1(1):[???]说: 好像……什么也没有……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2863,0,1);   --  1(1):[AAA]说: 没报酬？谁愿意干呀！那些*孩子上不起武馆，这是整个*江湖的问题，我哪管得了。*不过这个铲子好像挺有用的*，我先收着了。你还有什么*要嘱咐的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2864,256,0);   --  1(1):[???]说: 还有一句重要的话——*你还欠我五两银子没换。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2865,245,1);   --  1(1):[???]说: 已经还完了！！！*你这是什么记性啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2866,256,0);   --  1(1):[???]说: 哦，对不起，说习惯了。最*后一句应该是——一定要不*惜任何代价拿到十四天书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2867,244,1);   --  1(1):[???]说: 还是一句废话……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,698,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

