--function oldevent_804()
    instruct_1(3260,0,1);   --  1(1):[AAA]说: 您就是不喜欢阳光，甘愿呆*在地下的那位前辈高人吧？*晚辈这厢有礼了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3261,26,0);   --  1(1):[任我行]说: 不喜欢阳光？哈哈哈，这是*天大的笑话！你以为老子是*自愿呆在在西湖牢底的吗？*小子，你是谁？怎么进来的*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3262,0,1);   --  1(1):[AAA]说: 梅庄的四位庄主想要在下的*几样东西，但是却没本事打*赢在下，所以就让在下来这*地洞里向老前辈讨教。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3263,26,0);   --  1(1):[任我行]说: 几样东西？一定是琴棋书画*之类的狗屁玩意，这四个家*伙就喜欢附庸风雅。你能把*他们打败，看来功夫还可以*，有资格跟老子过几招。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3264,0,1);   --  1(1):[AAA]说: 其实晚辈此次到梅庄来，并*非是为了与前辈比武较量，*是向问天向大哥说……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3265,26,0);   --  1(1):[任我行]说: 向问天？是他叫你来的？*＜向问天一向对我忠心耿耿，*他叫此人来，一定是要想办*法救我出去的。＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3266,0,1);   --  1(1):[AAA]说: 是的。这位令狐大哥受了重*伤，内力全无，向大哥说老*前辈有办法可以医治。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3267,26,0);   --  1(1):[任我行]说: 哦？让我看看……恩，你体*内有数个异种真气乱窜……*恩，我的确有一种神功可治*此伤……你叫什么名字？是*哪个门派的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3268,35,1);   --  1(1):[令狐冲]说: 晚辈令狐冲，是华山门下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3269,26,0);   --  1(1):[任我行]说: 华山派的掌门还是岳不群吧*？这个人是个道貌岸然的伪*君子，不值一提。不过华山*派有一位风清扬风老剑客，*剑术精湛，我一向是很佩服*的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3270,35,1);   --  1(1):[令狐冲]说: 晚辈有幸，曾得风老前辈传*授剑术。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3271,26,0);   --  1(1):[任我行]说: 你是风清扬得传人？哈哈，*好，好，我这吸星大法本不*愿传给岳不群得徒弟，既然*你是风清扬得传人，老夫就*没什么顾忌啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(65,1);   --  2(2):得到物品[吸星大法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3272,26,0);   --  1(1):[任我行]说: 小兄弟，梅庄那四个老家伙*还在外面看着呢，我们不管*真假总要比试比试。进招吧*！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(211,1,0,0) ==false then    --  6(6):战斗[211]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3273,26,0);   --  1(1):[任我行]说: 小兄弟，你的功夫的确不错*，再来试试老夫这套剑法…*…哈哈哈哈哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3274,0,1);   --  1(1):[AAA]说: 啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(-1,5974,5992);   --  27(1B):显示动画
    instruct_14();   --  14(E):场景变黑
    instruct_32(212,-1);   --  32(20):物品[广陵散琴曲]+[-1]
    instruct_32(214,-1);   --  32(20):物品[张旭率意帖]+[-1]
    instruct_32(213,-1);   --  32(20):物品[刘仲甫呕血棋谱]+[-1]
    instruct_32(215,-1);   --  32(20):物品[溪山行旅图]+[-1]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(55,23,0,0,0,0,0,6074,6074,6074,-2,-2,-2);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [23]
    instruct_3(55,22,0,0,0,0,0,6062,6062,6062,-2,-2,-2);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [22]
    instruct_3(55,21,0,0,0,0,0,6050,6050,6050,-2,-2,-2);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [21]
    instruct_3(55,20,0,0,0,0,0,6066,6066,6066,-2,-2,-2);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [20]
    instruct_3(55,24,0,0,0,0,805,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [24]
    instruct_3(55,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [25]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_27(-1,6010,6024);   --  27(1B):显示动画
    instruct_1(3275,0,1);   --  1(1):[AAA]说: 奇怪，刚才那位老前辈一声*吼，我就晕过去了。他的功*力真是深不可测啊。令狐大*哥，你怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3276,35,1);   --  1(1):[令狐冲]说: 还好，还好，不知道这个老*前辈是谁，怎么不见了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3277,0,1);   --  1(1):[AAA]说: 他传给你的吸星大法，我看*像是真的，你以后练练试试*，也许你的伤就能治好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3278,35,1);   --  1(1):[令狐冲]说: 恩，我想向大哥应该不会骗*我们。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3279,0,1);   --  1(1):[AAA]说: 不过向大哥叫我们来这里似*乎另有目的，我也说不清楚*，感觉怪怪的，我们先出去*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3280,35,1);   --  1(1):[令狐冲]说: 好的。
    instruct_0();   --  0(0)::空语句(清屏)
--end

