--function oldevent_300()
    instruct_14();   --  14(E):场景变黑
    instruct_37(-9);   --  37(25):增加道德-9
    instruct_26(40,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,12,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_39(4);   --  39(27):打开场景崑仑仙境
    instruct_13();   --  13(D):重新显示场景
    instruct_30(46,28,39,28);   --  30(1E):主角走动46-28--39-28
    instruct_1(1018,8,0);   --  1(1):[唐文亮]说: 明教余孽，受死吧
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(152,3,0,0) ==false then    --  6(6):战斗[152]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(89,1);   --  2(2):得到物品[七伤拳谱][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,28,0,0,0,0,0,5962,5962,5962,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,29,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,39,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,40,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1019,109,0);   --  1(1):[???]说: 崆峒派莫要惊惶，华山派得*到信息，前来增援
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1020,13,0);   --  1(1):[谢逊]说: 来得好，省得我们到处跑了*！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(153,3,0,0) ==false then    --  6(6):战斗[153]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(142,1);   --  2(2):得到物品[反两仪刀法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,43,0,0,0,0,0,5358,5358,5358,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,41,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,51,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,50,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,49,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,48,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,47,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,46,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,42,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1021,6,0);   --  1(1):[灭绝]说: 魔教休得猖狂，峨嵋派前来*支援
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1022,10,0);   --  1(1):[范遥]说: 老贼尼，赶来送死，我们就*成全你！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(154,3,0,0) ==false then    --  6(6):战斗[154]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label2

    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,47,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
    instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(33,13,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [13]
    instruct_3(33,12,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [12]
    instruct_3(33,11,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [11]
    instruct_3(33,10,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [10]
    instruct_3(33,9,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [9]
    instruct_3(33,8,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [8]
    instruct_3(33,7,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [7]
    instruct_3(33,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [6]
    instruct_3(33,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [5]
    instruct_3(33,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [4]
    instruct_3(33,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [3]
    instruct_3(33,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [2]
    instruct_3(33,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [28]
    instruct_3(33,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [28]
    instruct_3(33,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [27]
    instruct_3(33,26,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [26]
    instruct_3(33,25,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [25]
    instruct_3(33,24,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [24]
    instruct_3(33,23,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [23]
    instruct_3(33,22,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [22]
    instruct_3(33,21,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [21]
    instruct_3(33,20,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [20]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(120,1);   --  2(2):得到物品[灭绝剑谱][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(37,1);   --  2(2):得到物品[倚天剑][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1023,13,0);   --  1(1):[谢逊]说: 哈哈哈，如今四派已灭，就*剩下少林和武当了。先诛少*林，再灭武当，唯我明教，*武林称王！哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
    instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(28,36,1,0,0,0,0,2286,2286,2286,-2,-2,-2);   --  3(3):修改事件定义:场景[少林寺]:场景事件编号 [36]
    instruct_0();   --  0(0)::空语句(清屏)
--end

