--function oldevent_882()
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_27(-1,7208,7214);   --  27(1B):显示动画
    instruct_27(-1,7208,7214);   --  27(1B):显示动画
    instruct_27(-1,7208,7214);   --  27(1B):显示动画
    instruct_27(-1,7208,7214);   --  27(1B):显示动画
    instruct_27(-1,7208,7214);   --  27(1B):显示动画

    if instruct_43(112,0,103) ==true then    --  43(2B):是否有物品罗汉拳谱否则跳转到:Label0
        instruct_40(0);   --  40(28):改变主角站立方向0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,50,0,0,0,0,0,7212,7212,7212,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(3441,259,0);   --  1(1):[???]说: 欢迎你来到这里！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3442,0,1);   --  1(1):[AAA]说: 你是谁？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3443,259,0);   --  1(1):[???]说: 我就是小虾米。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3444,0,1);   --  1(1):[AAA]说: 小虾米？你就是传说中以双*手互搏加野球拳打遍天下无*敌手的小虾米？？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3445,259,0);   --  1(1):[???]说: 不错，就是我。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3446,0,1);   --  1(1):[AAA]说: 你……你……你还活着？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3447,259,0);   --  1(1):[???]说: 不。小虾米的故事早已经成*为历史，但是我的精神永存*。也正是我的精神力量，将*你指引到这里的。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3448,0,1);   --  1(1):[AAA]说: 那你把我指引到这里，想告*诉我什么呢？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3449,259,0);   --  1(1):[???]说: 你知道我是如何练成野球拳*的吗？归根结底一个字——*勤奋！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3450,0,1);   --  1(1):[AAA]说: 好像是两个字哦……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3451,259,0);   --  1(1):[???]说: 不要打岔！*你能找到这里，*就说明你和我有缘，现在我*就把这生平绝学传授与你。*但能不能发挥出它的威力，*还要看你自己的努力。记住*，人生在于勤奋！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_35(0,0,109,0);   --  35(23):设置AAA武功0:野球拳攻击力0
        instruct_1(3452,0,1);   --  1(1):[AAA]说: 刚才发生什么事了？我不是*在做梦吧……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_43(134,0,118) ==true then    --  43(2B):是否有物品松风剑法否则跳转到:Label1
        instruct_40(1);   --  40(28):改变主角站立方向1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,51,0,0,0,0,0,7214,7214,7214,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(3441,260,0);   --  1(1):[???]说: 欢迎你来到这里！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3442,0,1);   --  1(1):[AAA]说: 你是谁？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3453,260,0);   --  1(1):[???]说: 我就是小小猪。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3455,0,1);   --  1(1):[AAA]说: 小小猪？你……你……你就*是那个自创神山剑法，独立*打败二十大高手的小小猪？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3445,260,0);   --  1(1):[???]说: 不错，就是我。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3456,0,1);   --  1(1):[AAA]说: 你……你……你怎么会在这*里？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3457,260,0);   --  1(1):[???]说: 我一直有个心愿未了，你能*来到这里，说明你已经替我*完成了心愿！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3458,0,1);   --  1(1):[AAA]说: 你是说教那些穷孩子练武吧*？我已经去过了……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3459,260,0);   --  1(1):[???]说: 很好。你知道我是如何创出*神山剑法的吗？归根结底两*个字——读万卷书，行万里*路！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3460,0,1);   --  1(1):[AAA]说: 明明是八个字……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3461,260,0);   --  1(1):[???]说: 不要打岔！既然你替我完成*了心愿，现在我就把这生平*绝学传授与你。这套剑法乃*是我踏遍群山所悟。记住，*人生要不断挑战新的高度！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_35(0,0,110,0);   --  35(23):设置AAA武功0:神山剑法攻击力0
        instruct_3(70,60,1,0,0,0,0,2286,2286,2286,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [60]
        instruct_1(3452,0,1);   --  1(1):[AAA]说: 刚才发生什么事了？我不是*在做梦吧……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1


    if instruct_43(166,0,118) ==true then    --  43(2B):是否有物品柴刀十八路否则跳转到:Label2
        instruct_40(3);   --  40(28):改变主角站立方向3
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,52,0,0,0,0,0,8252,8252,8252,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(3441,257,0);   --  1(1):[???]说: 欢迎你来到这里！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3442,0,1);   --  1(1):[AAA]说: 你是谁？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3462,257,0);   --  1(1):[???]说: 显然，我是个厨子。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3463,0,1);   --  1(1):[AAA]说: 厨子？你……你……在这里*做什么？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3464,257,0);   --  1(1):[???]说: 我在等你。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3465,0,1);   --  1(1):[AAA]说: 等我？你知道我会来？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3466,257,0);   --  1(1):[???]说: 是的，从你踏入武林的那一*天起，我就知道你一定会来*到这里的。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3467,0,1);   --  1(1):[AAA]说: 我是误打误撞才来到这里的*，都不知道来这里干什么！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3468,257,0);   --  1(1):[???]说: 你会做菜吗？要知真正的烹*调高手，愈是在平凡的菜肴*中，愈能显出真实的本领．*其实这道理跟武学一般，能*在平淡之中现神奇，才说得*上是大宗匠的手段．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3469,0,1);   --  1(1):[AAA]说: 好像有道理哦……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3470,257,0);   --  1(1):[???]说: 当然有道理！我现在就传给*你一套西瓜刀法，这是我长*时间切西瓜所悟出的刀法。*记住，伟大总是孕育在平凡*之中。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_35(0,0,111,0);   --  35(23):设置AAA武功0:西瓜刀法攻击力0
        instruct_3(70,60,1,0,0,0,0,2286,2286,2286,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [60]
        instruct_1(3452,0,1);   --  1(1):[AAA]说: 刚才发生什么事了？我不是*在做梦吧……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2

    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,49,0,0,0,0,0,8246,8246,8246,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3441,258,0);   --  1(1):[???]说: 欢迎你来到这里！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3442,0,1);   --  1(1):[AAA]说: 你是谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3471,258,0);   --  1(1):[???]说: 恩怨、情仇，吾一肩挑*放荡、不羁，吾一声笑*是潇洒江湖，是浪迹天涯，*是吾行吾路。*我是霹雳堂的人，我叫柳无*色。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3472,0,1);   --  1(1):[AAA]说: 怎么这么一堆罗嗦……*你在这里做什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3464,258,0);   --  1(1):[???]说: 我在等你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3465,0,1);   --  1(1):[AAA]说: 等我？你知道我会来？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3466,258,0);   --  1(1):[???]说: 是的，从你踏入武林的那一*天起，我就知道你一定会来*到这里的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3467,0,1);   --  1(1):[AAA]说: 我是误打误撞才来到这里的*，都不知道来这里干什么！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3473,258,0);   --  1(1):[???]说: 来这里，我是想告诉你两个*字——统一！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3474,0,1);   --  1(1):[AAA]说: 我想起了绿茶和方便面……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3475,258,0);   --  1(1):[???]说: 不要打岔！我现在就将我的*绝学——犽月流空传授给你*。记住，只有和平统一，巨*龙才能真正腾飞！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_35(0,0,112,0);   --  35(23):设置AAA武功0:犽月流空攻击力0
    instruct_3(70,60,1,0,0,0,0,2286,2286,2286,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [60]
    instruct_1(3452,0,1);   --  1(1):[AAA]说: 刚才发生什么事了？我不是*在做梦吧……
    instruct_0();   --  0(0)::空语句(清屏)
    do return; end
    instruct_0();   --  0(0)::空语句(清屏)
--end

