--function oldevent_355()
    instruct_1(1351,83,0);   --  1(1):[???]说: 怎么了，小帅哥，不敢把姐*姐留在身边吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,75) ==true then    --  9(9):是否要求加入?否则跳转到:Label0
        instruct_1(1350,83,0);   --  1(1):[???]说: 师父在上，受徒儿一拜。那*袁承志确实来过这里，不过*现在已经回华山了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(104,78,1,0,984,0,0,7042,7042,7042,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [78]

        if instruct_20(18,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
            instruct_10(83);   --  10(A):加入人物[何铁手]
            instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_1(12,83,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(70,55,1,0,181,0,0,7042,7042,7042,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [55]
        instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
--end

