--function oldevent_42()
    instruct_1(223,97,0);   --  1(1):[???]说: 小子，你脾气挺合老子胃口*，加入血刀门吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(224,0,1);   --  1(1):[AAA]说: 血刀门有什么好？我倒是看*你手上这把刀不错，给我吧*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(225,97,0);   --  1(1):[???]说: 嘿嘿，好眼力，这把血刀是*老祖我的贴身兵器，凭什么*给你！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(0,38) ==true then    --  5(5):是否选择战斗？否则跳转到:Label0
        instruct_37(-1);   --  37(25):增加道德-1

        if instruct_6(7,4,0,0) ==false then    --  6(6):战斗[7]是则跳转到:Label1
            instruct_15(0);   --  15(F):战斗失败，死亡
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(226,97,0);   --  1(1):[???]说: 小子，够狠!
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(44,1);   --  2(2):得到物品[血刀][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

--end

