--function oldevent_63()
    instruct_30(30,21,30,13);   --  30(1E):主角走动30-21--30-13
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_1(277,87,0);   --  1(1):[???]说: 呵呵呵……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(275,225,1);   --  1(1):[???]说: 喂，你瞧，瞧……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(278,0,1);   --  1(1):[AAA]说: 什么啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(279,225,1);   --  1(1):[???]说: 大美女啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(280,246,1);   --  1(1):[???]说: 这个，小宝兄，那可是人家*的老婆啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(282,225,0);   --  1(1):[???]说: 想想办法，搞过来啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(276,71,0);   --  1(1):[洪教主]说: 什么人，胆敢擅闯神龙教！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(281,247,1);   --  1(1):[???]说: 啊？啊，我，就是来找找有*没有我要的书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(283,71,0);   --  1(1):[洪教主]说: 你要找什么书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(284,0,1);   --  1(1):[AAA]说: 就是《鹿鼎记》一书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(285,71,0);   --  1(1):[洪教主]说: 哦，还好，我这没有。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(286,0,1);   --  1(1):[AAA]说: 那你这有什么书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(287,71,0);   --  1(1):[洪教主]说: 没有……我哪有什么书？…*…什么也没有……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(288,246,1);   --  1(1):[???]说: ？？？你好像心里有鬼啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(289,71,0);   --  1(1):[洪教主]说: 我有什么鬼？没有就是没有*，你要是再不滚蛋，就休怪*我不客气了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(290,0,1);   --  1(1):[AAA]说: 哼，打就打，谁怕谁。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(291,225,1);   --  1(1):[???]说: 啊，这就开打啦，你们先上*，我掩护。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(292,225,1);   --  1(1):[???]说: 等一下，等一下，我还有件*重要的事……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(293,0,1);   --  1(1):[AAA]说: ？？？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(294,225,1);   --  1(1):[???]说: 千万要注意，别伤到美女。*好，你们继续！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(95,4,0,0) ==false then    --  6(6):战斗[95]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(295,0,1);   --  1(1):[AAA]说: 这回不横了吧？还不把书拿*来。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_43(228,0,143) ==true then    --  43(2B):是否有物品半部四十二章经否则跳转到:Label1
        instruct_26(1,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(1,7,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_1(305,0,1);   --  1(1):[AAA]说: 又是半部《四十二章经》？*这下我正好可以凑成一部了*……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(229,1);   --  2(2):得到物品[四十二章经][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_32(228,-1);   --  32(20):物品[半部四十二章经]+[-1]
        instruct_1(297,225,1);   --  1(1):[???]说: 这位美女，啊不，教主夫人*，仙福永享，寿与天齐，那*个，你若没什么事，跟我们*一起走吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(298,71,0);   --  1(1):[洪教主]说: 你说什么！休打我夫人的主*意。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(299,87,0);   --  1(1):[???]说: 我原本以为呢，你就是武功*天下第一了，没想到随便来*几个人，就把你打得落花流*水，唉……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(300,71,0);   --  1(1):[洪教主]说: 我，我……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(301,225,1);   --  1(1):[???]说: 你什么你，你都七老八十了*，还霸占着这么漂亮的美眉*，你够了你。夫人，咱们走*吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(302,87,0);   --  1(1):[???]说: 走？好啊。*不过我为什么要跟你走啊？*我不会自己走吗*？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,3,1,0,88,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
        instruct_3(69,11,1,0,90,0,0,8256,8256,8256,-2,-2,-2);   --  3(3):修改事件定义:场景[丽春院]:场景事件编号 [11]
        instruct_3(69,10,1,0,91,0,0,7036,7036,7036,-2,-2,-2);   --  3(3):修改事件定义:场景[丽春院]:场景事件编号 [10]
        instruct_3(69,12,1,0,92,0,0,7030,7030,7030,-2,-2,-2);   --  3(3):修改事件定义:场景[丽春院]:场景事件编号 [12]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(304,71,0);   --  1(1):[洪教主]说: 夫人，夫人……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(303,0,1);   --  1(1):[AAA]说: 人都走了，还傻看什么，小*宝，咱们也走吧，这没有要*找的书了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(388,225,1);   --  1(1):[???]说: 唉，遇见两个大美女，都被*你放跑了，看来跟着你你甭*想泡到妞了，我要自己去追*！！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_2(228,1);   --  2(2):得到物品[半部四十二章经][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(296,0,1);   --  1(1):[AAA]说: 这是什么书？看你的样子一*定有问题，我先替你保管着*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(297,225,1);   --  1(1):[???]说: 这位美女，啊不，教主夫人*，仙福永享，寿与天齐，那*个，你若没什么事，跟我们*一起走吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(298,71,0);   --  1(1):[洪教主]说: 你说什么！休打我夫人的主*意。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(299,87,0);   --  1(1):[???]说: 我原本以为呢，你就是武功*天下第一了，没想到随便来*几个人，就把你打得落花流*水，唉……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(300,71,0);   --  1(1):[洪教主]说: 我，我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(301,225,1);   --  1(1):[???]说: 你什么你，你都七老八十了*，还霸占着这么漂亮的美眉*，你够了你。夫人，咱们走*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(302,87,0);   --  1(1):[???]说: 走？好啊。*不过我为什么要跟你走啊？*我不会自己走吗*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,1,0,88,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(304,71,0);   --  1(1):[洪教主]说: 夫人，夫人……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(303,0,1);   --  1(1):[AAA]说: 人都走了，还傻看什么，小*宝，咱们也走吧，这没有要*找的书了。
    instruct_0();   --  0(0)::空语句(清屏)
--end

