--function oldevent_281()

    if instruct_16(9,2,0) ==false then    --  16(10):队伍是否有[张无忌]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_37(1);   --  37(25):增加道德1
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(44,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[蝴蝶谷]:场景事件编号 [0]
    instruct_3(44,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[蝴蝶谷]:场景事件编号 [1]
    instruct_3(-2,0,0,0,0,0,0,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,0,0,0,7008,7008,7008,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,4,0,0,0,0,0,5294,5294,5294,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(48,24,26,23);   --  25(19):场景移动48-24--26-23
    instruct_1(886,15,0);   --  1(1):[金花婆婆]说: 谢三哥，你还信不过紫杉老*妹子么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(887,13,0);   --  1(1):[谢逊]说: 我说过了，除非见到我那无*忌孩儿，否则我是不会把屠*龙刀借给你的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(888,9,1);   --  1(1):[张无忌]说: ＜义父，怎么在这里？那金*花婆婆就是紫杉龙王？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(889,0,1);   --  1(1):[AAA]说: ＜张公子，我们进去相认吧＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(890,174,0);   --  1(1):[???]说: 明教圣火令到，护教龙王、*狮王，还不下跪迎接，更待*何时。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(891,9,1);   --  1(1):[张无忌]说: ＜圣火令？我教圣火令已经*遗失多年，这来的是什么人*？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,5,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(892,15,0);   --  1(1):[金花婆婆]说: 本人早已破门出教，'护教*龙王'四字，再也休提。阁*下尊姓大名？这圣火令是真*是假，从何处得来？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(893,174,0);   --  1(1):[???]说: 明教源于何土？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(894,13,0);   --  1(1):[谢逊]说: 源起波斯。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(895,174,0);   --  1(1):[???]说: 然也，然也！我乃波斯明教*总教流云使，另外两位是妙*风使、辉月使。我等奉总教*主之命，特从波斯来至中土*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(896,13,0);   --  1(1):[谢逊]说: 中土明教虽然出自波斯，但*数百年来独立成派，自来不*受波斯总教管辖。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(897,174,0);   --  1(1):[???]说: 这是中土明教的圣火令，前*任姓石的教主不肖，失落在*外，今由我等取回。自来见*圣火令如见教主。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(898,15,0);   --  1(1):[金花婆婆]说: 我已说过，本人早已破门出*教，这圣火令与我何干？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(899,174,0);   --  1(1):[???]说: 本教教规，入教之后终身不*能叛教。你自称破门出教，*为本教叛徒，需留你不得。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,9,0,0,0,0,0,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(900,66,0);   --  1(1):[小昭]说: 啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(901,0,1);   --  1(1):[AAA]说: ＜这三人一招之间就抓住了*紫杉龙王，功夫着实了得！*＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(902,66,0);   --  1(1):[小昭]说: 快救救我妈妈！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(903,245,1);   --  1(1):[???]说: 大胆胡人，还不快放人。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(14,3,0,0) ==false then    --  6(6):战斗[14]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,0,0,0,0,0,0,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,0,0,0,0,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_19(26,24);   --  19(13):主角移动至1A-18
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(904,13,0);   --  1(1):[谢逊]说: 多谢少侠出手相助。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(905,0,1);   --  1(1):[AAA]说: 狮王不必客气。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(906,15,0);   --  1(1):[金花婆婆]说: 老婆子多谢啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(907,0,1);   --  1(1):[AAA]说: 龙王不必客气。这三个家伙*的武功真是怪异。咦？这是*什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(908,15,0);   --  1(1):[金花婆婆]说: 这就是圣火令。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(909,0,1);   --  1(1):[AAA]说: 这上面好像有字？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(910,15,0);   --  1(1):[金花婆婆]说: 我来看看。哦，这是波斯文*字，我给你译出来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_2(70,1);   --  2(2):得到物品[圣火神功][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(911,0,1);   --  1(1):[AAA]说: 却不知这些人为何要为难婆*婆？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(912,15,0);   --  1(1):[金花婆婆]说: 说来话长。我本是波斯明教*的圣女。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(913,0,1);   --  1(1):[AAA]说: 啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(914,15,0);   --  1(1):[金花婆婆]说: 我来到中原，加入明教，本*是寻找乾坤大挪移心法的。*没想到对银叶先生动了真情*，结为夫妻，这是犯了波斯*明教的大忌，按照教规理应*处死。我这么多年隐姓埋名*，没想到还是被找到了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(915,0,1);   --  1(1):[AAA]说: 原来如此啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(916,66,0);   --  1(1):[小昭]说: 看，又来了好多人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(917,0,1);   --  1(1):[AAA]说: 此地不宜久留，我们还是赶*回光明顶吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(918,13,0);   --  1(1):[谢逊]说: 我还要找我的无忌孩儿。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(919,9,1);   --  1(1):[张无忌]说: 义父……孩儿无忌不孝，没*能早日前来迎接，累义父受*尽辛苦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(920,13,0);   --  1(1):[谢逊]说: 你，你说什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(921,9,1);   --  1(1):[张无忌]说: "拳学之道在凝神，意在力*先方致胜……"
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(922,13,0);   --  1(1):[谢逊]说: 你，你当真便是我那无忌孩*儿？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(923,9,1);   --  1(1):[张无忌]说: 义父……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(924,13,0);   --  1(1):[谢逊]说: 老天爷开眼，老天爷开眼！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(925,247,1);   --  1(1):[???]说: 恭喜你们父子团圆。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(926,13,0);   --  1(1):[谢逊]说: 我曾经说过，谁能把无忌孩*儿给我带来，我就把屠龙刀*送给谁，现在，这把武林至*尊的屠龙宝刀就送给少侠吧*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(43,1);   --  2(2):得到物品[屠龙刀][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(927,247,1);   --  1(1):[???]说: 老爷子，我和你说了吧，你*这位义子，乃是堂堂的明教*教主，你反倒是他的属下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(928,13,0);   --  1(1):[谢逊]说: 这，此话当真？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(929,0,1);   --  1(1):[AAA]说: 事情是这样的……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(930,13,0);   --  1(1):[谢逊]说: 属下金毛狮王谢逊参见教主*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(931,9,1);   --  1(1):[张无忌]说: 义父不必多礼。那些波斯人*不久就会攻来，此地不宜久*留，我们一起回光明顶吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(932,13,0);   --  1(1):[谢逊]说: 一切听教主安排。韩夫人，*你也和我们一起回光明顶吧*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(933,15,0);   --  1(1):[金花婆婆]说: 我已经破门出教……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(934,13,0);   --  1(1):[谢逊]说: 当年之事，你至今还耿耿于*怀么？我明教这些年四分五*裂，现在好不容易有了新教*主，大家该当齐心协力。波*斯明教肯定还会来找你麻烦*，不如我们一起回光明顶吧*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(935,15,0);   --  1(1):[金花婆婆]说: 光明顶上，还容得下我吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(936,9,1);   --  1(1):[张无忌]说: 明教四王，紫白金青。自然*一个也不能少。光明顶上的*兄弟们，都很惦记你啊。一*起回去吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(937,15,0);   --  1(1):[金花婆婆]说: 这，好吧，此地确实不宜久*留，既然教主有命，属下紫*杉龙王自当遵从。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(938,66,0);   --  1(1):[小昭]说: 妈妈，我……想跟着教主…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(939,15,0);   --  1(1):[金花婆婆]说: 哈哈，好，女大不由娘，你*就跟着教主和这位少侠吧。*谢三哥，我们回光明顶。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(940,13,0);   --  1(1):[谢逊]说: 好，我们走。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(11,109,1,0,282,0,0,5294,5294,5294,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [109]
    instruct_3(11,101,1,0,283,0,0,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [101]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(104,53,1,0,972,0,0,7052,7052,7052,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [53]

    if instruct_20(4,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
        instruct_10(66);   --  10(A):加入人物[小昭]
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2

    instruct_1(12,66,0);   --  1(1):[小昭]说: 你的队伍已满，我就直接去*小村吧。
    instruct_3(70,38,1,0,157,0,0,7008,7008,7008,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [38]
    instruct_0();   --  0(0)::空语句(清屏)
--end

