--function oldevent_915()
    instruct_3(40,17,1,0,1034,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [17]
    instruct_3(40,18,1,0,1034,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [18]
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_25(47,29,33,29);   --  25(19):场景移动47-29--33-29
    instruct_1(3594,22,0);   --  1(1):[左冷禅]说: 我五岳剑派同气连枝，百余*年来携手结盟，早便如同一*家．*兄弟忝为五派盟主，亦已多*历年所．只是近来武林中出*了不少大事，兄弟与五岳剑*派的前辈师兄们商量，均觉*若非连成一派，统一号令，*来日大难，只怕不易抵挡．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3595,20,0);   --  1(1):[莫大]说: 不知左盟主和那一派的前辈*师兄们商量过了？怎地我莫*某人不知其事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3596,22,0);   --  1(1):[左冷禅]说: 兄弟适才说到，武林中出了*不少大事，五派非合而为一*不可．*其中一件大事，便是咱们五*派中人，自相残杀，不顾同*盟义气．*莫大先生，我嵩山派弟子费*师弟，在衡山城外丧命．**有人亲眼目睹，说是你莫大*先生下的毒手，不知此事可*真？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3597,20,0);   --  1(1):[莫大]说: 并无其事！谅莫某这一点微*末道行，怎杀得了那大嵩阳*手？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3598,22,0);   --  1(1):[左冷禅]说: 莫兄，这件事你也不用太过*担心，等我五派合并之後，*莫兄和我也是师兄弟了．*死者已矣，活着的人又何必*再逞凶杀，多造杀孽？*莫兄，你说是不是呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3599,20,0);   --  1(1):[莫大]说: 哼！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3600,22,0);   --  1(1):[左冷禅]说: 南岳衡山派於并派之议，是*无意见了．东岳泰山派天门*道兄，贵派意思如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3601,23,0);   --  1(1):[天门]说:  泰山派自祖师爷东灵道长创*派以来，已三百余年．贫道*无德无能，不能发扬光大泰*山一派，可是这三百多年的*基业，说什麽也不能自贫道*手中断绝．*并派之议，万万不能从命．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3602,22,0);   --  1(1):[左冷禅]说: 道兄此言差矣．五派合并後*我五岳派声势壮大，其下各*个弟子，那一个不沾到光？*道兄何必为这区区泰山派掌*门一职的私心，而阻扰了全*派的大业．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3603,23,0);   --  1(1):[天门]说: 我这掌门人，做不做有什麽*干系？只是泰山一派，恁说*也不能在我手中给人并吞．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3604,22,0);   --  1(1):[左冷禅]说: 道兄说了这麽多，*心中却就是为了放不下掌门*人的名位．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3605,23,0);   --  1(1):[天门]说: 你真道我是如此私心？*好，从此刻起，我这掌门人*不做了．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3606,22,0);   --  1(1):[左冷禅]说: 道兄是赞成此事了．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3607,23,0);   --  1(1):[天门]说: 你．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3608,0,1);   --  1(1):[AAA]说: ＜这老道性子太急了，一被*激就着了人家的道＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3609,21,0);   --  1(1):[定闲]说: 左盟主已然身为五岳剑派盟*主，位望何等尊崇，何必定*要并五派，由一人任掌门．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3610,22,0);   --  1(1):[左冷禅]说: 师太此言差矣．左某只是提*议五派合并．**这掌门之位，当然还是要由*我五派之人推举出来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(33,29,47,29);   --  25(19):场景移动33-29--47-29
    instruct_30(47,29,35,29);   --  30(1E):主角走动47-29--35-29
    instruct_1(3611,0,1);   --  1(1):[AAA]说: 我看别讨论了，学武之人，*就在武功下见真章．*来来来，有谁要跟我打？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3612,22,0);   --  1(1):[左冷禅]说: 不知阁下是谁？竟擅闯我嵩*山派，你不知道我五岳派在*此聚会吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3613,19,0);   --  1(1):[岳不群]说:  这位少侠前些时日来到我华*山，*我已让他入我华山派了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3614,22,0);   --  1(1):[左冷禅]说: 原来是华山派的弟子，照如*此说，岳先生也是赞成这*”比剑夺帅”的方法了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3615,19,0);   --  1(1):[岳不群]说: 比剑夺帅，原也是一法，*但只可点到为止，*以免伤了和气．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3616,23,0);   --  1(1):[天门]说: 原来华山派是赞成并派的，*我天门就先来领教你华山派*的高招．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(30,4,0,0) ==false then    --  6(6):战斗[30]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3617,21,0);   --  1(1):[定闲]说: 让我定闲来领教领教华山派*的高招．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(31,4,0,0) ==false then    --  6(6):战斗[31]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3618,20,0);   --  1(1):[莫大]说: 你连战两场，*先下去休息吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3619,0,1);   --  1(1):[AAA]说: 没关系，少年人体力充沛，*莫掌门请出手吧．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(32,4,0,0) ==false then    --  6(6):战斗[32]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3620,22,0);   --  1(1):[左冷禅]说: 真所谓”长江後浪推前浪”*华山派岳先生为了今天，*想必已筹划很久了吧．*若左某也败了，我嵩山派自*当奉岳先生为掌门．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(33,4,0,0) ==false then    --  6(6):战斗[33]是则跳转到:Label3
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label3

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3621,0,1);   --  1(1):[AAA]说: 终於都解决了，好累．*左冷禅，看来你的阴谋是无*法达成了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3622,22,0);   --  1(1):[左冷禅]说: 我不该低估你的．*岳不群．想不到你的心计比*我还深，左某是输你一筹．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3629,19,0);   --  1(1):[岳不群]说: 嗯，五岳派今日新创，百废*待举，在下只能总领其事，*各派的事务，还是由各派原*任掌门主持．***咱们五岳派今日合并，若不*能和衷同济，那麽五派合并*云云，也只是虚名而已．*在下无德无能，暂且执掌本*门门户，种种兴革，还须和*众位兄弟从长计议，在下不*敢自专．***现下天色已晚，各位都辛苦*了，今天就到此为止，他日*再到华山来共商大事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,47,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(27,54,0,0,902,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[嵩山派]:场景事件编号 [54]
    instruct_3(58,10,0,0,903,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[衡山派]:场景事件编号 [10]
    instruct_3(29,1,0,0,905,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[泰山派]:场景事件编号 [1]
    instruct_3(31,0,0,0,904,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[恒山派]:场景事件编号 [0]
    instruct_3(57,1,0,0,916,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [1]
    instruct_3(57,32,1,0,918,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [32]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

