--function oldevent_897()

    if instruct_16(73,6,0) ==false then    --  16(10):队伍是否有[任盈盈]是则跳转到:Label0
        instruct_1(3566,202,0);   --  1(1):[???]说: 黑木崖乃日月神教总坛所在*，非我教人员不得入内。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3567,202,0);   --  1(1):[???]说: 圣、圣姑，属下参见圣姑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3568,73,1);   --  1(1):[任盈盈]说: 还不快让开！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3569,202,0);   --  1(1):[???]说: 是！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

