--function oldevent_1014()
    instruct_1(3854,247,1);   --  1(1):[???]说: 这酒好香啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3855,88,0);   --  1(1):[???]说: 呵呵，小兄弟也喜欢这杯中*之物吗？那你且来说说看，*我饮的这是什么酒？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3856,0,1);   --  1(1):[AAA]说: 甘甜可口，清冽芳醇，喝上*一口沁人心脾，如果在下猜*得不错，这必定是梨花酒。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3857,88,0);   --  1(1):[???]说: 哈哈哈，不错不错；*唉，可惜可惜！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3858,0,1);   --  1(1):[AAA]说: 既然在下猜得不错，先生为*何连说“可惜”？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3859,88,0);   --  1(1):[???]说: 只有好酒，却无好器皿，岂*不可惜？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3860,0,1);   --  1(1):[AAA]说: 请教先生，这器皿有何讲究*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3861,88,0);   --  1(1):[???]说: 白乐天杭州春望诗云：红袖*织绫夸柿蒂，青旗沽酒趁梨*花。杭州酒家卖这梨花酒，*挂的是滴翠似的青旗，映得*那梨花酒分外精神，饮这梨*花酒，自然也当是翡翠杯了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3862,0,1);   --  1(1):[AAA]说: 先生高明，在下受教了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,1015,1016,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

