--function oldevent_802()

    if instruct_16(35,21,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        instruct_1(3250,33,0);   --  1(1):[黑白子]说: 我梅庄之中一定有人可以打*败少侠！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3251,0,1);   --  1(1):[AAA]说: ＜嘿嘿，我当然知道，向大*哥都已经告诉我了……＞*哦？不知是哪一位？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3252,33,0);   --  1(1):[黑白子]说: 这个，这个，我再和我大哥*说说，少侠请稍后再来。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3253,0,1);   --  1(1):[AAA]说: ＜恩，这位高人这么难见，*一定是高人中的高人，下次*来应该叫令狐大哥一起来，*好为他治伤。＞
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3249,33,0);   --  1(1):[黑白子]说: 少侠，好久不见，*近来可好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3254,246,1);   --  1(1):[???]说: ＜这麽客气，一定有诈，*  还是小心得好．＞**托你的福，一切还好．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3255,33,0);   --  1(1):[黑白子]说: 小兄弟．敝庄实另有一位朋*友，听说少侠的武功如此了*得，说什麽也要和你较量几*手．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3256,0,1);   --  1(1):[AAA]说: ＜嘿嘿，终于……＞*这样啊，好！没问题，就请*二庄主替我引见引见．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3257,33,0);   --  1(1):[黑白子]说: 那位朋友一向不习惯阳光下*的生活，所以将自己关在梅*庄下的地洞中．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3258,0,1);   --  1(1):[AAA]说: ＜天底下还有这种人，喜欢*  把自己关在地洞里，真不*愧是高人啊，就是与众不同*。＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,25,1,0,803,0,0,6066,6066,6066,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_17(-2,1,29,30,0);   --  17(11):修改场景贴图:当前场景层1坐标1D-1E
    instruct_19(20,25);   --  19(13):主角移动至14-19
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3259,33,0);   --  1(1):[黑白子]说: 那人就在下面的地窖里，门*我已经打开了，少侠快下去*吧。
    instruct_0();   --  0(0)::空语句(清屏)
--end

