--function oldevent_346()
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_30(49,36,42,36);   --  30(1E):主角走动49-36--42-36
    instruct_1(1267,54,0);   --  1(1):[袁承志]说: 青青、青青、你怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1268,0,1);   --  1(1):[AAA]说: 温姑娘怎么了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1269,54,0);   --  1(1):[袁承志]说: 兄台来得正是时候，快拦住*那个恶道，他打伤了青青。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1270,0,1);   --  1(1):[AAA]说: 嘿嘿，交给我了，我看你往*那跑。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1271,184,0);   --  1(1):[???]说: 哼，你们这么多人打我一个*，也不害臊。有本事单打独*斗！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1272,0,1);   --  1(1):[AAA]说: 好，我就和你单打独斗。要*是我输了，随你下山。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1273,184,0);   --  1(1):[???]说: 哈哈哈，这话要是那穆老儿*说出来，我还有几分相信。*你个乳臭未干的娃娃，拿命*来！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(161,3,0,0) ==false then    --  6(6):战斗[161]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_37(3);   --  37(25):增加道德3
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_19(41,34);   --  19(13):主角移动至29-22
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1274,54,0);   --  1(1):[袁承志]说: 青青、青青……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1275,91,0);   --  1(1):[???]说: 袁大哥，我……恐怕不行了*……
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(16,0,280) ==true then    --  16(10):队伍是否有[胡青牛]否则跳转到:Label1
        instruct_37(3);   --  37(25):增加道德3
        instruct_1(1297,16,1);   --  1(1):[胡青牛]说: 我来看看……有我蝶谷医仙*胡青牛在，没有什么不行的*！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,11,0,0,0,0,0,7062,7062,7062,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1277,54,0);   --  1(1):[袁承志]说: 青青，你，太好了，你还活*着，我……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1278,91,0);   --  1(1):[???]说: 袁大哥，瞧你哭的像个泪人*一样，让别人看了笑话……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1279,54,0);   --  1(1):[袁承志]说: 啊，是是，呵呵，我……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1280,185,0);   --  1(1):[???]说: 呵呵呵，先生神乎其技，不*愧医仙之名啊！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1281,16,0);   --  1(1):[胡青牛]说: 哪里哪里，穆先生过奖了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1282,185,0);   --  1(1):[???]说: 承志啊，还不快谢过胡前辈*和这位少侠。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1283,54,0);   --  1(1):[袁承志]说: 是，两位大恩，袁承志在此*谢过。今后若有任何差遣，*袁某愿赴汤蹈火！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1284,0,1);   --  1(1):[AAA]说: 袁公子太客气了。*不过，我倒真有件事情想请*穆老前辈和袁公子帮帮我。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1285,185,0);   --  1(1):[???]说: 少侠但讲无妨。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1286,0,1);   --  1(1):[AAA]说: 我一直在寻找十四天书，不*知穆老前辈可有线索？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1287,185,0);   --  1(1):[???]说: 其他的书我不知道，我这里*有一本《碧血剑》，应该是*你想要的吧。少侠帮我华山*派许多，这本书就赠与少侠*吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(156,1);   --  2(2):得到物品[碧血剑][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1288,247,1);   --  1(1):[???]说: 多谢穆老前辈。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1289,185,0);   --  1(1):[???]说: 承志啊，这位少侠帮了你这*么多，我看，今后你就跟着*他，帮他找寻十四天书吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1290,54,0);   --  1(1):[袁承志]说: 是，弟子谨遵师命。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1291,185,0);   --  1(1):[???]说: 好，少侠手刃玉真子，此次*华山聚会也算功德圆满，大*家就此散了吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1292,54,0);   --  1(1):[袁承志]说: 少侠，我和青青去小村了，*随时听候少侠差遣。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(104,83,1,0,992,0,0,7032,7032,7032,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [83]
        instruct_3(104,75,1,0,966,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [75]
        instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
        instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
        instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
        instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(70,51,1,0,197,0,0,7032,7032,7032,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [51]
        instruct_3(70,18,1,0,145,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [18]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label1


    if instruct_16(28,0,281) ==true then    --  16(10):队伍是否有[平一指]否则跳转到:Label2
        instruct_37(3);   --  37(25):增加道德3
        instruct_1(1293,28,1);   --  1(1):[平一指]说: 我来看看……有我平一指在*，没有什么不行的！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,11,0,0,0,0,0,7062,7062,7062,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1277,54,0);   --  1(1):[袁承志]说: 青青，你，太好了，你还活*着，我……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1278,91,0);   --  1(1):[???]说: 袁大哥，瞧你哭的像个泪人*一样，让别人看了笑话……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1279,54,0);   --  1(1):[袁承志]说: 啊，是是，呵呵，我……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1294,185,0);   --  1(1):[???]说: 呵呵呵，先生神乎其技，老*朽佩服，不过先生号称“杀*人名医”，是不是还要再杀*一人呢？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1295,28,1);   --  1(1):[平一指]说: 唉，没治好令狐公子，我这*条命早已输给这位少侠了，*“杀人名医”的名号再也不*要提起啦。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1296,185,0);   --  1(1):[???]说: 承志啊，还不快谢过平前辈*和这位少侠。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1283,54,0);   --  1(1):[袁承志]说: 是，两位大恩，袁承志在此*谢过。今后若有任何差遣，*袁某愿赴汤蹈火！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1284,0,1);   --  1(1):[AAA]说: 袁公子太客气了。*不过，我倒真有件事情想请*穆老前辈和袁公子帮帮我。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1285,185,0);   --  1(1):[???]说: 少侠但讲无妨。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1286,0,1);   --  1(1):[AAA]说: 我一直在寻找十四天书，不*知穆老前辈可有线索？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1287,185,0);   --  1(1):[???]说: 其他的书我不知道，我这里*有一本《碧血剑》，应该是*你想要的吧。少侠帮我华山*派许多，这本书就赠与少侠*吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(156,1);   --  2(2):得到物品[碧血剑][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1288,247,1);   --  1(1):[???]说: 多谢穆老前辈。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1289,185,0);   --  1(1):[???]说: 承志啊，这位少侠帮了你这*么多，我看，今后你就跟着*他，帮他找寻十四天书吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1290,54,0);   --  1(1):[袁承志]说: 是，弟子谨遵师命。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1291,185,0);   --  1(1):[???]说: 好，少侠手刃玉真子，此次*华山聚会也算功德圆满，大*家就此散了吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1292,54,0);   --  1(1):[袁承志]说: 少侠，我和青青去小村了，*随时听候少侠差遣。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(104,83,1,0,992,0,0,7032,7032,7032,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [83]
        instruct_3(104,75,1,0,966,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [75]
        instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
        instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
        instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
        instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(70,51,1,0,197,0,0,7032,7032,7032,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [51]
        instruct_3(70,18,1,0,145,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [18]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2


    if instruct_16(45,0,281) ==true then    --  16(10):队伍是否有[薛慕华]否则跳转到:Label3
        instruct_37(3);   --  37(25):增加道德3
        instruct_1(1276,45,1);   --  1(1):[薛慕华]说: 我来看看……有我阎王敌薛*慕华在，没有什么不行的！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,11,0,0,0,0,0,7062,7062,7062,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1277,54,0);   --  1(1):[袁承志]说: 青青，你，太好了，你还活*着，我……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1278,91,0);   --  1(1):[???]说: 袁大哥，瞧你哭的像个泪人*一样，让别人看了笑话……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1279,54,0);   --  1(1):[袁承志]说: 啊，是是，呵呵，我……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1298,185,0);   --  1(1):[???]说: 呵呵呵，先生神乎其技，不*愧是阎王敌啊！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1281,45,0);   --  1(1):[薛慕华]说: 哪里哪里，穆先生过奖了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3992,185,0);   --  1(1):[???]说: 承志啊，还不快谢过薛前辈*和这位少侠。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1283,54,0);   --  1(1):[袁承志]说: 是，两位大恩，袁承志在此*谢过。今后若有任何差遣，*袁某愿赴汤蹈火！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1284,0,1);   --  1(1):[AAA]说: 袁公子太客气了。*不过，我倒真有件事情想请*穆老前辈和袁公子帮帮我。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1285,185,0);   --  1(1):[???]说: 少侠但讲无妨。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1286,0,1);   --  1(1):[AAA]说: 我一直在寻找十四天书，不*知穆老前辈可有线索？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1287,185,0);   --  1(1):[???]说: 其他的书我不知道，我这里*有一本《碧血剑》，应该是*你想要的吧。少侠帮我华山*派许多，这本书就赠与少侠*吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(156,1);   --  2(2):得到物品[碧血剑][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1288,247,1);   --  1(1):[???]说: 多谢穆老前辈。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1289,185,0);   --  1(1):[???]说: 承志啊，这位少侠帮了你这*么多，我看，今后你就跟着*他，帮他找寻十四天书吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1290,54,0);   --  1(1):[袁承志]说: 是，弟子谨遵师命。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1291,185,0);   --  1(1):[???]说: 好，少侠手刃玉真子，此次*华山聚会也算功德圆满，大*家就此散了吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1292,54,0);   --  1(1):[袁承志]说: 少侠，我和青青去小村了，*随时听候少侠差遣。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(104,83,1,0,992,0,0,7032,7032,7032,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [83]
        instruct_3(104,75,1,0,966,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [75]
        instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
        instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
        instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
        instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(70,51,1,0,197,0,0,7032,7032,7032,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [51]
        instruct_3(70,18,1,0,145,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [18]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label3

    instruct_1(1299,54,0);   --  1(1):[袁承志]说: 青青，你不会有事的……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1300,91,0);   --  1(1):[???]说: 袁大哥，能认识你，我很开*心，真的很开心……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1301,54,0);   --  1(1):[袁承志]说: 青青，青青……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,1,1,0,0,0,0,6700,6700,6700,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,3,1,0,0,0,0,6696,6696,6696,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(80,13,0,0,0,0,0,7064,7064,7064,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [13]
    instruct_3(80,12,0,0,0,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [12]
    instruct_19(22,18);   --  19(13):主角移动至16-12
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_25(20,15,20,15);   --  25(19):场景移动20-15--20-15
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1302,185,0);   --  1(1):[???]说: 承志啊，人死不能复生，你*还是节哀吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1303,54,0);   --  1(1):[袁承志]说: 我……师父，弟子想一个人*静一静……我……我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1304,185,0);   --  1(1):[???]说: 孩子，你不要总想这件事了*，到处去游历一番，痛苦会*随着时间慢慢减轻。活着的*人，总是要好好活下去的…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1305,54,0);   --  1(1):[袁承志]说: 弟子……遵命……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1306,244,1);   --  1(1):[???]说: 袁公子……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1307,185,0);   --  1(1):[???]说: 人生不如意，十有八九啊…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(78,0,1,0,347,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[浡泥岛]:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

