--function oldevent_691()
    instruct_66(2);   --  66(42):播放音乐2
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_19(16,31);   --  19(13):主角移动至10-1F
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(16,31,9,31);   --  30(1E):主角走动16-31--9-31
    instruct_1(2747,255,0);   --  1(1):[???]说: 年轻人，你来啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2748,246,1);   --  1(1):[???]说: 拜托，不要每次见面都叫我*年轻人。我们已经在一起生*活了十六年了，你怎么总是*像刚认识我一样！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2749,255,0);   --  1(1):[???]说: 我是贤者，说话自然要有贤*者的风范。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2750,246,1);   --  1(1):[???]说: 好吧，你就继续保持你的贤*者风范吧。我说贤者啊，今*天找我来有什么事？难道又*是要……斗地主？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2751,255,0);   --  1(1):[???]说: 年轻人要好好学习，不要总*想着玩。同时还要郑重的提*醒你——前天你欠北丑的五*两银子还没给呢。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2752,246,1);   --  1(1):[???]说: 死老头，我欠他的钱，你记*这么清楚干什么！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2753,255,0);   --  1(1):[???]说: 今天找你来，是有件关乎你*命运的大事，十分重要，你*要仔细听。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2754,0,1);   --  1(1):[AAA]说: 关乎命运的大事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2755,255,0);   --  1(1):[???]说: 先去把你丑叔找来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(9,31,13,31);   --  30(1E):主角走动9-31--13-31
    instruct_30(13,31,13,21);   --  30(1E):主角走动13-31--13-21
    instruct_30(13,21,8,21);   --  30(1E):主角走动13-21--8-21
    instruct_1(2756,0,1);   --  1(1):[AAA]说: 丑叔～
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2757,256,0);   --  1(1):[???]说: 呼噜……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2758,244,1);   --  1(1):[???]说: 你可真行，大白天睁着眼站*着也能睡着。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2757,256,0);   --  1(1):[???]说: 呼噜……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2759,245,1);   --  1(1):[???]说: （提高音量）*丑——————！！！！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2760,256,0);   --  1(1):[???]说: 怎么了，怎么了，在哪里发*现宝藏了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2761,0,1);   --  1(1):[AAA]说: 丑叔，是我，成天就知道宝*藏，哪里像个智者的样子！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2762,256,0);   --  1(1):[???]说: 是你这小子，没事不要打扰*我睡觉，我才刚睡了一天。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2763,246,1);   --  1(1):[???]说: 我才懒得叫你呢。是南贤老*头让我来找你，说有一件关*乎我命运的大事要和我说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2764,256,0);   --  1(1):[???]说: 关乎命运？难道……你已经*来这里十六年了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2765,0,1);   --  1(1):[AAA]说: 你的记性还真好，到今天刚*好十六年整。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2766,256,0);   --  1(1):[???]说: 这一天终于来了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2767,0,1);   --  1(1):[AAA]说: 怎么了？突然这么深沉？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2768,256,0);   --  1(1):[???]说: 走，去你房间。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,62,0,0,0,0,0,8250,8250,8250,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_19(9,31);   --  19(13):主角移动至9-1F
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2769,256,0);   --  1(1):[???]说: 师兄，今天就让他去吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2770,255,0);   --  1(1):[???]说: 是的，他到这里刚好十六年*了，今天就是命运之日。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2771,0,1);   --  1(1):[AAA]说: 什么什么啊，你们在说什么*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2772,255,0);   --  1(1):[???]说: 年轻人，你好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2773,244,1);   --  1(1):[???]说: 又来了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2774,255,0);   --  1(1):[???]说: 你知道这是哪里吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2775,245,1);   --  1(1):[???]说: 废话，我都住了十六年了，*还不知道吗！这不就是小村*嘛！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2776,256,0);   --  1(1):[???]说: 那你知道这里为什么叫小村*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2777,246,1);   --  1(1):[???]说: 那还用问！因为这里很小啊*，不叫小村叫什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2778,255,0);   --  1(1):[???]说: 年轻人，你错了。这里之所*以叫小村，是因为这里曾经*出了两位了不起的英雄。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2779,0,1);   --  1(1):[AAA]说: 英雄？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2780,255,0);   --  1(1):[???]说: 是的。一位叫小虾米，他凭*借一套野球拳法成为武林至*尊；另一位叫小小猪，他自*创一套神山剑法，天下无敌*。就因为这两位英雄名字里*都有“小”字，所以这里叫*做“小村”。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2781,246,1);   --  1(1):[???]说: 听这名字，根本就不像个能*诞生英雄的地方……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2782,255,0);   --  1(1):[???]说: 而你，将必须继承他们的事*业！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2783,0,1);   --  1(1):[AAA]说: 继承他们？还必须？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2784,255,0);   --  1(1):[???]说: 是的，因为你和他们一样，*并不属于这个世界。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2785,0,1);   --  1(1):[AAA]说: 什么跟什么啊，我怎么就不*属于这个世界了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2786,256,0);   --  1(1):[???]说: 你知道你是从哪里来的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2787,246,1);   --  1(1):[???]说: 这个问题，在这十六年中我*问了你们无数遍，可你们就*是不告诉我！现在反倒来问*我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2788,255,0);   --  1(1):[???]说: 你，来自龙之国度。*你，就是龙的传人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2789,0,1);   --  1(1):[AAA]说: “龙之国度”？这是个什么*地方？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2790,256,0);   --  1(1):[???]说: 这就需要你自己去寻找答案*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2791,0,1);   --  1(1):[AAA]说: 自己找？怎么找？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2792,255,0);   --  1(1):[???]说: 答案就在十四天书里。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2793,0,1);   --  1(1):[AAA]说: 十四天书？倒是听你们说过*，不就是“飞雪连天射白鹿*，笑书神侠倚碧鸳”嘛！可*是这些书现在在哪里呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2794,256,0);   --  1(1):[???]说: 在江湖。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2795,0,1);   --  1(1):[AAA]说: 江湖？哪里是江湖？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2796,255,0);   --  1(1):[???]说: 有人的地方，就是江湖。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2797,246,1);   --  1(1):[???]说: 那不是等于没说，还是不知*道在哪里。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2798,256,0);   --  1(1):[???]说: 所以，要你自己去寻找。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2799,0,1);   --  1(1):[AAA]说: 哦，我明白了，你们两个就*是让我离开小村，出去找那*什么十四天书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2800,256,0);   --  1(1):[???]说: 聪明，不愧是我教出来的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2801,0,1);   --  1(1):[AAA]说: 可是，就我一个人？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2802,255,0);   --  1(1):[???]说: 是的，只有你一个人。当然*你在闯荡江湖的时候，可以*找一些志同道合的朋友来帮*忙。我们两个也可以给你提*供一些帮助。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2803,0,1);   --  1(1):[AAA]说: 你们俩能给我些什么呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2804,256,0);   --  1(1):[???]说: 那就看你想要什么了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2805,247,1);   --  1(1):[???]说: 什么都可以？*那……*那我想要……*我要美女我要美女！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2806,255,0);   --  1(1):[???]说: 给你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,1,0,690,0,0,6086,6086,6086,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2807,261,0);   --  1(1):[???]说: 公子好，我叫双儿。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2808,248,1);   --  1(1):[???]说: 呵呵……双儿姑娘……你好*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2809,261,0);   --  1(1):[???]说: 今后就由我来照顾公子的起*居。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2810,247,1);   --  1(1):[???]说: 南贤老头的话这么灵？*那我还要……**我要金钱我要金钱！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2811,255,0);   --  1(1):[???]说: 给你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(174,400);   --  2(2):得到物品[银两][400]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2812,247,1);   --  1(1):[???]说: 哇塞，发财了……*那我还要……*我还要……*还要什么呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2813,256,0);   --  1(1):[???]说: 除了金钱和美女，你就没点*别的追求了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2814,244,1);   --  1(1):[???]说: 还真想不出来了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2815,256,0);   --  1(1):[???]说: 不愧是南贤教出来的！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2816,0,1);   --  1(1):[AAA]说: 哦，对了，闯荡江湖很危险*吧？总得教我点防身的武功*啊，像刚才说的什么野球拳*法、什么神山剑法，那么厉*害，教教我吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2811,255,0);   --  1(1):[???]说: 给你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(234,1);   --  2(2):得到物品[介绍信][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2817,0,1);   --  1(1):[AAA]说: 这是什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2818,255,0);   --  1(1):[???]说: 这是我给你写的推荐信。凭*这封信，你可以到少林寺学*习拳法，可以去青城派学习*剑法，可以去黎山洞学习刀*法，可以去全真派学习特殊*兵器。你愿意学什么武功，*就自己选吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2819,0,1);   --  1(1):[AAA]说: 可是我找不到地方怎么办？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2811,255,0);   --  1(1):[???]说: 给你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(182,1);   --  2(2):得到物品[罗盘][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2820,0,1);   --  1(1):[AAA]说: 这又是什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2821,256,0);   --  1(1):[???]说: 这是罗盘，找不到地方时可*以用它看看坐标。刚才南贤*老头和你说了四个地方，坐*标分别是*少林寺（246，300）*青城（185，369）*黎山洞（413，331）*重阳宫（145，216）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2822,255,0);   --  1(1):[???]说: 好了，该给你的都给你了，*你可以上路了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2823,0,1);   --  1(1):[AAA]说: 喂喂喂，我还是不知道，我*找到十四天书之后呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2824,255,0);   --  1(1):[???]说: 找齐之后，会有一件大事等*着你做，你回来找我就可以*了。记住，无论如何都要找*齐十四天书，否则不但你自*己的性命不保，整个武林都*将遭受一场空前浩劫！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2825,244,1);   --  1(1):[???]说: 武林遭受什么浩劫好像和我*没关系吧？不过自己小命不*保，这可不行，看来真的拼*命去找这劳什子天书了，唉*，我真命苦……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2826,256,0);   --  1(1):[???]说: 快去吧，别婆婆妈妈的，像*个小南贤！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,4,1,0,695,0,0,8250,8250,8250,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,1,0,694,0,0,5098,5098,5098,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,61,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
    instruct_3(-2,62,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
    instruct_39(19);   --  39(27):打开场景重阳宫
    instruct_39(101);   --  39(27):打开场景黎山洞
    instruct_39(36);   --  39(27):打开场景青城派
    instruct_39(28);   --  39(27):打开场景少林寺
    instruct_39(93);   --  39(27):打开场景少室山下
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

