--function oldevent_282()
    instruct_26(40,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,12,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(941,0,0);   --  1(1):[AAA]说: 谢法王，我还想向你打听一*下《倚天屠龙记》一书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(942,13,0);   --  1(1):[谢逊]说: 此书就在我身上。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(943,247,1);   --  1(1):[???]说: 太好了，能否借我一下？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(944,13,0);   --  1(1):[谢逊]说: 少侠对我明教有大恩，按说*谢逊不应拒绝。但是此书乃*我明教镇教之宝，不可轻与*外人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(945,0,1);   --  1(1):[AAA]说: 那谢法王怎样才肯借出此书*呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(946,13,0);   --  1(1):[谢逊]说: 我明教现在还有一心腹大患*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(947,0,1);   --  1(1):[AAA]说: 你是说那恶僧成昆？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(948,13,0);   --  1(1):[谢逊]说: 不错，这成昆害我全家，更*处心积虑害我明教，只要少*侠把他的人头带来，我就将*此书赠与少侠。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(949,0,1);   --  1(1):[AAA]说: 好，一言为定。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,286,285,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(9,0,0,0,0,0,284,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [0]
    instruct_3(9,1,0,0,0,0,0,5296,5296,5296,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [1]
    instruct_3(9,2,0,0,0,0,0,6092,6092,6092,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [2]
    instruct_3(9,3,0,0,0,0,0,6788,6788,6788,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [3]
    instruct_3(9,4,0,0,0,0,0,5892,5892,5892,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [4]
--end

