--function oldevent_467()
    instruct_37(1);   --  37(25):增加道德1
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_25(21,32,14,32);   --  25(19):场景移动21-32--14-32
    instruct_25(14,32,14,40);   --  25(19):场景移动14-32--14-40
    instruct_1(1820,60,0);   --  1(1):[欧阳锋]说: 克儿，克儿，你怎么啦？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1821,61,0);   --  1(1):[欧阳克]说: 叔叔，我，我的腿……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1822,60,0);   --  1(1):[欧阳锋]说: 哼，克儿你等着，我这就去*杀了洪老叫化和姓郭的，把*黄老邪的丫头抓来给你做媳*妇。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1823,245,1);   --  1(1):[???]说: ＜哎呦，不好，洪老英雄好*像已经身负重伤，我得救他*们＞，欧阳锋，住手，休伤*洪帮主。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(171,3,0,0) ==false then    --  6(6):战斗[171]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1824,61,0);   --  1(1):[欧阳克]说: 啊，啊，疼死我了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1825,60,0);   --  1(1):[欧阳锋]说: 克儿，你怎么啦。唉，洪老*叫化，姓郭的，还有你这臭*小子，今日克儿伤势严重，*就先放过你们，若是我的克*儿有什么三长两短，我全都*要你们陪葬。克儿，我先带*你回白驼山，养好了伤再找*他们算帐！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_19(15,33);   --  19(13):主角移动至F-21
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1826,0,1);   --  1(1):[AAA]说: 欧阳锋，你哪里跑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1827,69,0);   --  1(1):[洪七公]说: 算啦，不要追了，他惦记他*侄儿的伤势，才会输给你们*，否则你们哪里是他的对手*。要是真把他逼极了，我们*恐怕治他不住。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1828,0,1);   --  1(1):[AAA]说: 对了洪帮主、郭大哥、黄姑*娘，你们怎么会在这里，洪*老英雄怎么受伤了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1829,56,0);   --  1(1):[黄蓉]说: 那日离开桃花岛时，师父和*靖哥哥、老顽童他们乘坐的*那艘大船，船底木材却并非*用铁钉钉结，而是以生胶绳*索胶缠在一起，泊在港中之*时固是一艘极为华丽的花船*，但如驶入大海，给浪涛一*打，必致沉没。 
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1830,0,1);   --  1(1):[AAA]说: 啊？可是黄岛主为什么要做*这样的一艘船呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1831,56,0);   --  1(1):[黄蓉]说: 他本想将我妈妈的遗体放入*船中，驾船出海，当波涌舟*碎之际，按玉箫吹起《碧海*潮生曲》，与我妈妈一齐葬*身万丈洪涛之中，如此潇洒*倜傥以终此一生。只是顾念*我尚年幼，才迟迟没有出海*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1832,0,1);   --  1(1):[AAA]说: 原来如此啊，真不愧是东邪*！可是你们怎么又到了这里*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1833,69,0);   --  1(1):[洪七公]说: 那船在海上沉没以后，我们*被欧阳锋救上他的船。欧阳*锋逼着老顽童默写九阴真经*，结果老顽童不肯，硬是跳*了海。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1834,0,1);   --  1(1):[AAA]说: 啊？*那，那周老前辈岂不是……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1835,69,0);   --  1(1):[洪七公]说: 唉，现在生死不知啊。欧阳*锋又逼着我这傻徒弟给他写*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1836,0,1);   --  1(1):[AAA]说: 郭大哥，你把这真经写给他*，不知他又要害多少人了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1837,55,0);   --  1(1):[郭靖]说: 我给他写的是假的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1838,0,1);   --  1(1):[AAA]说: 假的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1839,55,0);   --  1(1):[郭靖]说: 我依照洪师父所传的诀窍，*将经文倒乱一番，经中说"*手心向天"，我改成"脚底向*天"，"脚踏实地"改成为"手*撑实地"，经中说是"气凝丹*田"，我就改成"气凝胸口"*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1840,0,1);   --  1(1):[AAA]说: 哈哈，郭大哥，真有你的，*这下老毒物可上了大当了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1841,69,0);   --  1(1):[洪七公]说: 老毒物得了真经之后，就要*放火烧船，幸得蓉儿赶来，*我们才死里逃生。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1842,56,0);   --  1(1):[黄蓉]说: 师父太仁慈了，非要救欧阳*叔侄，结果遭了欧阳锋的暗*算，被打成重伤。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1843,0,1);   --  1(1):[AAA]说: 这欧阳锋，好歹毒！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1844,69,0);   --  1(1):[洪七公]说: 我给毒蛇咬中，又中了西毒*蛤蟆功的掌力。我拚着全身*功力，才逼出了蛇毒，终究*也没干净，就算延得数年老*命，但毕生武功已毁于一旦*。我现在只是个糟老头儿，*再也没半点功夫了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1845,0,1);   --  1(1):[AAA]说: 洪帮主且放宽心，我一定想*办法让您老恢复功力。现下*当务之急，是尽快离开这里*。郭大哥、黄姑娘，你们有*何打算？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1846,55,0);   --  1(1):[郭靖]说: 听说金人要去皇宫盗取武穆*遗书，此事关系国家安危，*我要去阻止金人。另外，我*还想回我的老家牛家村去看*看。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1847,56,0);   --  1(1):[黄蓉]说: 靖哥哥去哪，我就跟着去哪*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1848,0,1);   --  1(1):[AAA]说: 那咱们先离开此岛，再作计*较。我若有空，定去相助郭*大哥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(32,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [15]
    instruct_3(32,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [3]
    instruct_3(32,5,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [5]
    instruct_3(32,2,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [2]
    instruct_3(32,1,0,0,0,0,0,7972,7972,7972,-2,-2,-2);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [1]
    instruct_3(32,0,0,0,0,0,468,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [0]
    instruct_3(23,0,1,0,485,0,0,6126,6148,6126,-2,-2,-2);   --  3(3):修改事件定义:场景[洪七公居]:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

