--function oldevent_382()
    instruct_1(1501,0,1);   --  1(1):[AAA]说: 石兄弟，你终于接了这赏善*罚恶令啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1502,38,0);   --  1(1):[石破天]说: 是啊。那两个使者不是坏人*，他们还请我喝酒呢，还说*让我去侠客岛喝什么粥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1503,0,1);   --  1(1):[AAA]说: 那你现在有什么打算？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1504,38,0);   --  1(1):[石破天]说: 我会按照张三和李四两位哥*哥说的，按时去侠客岛喝他*们的粥。不过我现在有些担*心雪山派的白师父，他好像*也在为赏善罚恶令的事情烦*恼呢。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1505,0,1);   --  1(1):[AAA]说: ＜这侠客岛如此神秘，说不*定就有天书的消息，我是不*是也应该想办法去侠客岛呢*？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,384,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(39,10,0,0,0,0,0,5144,5144,5144,-2,-2,-2);   --  3(3):修改事件定义:场景[凌霄城]:场景事件编号 [10]
    instruct_3(39,11,0,0,0,0,0,5150,5150,5150,-2,-2,-2);   --  3(3):修改事件定义:场景[凌霄城]:场景事件编号 [11]
    instruct_3(39,13,0,0,0,0,385,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[凌霄城]:场景事件编号 [13]
    instruct_3(39,12,0,0,0,0,385,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[凌霄城]:场景事件编号 [12]
--end

