--function oldevent_911()
    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,83,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
    instruct_3(-2,84,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [84]
    instruct_3(-2,85,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [85]
    instruct_13();   --  13(D):重新显示场景
    instruct_30(28,28,15,28);   --  30(1E):主角走动28-28--15-28
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3534,0,1);   --  1(1):[AAA]说: 你就是东方不败？*＜怎麽看起来像个娘们？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3535,27,0);   --  1(1):[东方不败]说: 啊！你便是到梅庄救走任我*行的那小子．我早想见你一*见，看看是怎样的一位俊俏　*郎君．***哼，依我看也是平平无奇，*比起我那莲弟来，可差的远*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3692,0,1);   --  1(1):[AAA]说: 任教主、向大哥、令狐大哥*、任大小姐，你们怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3537,26,0);   --  1(1):[任我行]说: 还好，死不了。这东方不败*已经练成葵花宝典上的武功*，你们可千万小心。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3693,27,0);   --  1(1):[东方不败]说: 任教主，我看你是老糊涂了*。你的吸星大法，加上令狐*冲的独孤九剑，都不是我的*对手，你却让这个小娃娃来*送死，嘻嘻嘻……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3694,245,1);   --  1(1):[???]说: ＜她一笑起来好恶心……我*最讨厌断背山了！＞，你这*个不男不女的老妖怪，我来*会会你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3546,27,0);   --  1(1):[东方不败]说: 大胆！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(54,4,0,0) ==false then    --  6(6):战斗[54]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,0,1,0,895,0,0,5910,5910,5910,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,1,0,895,0,0,5908,5908,5908,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,94,1,0,896,0,0,7218,7218,7218,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [94]
    instruct_3(-2,86,0,0,0,0,0,7966,7966,7966,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [86]
    instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,95,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [95]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3547,26,0);   --  1(1):[任我行]说: 东方不败，今日终於．．．*终於教你落在我手里．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3548,27,0);   --  1(1):[东方不败]说: 任教主，终究是．．是．．*终究是．．是我输了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3549,26,0);   --  1(1):[任我行]说: 哈！哈！*你这大号，可得改一改罢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3550,27,0);   --  1(1):[东方不败]说: 倘若单打独斗，*你们是不能打败我的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3551,26,0);   --  1(1):[任我行]说: 不错，你武功比我高，*我很是佩服．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3552,27,0);   --  1(1):[东方不败]说: 你能这麽说，*足见男子汉大丈夫气概．**唉，冤孽，冤孽，我练了那*”葵花宝典”，照着宝典上*的秘方，自宫练气，炼丹服*药，渐渐的胡子没有了，说*话声音变了，性子也变了．**我从此不爱女子，把七个小*妾都杀了，却．．．却把全*副心意放在莲弟身上．*倘若我生为女儿身，那就好*了．*任教主，你快把我杀了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3553,26,0);   --  1(1):[任我行]说: 我现在不想杀你了，*我也找个地方安养你好了．**来人啊，把他带下去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3554,27,0);   --  1(1):[东方不败]说: 你好狠毒！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,86,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [86]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(93,1);   --  2(2):得到物品[葵花宝典][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3555,33,0);   --  1(1):[黑白子]说: 恭喜教主，今日诛却大逆．*从此我教在教主庇荫之下，*扬威四海．*教主千秋万载，一统江湖．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3695,26,0);   --  1(1):[任我行]说:  胡说八道！什麽千秋万载*？哈！哈！哈！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3696,35,0);   --  1(1):[令狐冲]说: ＜坐在这位子上的，是任我*行还是东方不败，却有什么*分别？＞*（盈盈，我……想离开这里*……）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3697,73,0);   --  1(1):[任盈盈]说: （冲哥，我知道你的心思。*如今东方不败已死，我也没*有留在黑木崖上的必要，我*们一起走吧，离开这里，找*一个没有人的地方，只有你*和我……）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3698,35,0);   --  1(1):[令狐冲]说: （好盈盈，你果然是我的知*己，我们这就悄悄走吧。）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,96,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [96]
    instruct_3(-2,97,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [97]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3562,26,0);   --  1(1):[任我行]说: 小兄弟，这一役诛奸复位，*你实占首功．不如加入我日*月神教，我可以给你个副教*主做做，待我百年之后，这*教主的位置就是你的，如何*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3699,0,1);   --  1(1):[AAA]说: 在下还要继续寻找十四天书*，加入神教之事万难从命。*还望任教主话复前言，告诉*我《笑傲江湖》一书的所在*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3700,26,0);   --  1(1):[任我行]说: 哼！就算你得到了十四天书*，你也未必当的成武林盟主*。当武林盟主要靠实力的！**《笑傲江湖》一书，就在*岳不群手上。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3701,0,1);   --  1(1):[AAA]说: 哦？此话当真？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3702,26,0);   --  1(1):[任我行]说: 当然是真的！《笑傲江湖》*一书一直在华山派，当年我*日月神教曾经为了此书，血*洗华山，不幸中了五岳剑派*的诡计，十长老尽数困死在*华山思过崖。此后《笑傲江*湖》一书便不知所踪。不过*经过老夫的明查暗访，终于*得知此书根本没离开过华山*派，就在岳不群手上。所谓*“不知所终”，不过是这个*伪君子散布的谣言罢了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3703,0,1);   --  1(1):[AAA]说: 多谢了，我这就上华山！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,35,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,16,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(57,1,1,0,913,0,0,5696,5696,5696,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [1]
    instruct_3(57,0,1,0,0,0,0,5694,5694,5694,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [0]
    instruct_3(57,32,1,0,900,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [32]
--end

