--function oldevent_503()
    instruct_37(-1);   --  37(25):增加道德-1
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(2020,60,0);   --  1(1):[欧阳锋]说: 克儿、克儿，你怎么啦？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2021,61,0);   --  1(1):[欧阳克]说: 我，啊，我的腿，叔叔，你*杀了我吧，我好痛苦啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2022,0,1);   --  1(1):[AAA]说: 欧阳前辈，令侄怎么了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2023,60,0);   --  1(1):[欧阳锋]说: 小子，你来的正好，那可恶*的黄蓉，设下圈套害我侄儿*，这么大的巨石，怎么办，*怎么办……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2024,0,1);   --  1(1):[AAA]说: ＜这欧阳锋武功卓绝，我要*是能帮他救了他侄儿，定可*以得他传授一招半式，那可*是受用不尽啊＞欧阳前辈，*你别着急，咱们一起来想想*办法……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2025,0,1);   --  1(1):[AAA]说: 有了，咱们等涨潮之时，利*用海水浮力，定可将巨石搬*起。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2026,60,0);   --  1(1):[欧阳锋]说: 浮力？好像有道理，克儿，*你再忍一忍，叔叔这就来救*你……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,14,0,0,0,0,0,7972,7972,7972,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2027,60,0);   --  1(1):[欧阳锋]说: 克儿，克儿，你终于得救了*，你还好吧，我的克儿……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2028,61,0);   --  1(1):[欧阳克]说: 叔叔，我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2029,0,1);   --  1(1):[AAA]说: 欧阳先生不必担心，令侄的*性命已可保住，至于这腿伤*，修养几个月也能康复。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2030,60,0);   --  1(1):[欧阳锋]说: 你是我侄儿的救命恩人，我*欧阳锋向来不愿欠别人的，*现在我就将我西域白驼山的*绝学白驼雪山掌教给你吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(104,1);   --  2(2):得到物品[白驼雪山掌][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2031,246,1);   --  1(1):[???]说: 多谢欧阳先生。＜为啥不传*我蛤蟆功呢，看来他的看家*本领都要传给他侄儿，早知*如此，还不如不救欧阳克…*…＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2032,60,0);   --  1(1):[欧阳锋]说: 我要带克儿回去养伤，还要*找郭靖黄蓉算帐，哼！好在*我已得到九阴真经，很快就*会天下无敌啦，哈哈。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(32,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [15]
    instruct_3(32,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [3]
    instruct_3(32,5,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [5]
    instruct_3(32,2,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [2]
    instruct_3(32,1,0,0,0,0,0,7972,7972,7972,-2,-2,-2);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [1]
    instruct_3(32,0,0,0,0,0,504,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2033,0,1);   --  1(1):[AAA]说: ＜他已得到九阴真经？真的*假的呀……＞
    instruct_0();   --  0(0)::空语句(清屏)
--end

