--function oldevent_453()

    if instruct_16(30,0,12) ==true then    --  16(10):队伍是否有[郭靖]否则跳转到:Label0
        instruct_1(1670,55,1);   --  1(1):[郭靖]说: 五师父好。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1675,134,0);   --  1(1):[???]说: 靖儿，不要为这花花世界所*迷惑，人要寻找自己内心最*真实的快乐。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0


    if instruct_16(55,0,11) ==true then    --  16(10):队伍是否有[郭靖]否则跳转到:Label1
        instruct_1(1670,55,1);   --  1(1):[郭靖]说: 五师父好。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1675,134,0);   --  1(1):[???]说: 靖儿，不要为这花花世界所*迷惑，人要寻找自己内心最*真实的快乐。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(1659,134,0);   --  1(1):[???]说: 哈哈，我就是笑弥陀张阿生
    instruct_0();   --  0(0)::空语句(清屏)
--end

