--function oldevent_555()
    instruct_1(2350,207,0);   --  1(1):[???]说: 今日阳光明媚，*一群乞丐开会，*不是英雄好汉，*请退！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(2351,0,1);   --  1(1):[AAA]说: 我就来试试丐帮打狗大阵！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(82,6,0,0) ==false then    --  6(6):战斗[82]是则跳转到:Label1
        instruct_1(2350,207,0);   --  1(1):[???]说: 今日阳光明媚，*一群乞丐开会，*不是英雄好汉，*请退！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2339,207,0);   --  1(1):[???]说: 阁下武功了得，我们乔帮主*一定会很欣赏你的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
--end

