--function oldevent_513()
    instruct_1(2150,78,0);   --  1(1):[???]说: 什么人，找死么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2151,0,1);   --  1(1):[AAA]说: 啊……你……你便是……铁*尸梅超风
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2152,78,0);   --  1(1):[???]说: 嘿嘿嘿，哈哈哈，你小子眼*里倒好，哈哈哈，你是来杀*我的么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2153,0,1);   --  1(1):[AAA]说: ＜这梅超风武功极高，不过*听说双目已盲。我寻找天书*正愁没有厉害的帮手，如果*她能帮我……＞，前辈莫怪*，我只是无意间闯入此山洞*，打扰了前辈练功，还望见*谅。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2154,78,0);   --  1(1):[???]说: 没事就快滚吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2155,0,1);   --  1(1):[AAA]说: 前辈一人独居此间，恐怕生*活上多有不便，不如与在下*同行，也好有个照应。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2156,78,0);   --  1(1):[???]说: 哈哈哈，梅超风从不需要人*照顾。你到底有什么企图，*明说吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2157,0,1);   --  1(1):[AAA]说: 不瞒前辈，在下久仰前辈的*九阴白骨爪天下无双，企盼*前辈传授一二。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2158,78,0);   --  1(1):[???]说: 想做我徒弟？＜贼汉子死了*，我的眼睛瞎了，今后还真*不知道该怎么办，这小子不*知可靠不可靠……＞。想做*我徒弟也不难，去帮我办件*事。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2159,0,1);   --  1(1):[AAA]说: 前辈但有吩咐，无不遵从。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2160,78,0);   --  1(1):[???]说: 杀了江南七怪！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2161,0,1);   --  1(1):[AAA]说: 这……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2162,78,0);   --  1(1):[???]说: 江南七怪和我有不共戴天之*仇，只要你把他们杀了，我*就传你九阴白骨爪！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,514,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(6,0,1,0,515,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[蒙古包]:场景事件编号 [0]
--end

