--function oldevent_1035()
    instruct_1(3885,207,0);   --  1(1):[???]说: 听说武林至尊的屠龙宝刀在*金毛狮王谢逊的手上。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3886,207,4);   --  1(1):[???]说: 可是那谢逊在哪里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3887,207,0);   --  1(1):[???]说: 据说只有他的义子张无忌知*道。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3888,207,4);   --  1(1):[???]说: 那张无忌又在何处？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3889,207,0);   --  1(1):[???]说: 听说已经流落到西域了……
    instruct_0();   --  0(0)::空语句(清屏)
--end

