--function oldevent_423()
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_13();   --  13(D):重新显示场景
    instruct_25(29,24,29,17);   --  25(19):场景移动29-24--29-17
    instruct_1(1620,0,1);   --  1(1):[AAA]说: 咦？怎么两个石破天？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1621,38,0);   --  1(1):[石破天]说: 老伯伯，你也来啦
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1622,164,0);   --  1(1):[???]说: 你，你，你们俩……哈哈，*居然是两个长得一摸一样的*小子！怪不得我觉得这个狗*杂种怪怪的，原来是骗我，*看我怎么收拾你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1623,38,0);   --  1(1):[石破天]说: 不可！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1624,164,0);   --  1(1):[???]说: 你说什么？你是不是求我不*要杀他？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1625,38,0);   --  1(1):[石破天]说: 我知道老伯伯为人最好了，*我想求老伯伯把这个人带在*身边，教他学好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1626,164,0);   --  1(1):[???]说: 你，这，这算什么，这可不*行！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1627,43,0);   --  1(1):[白万剑]说: 堂堂摩天崖主人，居然说话*不算么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1628,164,0);   --  1(1):[???]说: 我……好，就这么定了，小*子，跟我走，我好好教教你*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1629,238,0);   --  1(1):[???]说: 天哥，等等我——
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1630,38,0);   --  1(1):[石破天]说: 白师父，我不是要有意抢你*的掌门的，你别生气。侠客*岛的两位使者大哥约我去喝*粥，还说有什么书可以看，*我要走了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1631,0,1);   --  1(1):[AAA]说: ＜侠客岛有书？我应该去侠*客岛看看，不知道哪里还能*弄到赏善罚恶令呢？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(94,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[长乐帮]:场景事件编号 [9]
    instruct_3(94,2,1,0,425,0,0,7070,7070,7070,-2,-2,-2);   --  3(3):修改事件定义:场景[长乐帮]:场景事件编号 [2]
    instruct_25(29,24,29,24);   --  25(19):场景移动29-24--29-24
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

