--function oldevent_752()
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,1,0,753,0,0,5896,5896,5896,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,1,0,754,0,0,7624,7624,7624,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_35(35,0,47,700);   --  35(23):设置令狐冲武功0:独孤九剑攻击力700
    instruct_47(35,50);   --  47(2F):令狐冲增加攻击力50
    instruct_13();   --  13(D):重新显示场景
    instruct_30(48,36,19,37);   --  30(1E):主角走动48-36--19-37
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2990,0,1);   --  1(1):[AAA]说: 令狐兄，好久不见了，这位*老前辈是？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2991,249,0);   --  1(1):[???]说: 不要问我的姓名，也不要和*任何人提起你们见过我。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2992,0,1);   --  1(1):[AAA]说: 既然如此，在下就不多问了*。令狐兄，一向可好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2993,35,0);   --  1(1):[令狐冲]说: 还好。上次下山犯了门规，*被师父罚到此处面壁思过。*正好巧遇老前辈，受益匪浅*啊。只是好久不见小师妹了*，有些想念。她好久没来了*，是生病了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2994,0,1);   --  1(1):[AAA]说: 岳姑娘？令狐兄不必挂怀，*岳姑娘很好，和林兄弟玩得*很开心。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2995,35,0);   --  1(1):[令狐冲]说: 你是说……？哦……唉……*林师弟和他年纪相当……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2996,249,0);   --  1(1):[???]说: 冲儿，我刚教你得剑法，和*这位少侠过招试试吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2997,35,0);   --  1(1):[令狐冲]说: 是，太师叔！少侠，你准备*一下，咱们比试比试！
    instruct_0();   --  0(0)::空语句(清屏)
--end

