--function oldevent_295()
    instruct_1(975,10,0);   --  1(1):[范遥]说: 怎么会这样！怎么会这样！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(976,0,1);   --  1(1):[AAA]说: 你是……？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(977,10,0);   --  1(1):[范遥]说: 这位少侠，你可知道，我明*教为何会变成这样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(978,0,1);   --  1(1):[AAA]说: 这是六大派……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(979,10,0);   --  1(1):[范遥]说: 我得到信息，就马上赶来，*没想到还是完了一步。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(976,0,1);   --  1(1):[AAA]说: 你是……？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(980,10,0);   --  1(1):[范遥]说: 我乃明教光明右使范遥。这*位少侠，你可否帮我一个忙*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(981,0,1);   --  1(1):[AAA]说: 当然可以，前辈请讲。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(982,10,0);   --  1(1):[范遥]说: 我明教还有紫杉龙王和金毛*狮王两位，能否麻烦小兄弟*去把他们请来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(983,0,1);   --  1(1):[AAA]说: 他们在哪里啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(984,10,0);   --  1(1):[范遥]说: 这……我也不太清楚，咱们*分头找找吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,296,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(73,2,0,0,0,0,297,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[灵蛇岛]:场景事件编号 [2]
--end

