--function oldevent_255()
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(720,165,0);   --  1(1):[???]说: 他应该已经睡了吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(721,81,0);   --  1(1):[???]说: 肯定睡下了，这小鬼每天这*个时候都会睡的很香。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(717,165,0);   --  1(1):[???]说: 真儿，我们这场戏一定要做*的真，不能让他起丝毫的疑*心。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(718,81,0);   --  1(1):[???]说: 爹，你就放心吧。你看我这*些天伺候那小鬼，他已对我*神魂颠倒，一点都不怀疑，*呵呵呵……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(719,165,0);   --  1(1):[???]说: 恩，明天咱们就出发，前往*冰火岛。武林中人梦寐以求*的屠龙宝刀就要成为我朱长*龄的了，哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(722,0,1);   --  1(1):[AAA]说: ＜原来他们父女诱骗张无忌*，是为了屠龙刀啊，我是不*是该通知张无忌呢？＞
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_11(0,22) ==true then    --  11(B):是否住宿否则跳转到:Label0
        instruct_37(1);   --  37(25):增加道德1
        instruct_1(723,0,1);   --  1(1):[AAA]说: 我去找找无忌吧
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,3,-2,0,256,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        do return; end
    end    --:Label0

    instruct_37(-2);   --  37(25):增加道德-2
    instruct_1(724,0,1);   --  1(1):[AAA]说: ＜都说这屠龙宝刀是武林至*尊，说不定和天书有关，我*不妨看看这场戏，说不定能*得到什么好处……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(725,165,0);   --  1(1):[???]说: 什么人！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,19,0,0,0,0,0,5752,5752,5752,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,20,0,0,0,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,22,0,0,0,0,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(726,165,0);   --  1(1):[???]说: 你是何人？要坏我的好事么*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(727,0,1);   --  1(1):[AAA]说: 没有没有。误会误会，我是*想和你们一起干。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(728,165,0);   --  1(1):[???]说: 哼！宝刀只有一个，你还想*分一半么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(729,0,1);   --  1(1):[AAA]说: 我不是要宝刀……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(730,9,0);   --  1(1):[张无忌]说: 啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(731,81,0);   --  1(1):[???]说: 不好，是无忌，他好像听到*了我们谈话，往山那边跑了
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(732,165,0);   --  1(1):[???]说: 快追！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,5,0,0,0,0,0,5752,5752,5752,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,0,0,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_19(44,19);   --  19(13):主角移动至2C-13
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_25(44,17,44,17);   --  25(19):场景移动44-17--44-17
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(733,9,0);   --  1(1):[张无忌]说: 你们，你们居然骗我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(734,81,0);   --  1(1):[???]说: 好弟弟，快过来，姐姐疼你
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(735,9,0);   --  1(1):[张无忌]说: 不要，你们不要过来，你们*……啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(736,0,1);   --  1(1):[AAA]说: 小心悬崖！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(737,165,0);   --  1(1):[???]说: 我的宝刀，你不能死，我…*…啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(738,81,0);   --  1(1):[???]说: 爹——！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,23,0,0,0,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_19(45,18);   --  19(13):主角移动至2D-12
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(739,81,0);   --  1(1):[???]说: 爹爹……为了抓那个小鬼，*自己也坠入山崖……爹爹…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(740,244,1);   --  1(1):[???]说: 朱姑娘，不要难过了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(741,81,0);   --  1(1):[???]说: 又不是你没了父亲，你当然*不难过了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(742,0,1);   --  1(1):[AAA]说: 我们去找找他们吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(743,81,0);   --  1(1):[???]说: 我从今后就孤苦伶仃一个人*了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(744,244,1);   --  1(1):[???]说: 朱姑娘，跟我一起走吧，去*这附近的山谷找一找，说不*定令尊吉人天相……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(745,81,0);   --  1(1):[???]说: 呜呜……*好吧……*这悬崖下面应该是昆仑山谷*，说不定昆仑派会有人见到*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(746,0,1);   --  1(1):[AAA]说: ＜没找到天书，得到了美女*，也不错啊……＞
    instruct_3(68,3,1,0,257,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [3]
    instruct_3(68,13,1,0,257,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [13]
    instruct_3(11,106,0,0,0,0,290,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [106]
    instruct_3(11,107,0,0,0,0,290,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [107]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(33,23,0,0,0,0,309,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [23]
    instruct_3(33,24,0,0,0,0,309,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [24]
    instruct_3(33,25,0,0,0,0,309,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [25]
    instruct_3(33,27,0,0,0,0,309,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [27]
    instruct_3(33,26,0,0,0,0,309,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [26]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,62,1,0,982,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [62]

    if instruct_20(21,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_10(81);   --  10(A):加入人物[朱九真]
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_1(12,81,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(70,46,1,0,177,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [46]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

