--function oldevent_1()
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1,1,0);   --  1(1):[胡斐]说: 小兄弟，到此寒天雪地，*不知有何指教？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2,0,1);   --  1(1):[AAA]说: 我正在寻找一些书籍，无意*间路过此地，敢问兄台尊姓*大名？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3,1,0);   --  1(1):[胡斐]说: 在下胡斐。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4,0,1);   --  1(1):[AAA]说: 哦？就是人称"雪山飞狐"的*胡斐吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(5,1,0);   --  1(1):[胡斐]说: 不敢，正是在下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(6,0,1);   --  1(1):[AAA]说: 听说大哥刀法变幻莫测，轻*功也有如飞天狐狸般的敏捷*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(7,1,0);   --  1(1):[胡斐]说: 江湖上的朋友过誉了。唉…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(8,0,1);   --  1(1):[AAA]说: 胡大哥似乎有什么心事？不*妨说出来，看看小弟能否帮*上什么忙。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(9,1,0);   --  1(1):[胡斐]说: 不瞒贤弟。我有两件心事，*一是要报杀父之仇，二是要*寻找我家丢失的刀谱。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,184) ==true then    --  9(9):是否要求加入?否则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(10,0,1);   --  1(1):[AAA]说: 这两件事的确不好办。我看*不如这样吧，我正在寻找一*些书，要在江湖上到处走动*，胡大哥如果不嫌弃，不妨*与小弟同行，说不定可以得*到你想要的消息。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(11,1,0);   --  1(1):[胡斐]说: 既然如此，恭敬不如从命。
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_20(0,92) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(12,1,0);   --  1(1):[胡斐]说: 你的队伍已满，我就直接去*小村吧。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(0,-2,0,0,0,0,0,0,0,0,0,-2,-2);   --  3(3):修改事件定义:场景[胡斐居]:当前场景事件编号
            instruct_3(70,5,1,0,101,0,0,5166,5166,5166,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [5]
            instruct_3(3,9,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [9]
            instruct_3(3,12,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [12]
            instruct_3(3,11,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [11]
            instruct_3(3,10,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [10]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_10(1);   --  10(A):加入人物[胡斐]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(0,-2,0,0,0,0,0,0,0,0,0,-2,-2);   --  3(3):修改事件定义:场景[胡斐居]:当前场景事件编号
        instruct_3(3,9,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [9]
        instruct_3(3,12,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [12]
        instruct_3(3,11,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [11]
        instruct_3(3,10,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [10]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(13,0,1);   --  1(1):[AAA]说: 这两件事的确不好办。我也*无能为力，在下告辞。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(0,-2,-2,-2,2,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[胡斐居]:当前场景事件编号
--end

