--function oldevent_207()

    if instruct_16(77,46,0) ==false then    --  16(10):队伍是否有[萧中慧]是则跳转到:Label0
        instruct_1(460,189,0);   --  1(1):[???]说: 小子，你既然能得到这鸳鸯*双刀，就一定见过我的女儿*，她在哪？
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_5(0,37) ==true then    --  5(5):是否选择战斗？否则跳转到:Label1
            instruct_37(-2);   --  37(25):增加道德-2
            instruct_1(461,0,1);   --  1(1):[AAA]说: 你女儿？恐怕早已是我的刀*下亡魂了！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(462,189,0);   --  1(1):[???]说: 啊呀呸，你这恶贼，快还我*女儿命来！
            instruct_0();   --  0(0)::空语句(清屏)

            if instruct_6(137,3,0,0) ==false then    --  6(6):战斗[137]是则跳转到:Label2
                instruct_15(0);   --  15(F):战斗失败，死亡
                do return; end
            end    --:Label2

            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
        end    --:Label1

        do return; end
    end    --:Label0

    instruct_37(1);   --  37(25):增加道德1
    instruct_1(463,77,1);   --  1(1):[???]说: 爹——我终于找到鸳鸯双刀*了！女儿厉害吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(464,189,0);   --  1(1):[???]说: 呵呵，这位少侠，我这女儿*一定给你添了不少麻烦吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(465,77,1);   --  1(1):[???]说: 什么添麻烦，是我帮了他的*大忙才对！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(466,248,1);   --  1(1):[???]说: 是是是，令爱天资聪颖，身*手不凡，的确帮了我不少忙*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(467,189,0);   --  1(1):[???]说: 哈哈哈，老夫真是羡慕你们*年轻人啊。我这里有一套刀*法，就作为给你们的贺礼吧*。哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(140,1);   --  2(2):得到物品[夫妻刀法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

