--function oldevent_504()
    instruct_37(-3);   --  37(25):增加道德-3
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_37(-2);   --  37(25):增加道德-2
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_25(34,20,30,21);   --  25(19):场景移动34-20--30-21
    instruct_1(1849,61,0);   --  1(1):[欧阳克]说: 妹子，你在这里练功夫么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1850,56,0);   --  1(1):[黄蓉]说: ＜靖哥哥受了重伤，还需五*天五夜方能痊愈。偏巧在这*时候碰见这个姓欧阳的，真*是倒霉，怎生撒个大谎，将*他远远骗走＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1851,61,0);   --  1(1):[欧阳克]说: 妹子，出来罢，躲在这里气*闷得紧。我知道那姓郭的小*子已经深受重伤，妹子，你*就依了我吧，咱俩做个长久*夫妻。只要你答应我，我保*证不加害这个姓郭的小子。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2034,0,1);   --  1(1):[AAA]说: ＜郭靖，黄蓉，还有欧阳克*，他们在做什么？＞，欧阳*兄，好久不见啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2035,61,0);   --  1(1):[欧阳克]说: 是你啊，来得正好，帮我解*决这个姓郭的！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2036,56,0);   --  1(1):[黄蓉]说: 小子，你想知道《射雕英雄*传》的下落吗？帮我打发了*这只小蛤蟆，我就告诉你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2037,0,1);   --  1(1):[AAA]说: ＜莫非她真的知道？我该怎*么办？一边是北丐的徒弟，*东邪的女儿，一边是西毒的*侄子，我到底该帮谁呢？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2038,56,0);   --  1(1):[黄蓉]说: 这《射雕英雄传》的下落只*有我爹知道，你要是不救我*，就再也别想拿到啦！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2039,0,1);   --  1(1):[AAA]说: ＜没办法，还是拿书重要＞*，欧阳克，你作恶多端，今*日我就要送你归西！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2040,61,0);   --  1(1):[欧阳克]说: 啊，兄弟，你？！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(178,4,0,0) ==false then    --  6(6):战斗[178]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,1,1,0,0,0,0,5154,5154,5154,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_19(30,21);   --  19(13):主角移动至1E-15
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2041,55,0);   --  1(1):[郭靖]说: 多谢兄弟救命之恩。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2042,56,0);   --  1(1):[黄蓉]说: 靖哥哥，你不用谢他，他还*不是为了《射雕英雄传》！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2043,0,0);   --  1(1):[AAA]说: 既然你都知道，那就告诉我*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2044,57,0);   --  1(1):[黄药师]说: 什么人大胆，敢逼问我黄老*邪的女儿！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,8,0,0,0,0,0,8238,8238,8238,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2045,247,1);   --  1(1):[???]说: ＜不好，黄老邪来了＞，黄*岛主误会了，刚刚我还为了*救令爱，亲手杀死欧阳克！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2046,57,0);   --  1(1):[黄药师]说: 蓉儿，可有此事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2047,56,0);   --  1(1):[黄蓉]说: 是他救的不假。不过他是为*了《射雕英雄传》！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2048,57,0);   --  1(1):[黄药师]说: 《射雕英雄传》？我也听说*有这样一本奇书，可没有人*知道在哪里！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2049,0,1);   --  1(1):[AAA]说: 啊？难道黄岛主不知道？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2050,57,0);   --  1(1):[黄药师]说: 我曾听中神通重阳真人提起*过此书。自从重阳真人仙去*之后，再无人知晓！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2051,0,1);   --  1(1):[AAA]说: 黄姑娘，你不是说……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2052,56,0);   --  1(1):[黄蓉]说: 对啊，我说我爹知道，我爹*的确听重阳真人说起过，怎*么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2053,245,1);   --  1(1):[???]说: 你——＜又上了这鬼丫头的*当，这下可是得罪西毒了，*唉……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2054,57,0);   --  1(1):[黄药师]说: 蓉儿，靖儿怎么了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2055,56,0);   --  1(1):[黄蓉]说: 靖哥哥和我得知金人要偷武*穆遗书，我们就连夜赶到皇*宫保护，没想到西毒欧阳锋*竟然帮着金人，以蛤蟆功掌*力震伤靖哥哥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2056,57,0);   --  1(1):[黄药师]说: 既然如此，就回桃花岛养伤*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2057,56,0);   --  1(1):[黄蓉]说: 那再好也没有，快走吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2058,0,1);   --  1(1):[AAA]说: ＜此地不宜久留，我得赶快*走＞！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2059,60,0);   --  1(1):[欧阳锋]说: 小子，哪里走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,6,0,0,0,0,0,8218,8218,8218,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2060,0,1);   --  1(1):[AAA]说: ＜倒霉真倒霉，债主来了！＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2061,60,0);   --  1(1):[欧阳锋]说: 啊，克儿，你怎么了？克儿*！谁，是谁杀了克儿！是不*是你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2062,247,1);   --  1(1):[???]说: ＜完了，怎么办，总不能直*接承认是我干得呀？＞这个*，这个，是，是，是黄药师*!
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2063,60,0);   --  1(1):[欧阳锋]说: 黄药师为什么要杀我的克儿*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2064,0,1);   --  1(1):[AAA]说: ＜谎话编到底吧＞，是这样*的，郭靖不知怎么受了重伤*，黄蓉正在此为他疗伤。你*侄儿看见后，欲伤害郭靖，*他想和黄姑娘……恩，那个*，正好黄药师赶到，就杀死*了你的侄儿。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2065,60,0);   --  1(1):[欧阳锋]说: 此话当真？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2066,244,1);   --  1(1):[???]说: 千真万确。我路过此地，全*都看在眼里。我与欧阳兄是*莫逆之交，本想上前相助，*可是以我这微末的武功，怎*么能是黄老邪的对手呢？所*以等他们走后才敢出来，准*备装殓欧阳兄的尸身。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2067,60,0);   --  1(1):[欧阳锋]说: ＜郭靖的确被我掌力震伤，*我那克儿一直喜欢黄老邪的*丫头，克儿身上所受的伤似*乎的确是桃花岛的武功，看*来这小子所言不虚＞，克儿*，我的克儿，我本想把我一*身武功都传授给你，没想到*你这么早就走了，黄老邪，*你等着！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2068,0,1);   --  1(1):[AAA]说: ＜欧阳克已死，欧阳锋的武*功没了传人，正是我的好机*会呀＞，欧阳先生，我也想*为令侄报仇，怎奈我武功低*微，难以如愿，求欧阳先生*收我为徒。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2069,60,0);   --  1(1):[欧阳锋]说: 收你为徒也未尝不可，不过*你要先替我办件事。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2070,0,1);   --  1(1):[AAA]说: 欧阳先生但有所差，晚辈定*当效劳。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2071,60,0);   --  1(1):[欧阳锋]说: 你去铁掌山找裘千仞，就说*是我让你去的，他自然就知*道了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2072,0,1);   --  1(1):[AAA]说: 铁掌水上飘裘千仞？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2073,60,0);   --  1(1):[欧阳锋]说: 没错，他的铁掌十分有用，*嘿嘿，你去找他吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2074,0,1);   --  1(1):[AAA]说: 有用？？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(48,0,1,0,505,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[铁掌山]:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

