--function oldevent_519()
    instruct_1(2193,53,0);   --  1(1):[段誉]说: 神仙姐姐……神仙姐姐……*我都听你的……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2194,0,1);   --  1(1):[AAA]说: 喂！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2195,53,0);   --  1(1):[段誉]说: 嘘，神仙姐姐面前，不要说*话这么大声，要斯文些……*咦？你是谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2196,0,1);   --  1(1):[AAA]说: 你就是段誉吧，钟灵姑娘托*我来找你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2197,53,0);   --  1(1):[段誉]说: 对了，钟姑娘，我差点忘了*，她还好吧？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(90,100,0) ==false then    --  16(10):队伍是否有[钟灵]是则跳转到:Label0
        instruct_1(2203,0,1);   --  1(1):[AAA]说: 请放心，钟姑娘现在很安全*。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2199,53,0);   --  1(1):[段誉]说: 哦，那我就放心了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2200,0,1);   --  1(1):[AAA]说: 段公子，我们走吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2201,53,0);   --  1(1):[段誉]说: 走？是啊，神仙姐姐，我得*走了，出来这么久，爹爹肯*定会派人四处找我的。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(-2,3,0,0,0,0,520,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,5,0,0,0,0,520,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,520,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,2,0,0,0,0,0,6752,6752,6752,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2202,0,1);   --  1(1):[AAA]说: 他的身法好快，完全看不清*楚，不知道是什么古怪步法*！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(2198,90,1);   --  1(1):[???]说: 段大哥放心，我没事，这位*大哥救了我。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2199,53,0);   --  1(1):[段誉]说: 哦，那我就放心了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2200,0,1);   --  1(1):[AAA]说: 段公子，我们走吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2201,53,0);   --  1(1):[段誉]说: 走？是啊，神仙姐姐，我得*走了，出来这么久，爹爹肯*定会派人四处找我的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,3,0,0,0,0,520,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,5,0,0,0,0,520,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,520,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,2,0,0,0,0,0,6752,6752,6752,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2202,0,1);   --  1(1):[AAA]说: 他的身法好快，完全看不清*楚，不知道是什么古怪步法*！
    instruct_0();   --  0(0)::空语句(清屏)
--end

