--function oldevent_293()
    instruct_26(40,9,3,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,10,3,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,12,3,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_37(-3);   --  37(25):增加道德-3
    instruct_1(964,0,1);   --  1(1):[AAA]说: 成昆，原来你在这里
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(965,18,0);   --  1(1):[成崑]说: 你是什么人？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(966,0,1);   --  1(1):[AAA]说: 我在光明顶听到了你的谈话*，对阁下的深谋远虑深感佩*服。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(967,18,0);   --  1(1):[成崑]说: 你都知道了？知道了也晚了*，现在没人能救得了明教了*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(968,0,1);   --  1(1):[AAA]说: 明教的生死与我无关，我只*想找天书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(969,18,0);   --  1(1):[成崑]说: 你要找十四天书？你想做武*林盟主？好小子，这样的话*，我们可以合作。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(970,0,1);   --  1(1):[AAA]说: 怎么合作？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(971,18,0);   --  1(1):[成崑]说: 明教现在还有些人不在光明*顶。当他们知道明教覆灭得*消息之后，一定会找六大派*寻仇。你可以从中帮帮忙。*六大派灭了明教，明教再灭*了六大派，这样中原武林就*是你我的天下了，到时还愁*找不到几本书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(972,0,1);   --  1(1):[AAA]说: 哈哈哈，果然够狠。不过我*武艺低微，如何能帮助明教*灭了六大派？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(973,18,0);   --  1(1):[成崑]说: 这是我研究多年得幻阴指法*，阴毒无比，传授给你吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(94,1);   --  2(2):得到物品[幻阴指法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,294,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(11,90,1,0,295,0,0,5334,5334,5334,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [90]
    instruct_3(11,94,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [94]
    instruct_3(11,102,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [102]
--end

