--function oldevent_259()
    instruct_14();   --  14(E):场景变黑
    instruct_37(1);   --  37(25):增加道德1
    instruct_3(68,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [3]
    instruct_3(68,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [13]
    instruct_13();   --  13(D):重新显示场景
    instruct_1(771,0,1);   --  1(1):[AAA]说: 咦？好像有人说话……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(29,27,29,15);   --  25(19):场景移动29-27--29-15
    instruct_1(772,12,0);   --  1(1):[殷天正]说: 你到底是什么人，怎么进入*我明教的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(773,18,0);   --  1(1):[成崑]说: 你问我成崑怎麽进来的？当*然是大摇大摆走进来的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(774,14,0);   --  1(1):[韦一笑]说: 你是混元霹雳手成崑，*谢法王的师父？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(775,18,0);   --  1(1):[成崑]说: 没错，*我就是那头笨狮的师父。**拜他的鲁莽所赐，你们和六*大派结下了这麽多梁子。*　　　　　　　　　　　*今天起明教就将化为灰烬，*也了结了我多年来的心愿。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(776,11,0);   --  1(1):[杨逍]说: 要是我猜的没错，这中间的*一切都是你苦心安排的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(777,18,0);   --  1(1):[成崑]说: 杨左使倒还蛮聪明的嘛。***没错，激起谢逊的愤怒，*让他到处乱杀人，*留下我的名字好激我现身，*到最後再故意让江湖人知道*其实是明教谢逊所为，引起*江湖各大派与明教间仇杀，*这一切都是我精心计画的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(778,14,0);   --  1(1):[韦一笑]说: 你为何要如此做？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(779,18,0);   --  1(1):[成崑]说: 要问就去问你们前任教主*阳顶天。我原本一桩美好的*姻缘却被他活生生拆散了，*明明是我爱妻，只因他当*上了魔教的大头子，就将我*爱妻霸占了去。*因此我心中便立下重誓：*只要我成崑还有一口气在，*定要让魔教永无宁日。*我立下此誓已有二十余年，*今日方见大功告成。**哈哈！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,104,1,0,260,0,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [104]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(780,9,0);   --  1(1):[张无忌]说: 成昆，你这奸贼！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(29,15,29,27);   --  25(19):场景移动29-15--29-27
    instruct_1(781,0,1);   --  1(1):[AAA]说: ＜这不是张无忌吗？他没死？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(29,27,29,22);   --  30(1E):主角走动29-27--29-22
    instruct_30(29,22,33,22);   --  30(1E):主角走动29-22--33-22
    instruct_30(33,22,33,15);   --  30(1E):主角走动33-22--33-15
    instruct_1(782,247,1);   --  1(1):[???]说: 兄弟，你还活着，真是太好*了
    instruct_3(-2,103,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [103]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(783,9,0);   --  1(1):[张无忌]说: 少侠是你啊，那日多亏了你*。我跳下山崖后，不但没死*，还因祸得福，另有一番奇*遇。稍后咱们再详谈，现在*先对付成昆，咦？成昆呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(784,0,1);   --  1(1):[AAA]说: 不好，让他跑了。兄弟，你*照顾一下明教的几位首脑，*我去追那成昆。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(785,9,0);   --  1(1):[张无忌]说: 这里交给我，你去追成昆吧*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,106,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [106]
    instruct_3(-2,107,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [107]
--end

