--function oldevent_322()
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,0,0,0,6368,6368,6368,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,3,0,0,0,0,0,6370,6370,6370,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,2,0,0,0,0,0,6098,6098,6098,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1159,178,0);   --  1(1):[???]说: 恩恩，好好……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1160,179,0);   --  1(1):[???]说: 到时候就……哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1161,177,0);   --  1(1):[???]说: 好，就这么办，走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1162,0,1);   --  1(1):[AAA]说: 这三个家伙鬼鬼祟祟，好像*有什么阴谋……
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
--end

