--function oldevent_210()
    instruct_67(22);   --  67(43):播放音效22
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_1(468,0,1);   --  1(1):[AAA]说: 咦！这是什麽声音？难道洞*中藏有怪物？待我进去看个*究竟。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(25,49,25,38);   --  30(1E):主角走动25-49--25-38
    instruct_1(469,0,1);   --  1(1):[AAA]说: 哇塞！鵰蛇大战，精彩！．*．．．咦！鵰兄似乎快不行*了，看我的！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(66,4,0,0) ==false then    --  6(6):战斗[66]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(210,8);   --  2(2):得到物品[食材][8]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(470,0,1);   --  1(1):[AAA]说: 这巨蟒还真难对付，*总算把牠搞定了．**鵰兄，你还好吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(471,0,1);   --  1(1):[AAA]说: 咦？雕兄怎么跑了？这只雕*颇有灵性，好像要带我到里*边去……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(2);   --  37(25):增加道德2
--end

