--function oldevent_573()
    instruct_37(2);   --  37(25):增加道德2
    instruct_1(2502,247,1);   --  1(1):[???]说: 段公子好，王姑娘好。恭喜*段公子终于虏获美人心。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2503,53,0);   --  1(1):[段誉]说: 呵呵，这都多亏了少侠的帮*忙啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2504,0,0);   --  1(1):[AAA]说: 哪里哪里，我不曾帮过任何*的忙，都是段公子精诚所至*，金石为开啊。但不知慕容*公子……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2505,76,0);   --  1(1):[???]说: 我表哥他……他心里只有那*个虚无缥缈的皇帝梦……我*现在才知道，真心待我的只*有段公子一个人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2506,53,0);   --  1(1):[段誉]说: 语嫣……这位少侠帮了我们*这么多，我们也帮帮他吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2507,76,0);   --  1(1):[???]说: 好啊，那我们就去小村吧
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(104,59,1,0,965,0,0,6308,6308,6308,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [59]
    instruct_3(104,51,1,0,977,0,0,6296,6296,6296,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [51]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(70,9,1,0,143,0,0,6310,6310,6310,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [9]
    instruct_3(70,27,1,0,167,0,0,6298,6298,6298,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [27]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

