--function oldevent_754()

    if instruct_5(0,693) ==true then    --  5(5):是否选择战斗？否则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(204,333,0,1) ==false then    --  6(6):战斗[204]是则跳转到:Label1
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            instruct_1(2999,0,1);   --  1(1):[AAA]说: 令狐兄的剑法出神入化，在*下佩服佩服！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(3000,195,0);   --  1(1):[???]说: 大师兄，大师兄～～
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(3001,249,0);   --  1(1):[???]说: 有华山派的人来了，我要走*了，记住，你们不许跟任何*人提起我！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
            instruct_3(-2,4,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
            instruct_3(57,17,1,0,0,0,0,7018,7018,7018,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [17]
            instruct_3(57,19,1,0,0,0,0,7150,7150,7150,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [19]
            instruct_3(57,20,1,0,0,0,0,7158,7158,7158,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [20]
            instruct_3(57,18,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [18]
            instruct_3(57,23,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [23]
            instruct_3(57,21,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [21]
            instruct_3(57,22,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [22]
            instruct_3(57,24,1,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [24]
            instruct_3(57,28,1,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [28]
            instruct_3(57,27,1,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [27]
            instruct_3(57,26,1,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [26]
            instruct_3(57,25,1,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [25]
            instruct_3(57,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [6]
            instruct_3(57,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [5]
            instruct_3(57,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [2]
            instruct_3(57,15,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [15]
            instruct_3(57,29,0,0,0,0,755,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [29]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            instruct_1(3002,35,0);   --  1(1):[令狐冲]说: 六猴，什么事，慌慌张张的。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(3003,195,0);   --  1(1):[???]说: 大师兄，不好了，成不忧拿*着左盟主的五岳令旗，要逼*师父让出掌门之位。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(3004,35,0);   --  1(1):[令狐冲]说: 什么！*走，马上去看看！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
            instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
        end    --:Label1

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景

        if instruct_29(35,150,9999,0,332) ==true then    --  29(1D):判断令狐冲武力150-9999否则跳转到:Label2
            instruct_1(2999,0,1);   --  1(1):[AAA]说: 令狐兄的剑法出神入化，在*下佩服佩服！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(3000,195,0);   --  1(1):[???]说: 大师兄，大师兄～～
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(3001,249,0);   --  1(1):[???]说: 有华山派的人来了，我要走*了，记住，你们不许跟任何*人提起我！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
            instruct_3(-2,4,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
            instruct_3(57,17,1,0,0,0,0,7018,7018,7018,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [17]
            instruct_3(57,19,1,0,0,0,0,7150,7150,7150,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [19]
            instruct_3(57,20,1,0,0,0,0,7158,7158,7158,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [20]
            instruct_3(57,18,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [18]
            instruct_3(57,23,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [23]
            instruct_3(57,21,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [21]
            instruct_3(57,22,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [22]
            instruct_3(57,24,1,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [24]
            instruct_3(57,28,1,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [28]
            instruct_3(57,27,1,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [27]
            instruct_3(57,26,1,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [26]
            instruct_3(57,25,1,0,0,0,0,7160,7160,7160,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [25]
            instruct_3(57,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [6]
            instruct_3(57,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [5]
            instruct_3(57,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [2]
            instruct_3(57,15,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [15]
            instruct_3(57,29,0,0,0,0,755,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [29]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            instruct_1(3002,35,0);   --  1(1):[令狐冲]说: 六猴，什么事，慌慌张张的。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(3003,195,0);   --  1(1):[???]说: 大师兄，不好了，成不忧拿*着左盟主的五岳令旗，要逼*师父让出掌门之位。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(3004,35,0);   --  1(1):[令狐冲]说: 什么！*走，马上去看看！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
            instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label2

        instruct_1(2998,249,0);   --  1(1):[???]说: 冲儿，进步不小，我再教你*几招，再和他比过！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_47(35,20);   --  47(2F):令狐冲增加攻击力20
        instruct_48(35,50);   --  48(30):令狐冲增加生命50
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
--end

