--function oldevent_725()
    instruct_3(-2,-2,1,0,0,0,0,2612,2612,2612,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(122,1);   --  2(2):得到物品[七星剑谱][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2899,128,0);   --  1(1):[???]说: 大胆狂徒，居然敢在全真教*偷东西！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(221,3,0,0) ==false then    --  6(6):战斗[221]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_37(-3);   --  37(25):增加道德-3
--end

