--function oldevent_462()
    instruct_14();   --  14(E):场景变黑
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_30(47,36,28,33);   --  30(1E):主角走动47-36--28-33
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1727,69,0);   --  1(1):[洪七公]说: 靖儿，那边又来了人，你可*认识？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1728,55,0);   --  1(1):[郭靖]说: 啊，他是我的朋友，是我们*一起打跑欧阳克的
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1729,0,1);   --  1(1):[AAA]说: 郭兄，黄姑娘，别来无恙？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1730,55,0);   --  1(1):[郭靖]说: 我很好啊。我来给你介绍，*这位是九指神丐洪七公洪老*前辈。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1731,247,1);   --  1(1):[???]说: 哇，北丐洪七公！*晚辈参见洪老前辈。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1732,69,0);   --  1(1):[洪七公]说: 免啦免啦，老家化子一个，*有什么好参见的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1733,0,1);   --  1(1):[AAA]说: 郭兄得遇洪老前辈，一定受*益匪浅吧
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1734,55,0);   --  1(1):[郭靖]说: 是啊，洪老前辈教了我一招*掌法，很厉害的
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1735,0,1);   --  1(1):[AAA]说: 难道是降龙十八掌？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1736,55,0);   --  1(1):[郭靖]说: 就是啊，你怎么知道的？你*也快来求求洪老前辈，让他*也教教你吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1737,69,0);   --  1(1):[洪七公]说: 嘿嘿，老家化子的武功可不*是随便传给谁的。更何况他*没你那么好福气，有个古灵*精怪又会做菜的女娃娃帮你*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1738,56,0);   --  1(1):[黄蓉]说: 七公啊，我做了那么多好吃*的给你，你却只教了靖哥哥*一招，太少了吧。这位少侠*也算是我们的朋友，七公就*点拨点拨他吧。七公武学渊*博，随便抖搂两招就够我们*学的了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1739,69,0);   --  1(1):[洪七公]说: 哈哈，女娃娃就是坏！*好吧，老叫化就教你一套逍*遥游吧，这是我年轻的时候*用的，走的是轻灵的路子，*看清楚了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_2(111,1);   --  2(2):得到物品[逍遥游拳谱][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1740,56,0);   --  1(1):[黄蓉]说: 七公、少侠，我要带靖哥哥*回桃花岛见我爹，咱们就此*分手吧。有时间上桃花岛做*客啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1741,55,0);   --  1(1):[郭靖]说: 七公，弟子走了，你老人家*要保重身体啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1742,69,0);   --  1(1):[洪七公]说: 老叫化硬朗着呢，用不着你*操心。至于去桃花岛嘛，为*了你们两个，老叫化肯定是*要去一趟的，哈哈。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1743,0,1);   --  1(1):[AAA]说: 郭大哥，黄姑娘，咱们就此*别过。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,7,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(75,39,0,0,0,0,466,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[桃花岛]:场景事件编号 [39]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

