--function oldevent_303()

    if instruct_4(219,2,0) ==false then    --  4(4):是否使用物品[一颗头颅]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_32(219,-1);   --  32(20):物品[一颗头颅]+[-1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1058,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，这恶贼成昆终于*伏法。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1059,0,1);   --  1(1):[AAA]说: 范右使和谢法王呢？我是来*换书的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1060,70,0);   --  1(1):[玄慈]说: 范遥已退隐江湖，不问世事*。谢逊已在少林出家，不见*外人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1061,0,1);   --  1(1):[AAA]说: 那我的书怎么办啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1062,70,0);   --  1(1):[玄慈]说: 范右使临行之前，将倚天屠*龙记一书交与老衲，如今成*昆终于伏法，此书就送与少*侠吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(155,1);   --  2(2):得到物品[倚天屠龙记][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1063,70,0);   --  1(1):[玄慈]说: 望少侠今后少生杀戮，多行*善事，阿弥陀佛，善哉善哉*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,-2,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

