--function oldevent_498()
    instruct_1(1990,129,0);   --  1(1):[???]说: 你准备好了吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0


    if instruct_6(177,8,0,1) ==false then    --  6(6):战斗[177]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1991,129,0);   --  1(1):[???]说: 看来少侠还需努力一番才是*！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1992,129,0);   --  1(1):[???]说: 好，好，少侠武功盖世，这*本书理应归少侠所有。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(148,1);   --  2(2):得到物品[射鵰英雄传][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1993,129,0);   --  1(1):[???]说: 咱们有缘再见！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,0,1,0,499,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
--end

