--function oldevent_16()
    instruct_1(147,0,1);   --  1(1):[AAA]说: 胡大哥，你的刀法学的如何*了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(148,1,0);   --  1(1):[胡斐]说: 近来感觉有些进步。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(149,3,0);   --  1(1):[苗人凤]说: 哈哈，年轻人懂得谦虚，很*好。依你现在的武功，只怕*不比你爹当年差啦。怎么样*，你若想为父报仇，尽管动*手吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,1,0);   --  1(1):[胡斐]说: …………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(151,0,1);   --  1(1):[AAA]说: 胡大哥……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(152,1,0);   --  1(1):[胡斐]说: 兄弟，我们走吧，我的仇已*经报了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(153,0,1);   --  1(1):[AAA]说: 对嘛！这才是我的好大哥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(154,3,0);   --  1(1):[苗人凤]说: 走之前，把这个给你。这是*你爹当年留下来的一幅藏宝*图，理应交给他的后人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,40,1,0,945,0,0,7222,7222,7222,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [40]

    if instruct_31(10000,0,66) ==true then    --  31(1F):判断银子是否够10000否则跳转到:Label0
        instruct_2(225,1);   --  2(2):得到物品[闯王藏宝图][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_39(5);   --  39(27):打开场景山洞
        instruct_2(136,1);   --  2(2):得到物品[胡家刀法][1]
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_20(18,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
            instruct_10(1);   --  10(A):加入人物[胡斐]
            instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_1(12,1,0);   --  1(1):[胡斐]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_3(70,5,1,0,101,0,0,5166,5166,5166,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [5]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_31(5000,0,68) ==true then    --  31(1F):判断银子是否够5000否则跳转到:Label2
        instruct_2(226,1);   --  2(2):得到物品[闯王藏宝图][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_39(84);   --  39(27):打开场景山洞
        instruct_2(136,1);   --  2(2):得到物品[胡家刀法][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_20(18,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label3
            instruct_10(1);   --  10(A):加入人物[胡斐]
            instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label3

        instruct_1(12,1,0);   --  1(1):[胡斐]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_3(70,5,1,0,101,0,0,5166,5166,5166,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [5]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2

    instruct_2(227,1);   --  2(2):得到物品[闯王藏宝图][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_39(85);   --  39(27):打开场景山洞
    instruct_2(136,1);   --  2(2):得到物品[胡家刀法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(18,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label4
        instruct_10(1);   --  10(A):加入人物[胡斐]
        instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label4

    instruct_1(12,1,0);   --  1(1):[胡斐]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(70,5,1,0,101,0,0,5166,5166,5166,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    do return; end
--end

