--function oldevent_205()

    if instruct_18(218,0,29) ==true then    --  18(12):是否有物品[鸯刀]否则跳转到:Label0
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_26(-2,0,0,1,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_32(218,-1);   --  32(20):物品[鸯刀]+[-1]
        instruct_1(459,0,1);   --  1(1):[AAA]说: 哈！*这刀孔大小正适合放这把*鸯刀．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
--end

