--function oldevent_585()
    instruct_14();   --  14(E):场景变黑
    instruct_37(-5);   --  37(25):增加道德-5
    instruct_3(40,16,1,0,655,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [16]
    instruct_3(40,15,1,0,655,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [15]
    instruct_3(40,14,1,0,655,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [14]
    instruct_3(40,13,1,0,655,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [13]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,26,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,31,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,32,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,37,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,38,0,0,0,0,0,6152,6152,6152,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,39,0,0,0,0,0,5132,5132,5132,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,40,0,0,0,0,0,7130,7130,7130,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,41,0,0,0,0,0,5136,5136,5136,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,42,0,0,0,0,0,7990,7990,7990,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,43,0,0,0,0,0,6298,6298,6298,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,12,1,0,591,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,1,0,591,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(39,30,16,29);   --  30(1E):主角走动39-30--16-29
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_32(216,-1);   --  32(20):物品[带头大哥书信]+[-1]
    instruct_1(2530,0,1);   --  1(1):[AAA]说: 乔峰，你看这是什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2531,50,0);   --  1(1):[乔峰]说: 是什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2532,0,0);   --  1(1):[AAA]说: 你看了便知道。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2533,50,0);   --  1(1):[乔峰]说: 这……这是真的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2534,0,1);   --  1(1):[AAA]说: 少林方丈亲笔写的，会是假*的吗！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2535,51,0);   --  1(1):[慕容复]说: 我今日请来了智光大师、谭*公、谭婆、赵钱孙等人，他*们都可以作证。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2536,50,0);   --  1(1):[乔峰]说: 我……我……*我不是汉人…………*我是契丹人…………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2537,0,1);   --  1(1):[AAA]说: 乔峰，你是契丹人，非我族*类，其心必异，怎可担任这*丐帮帮主一职，保管《天龙*八部》一书呢！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2538,50,0);   --  1(1):[乔峰]说: 你要我怎麽做！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2539,0,1);   --  1(1):[AAA]说: 辞去丐帮帮主之位，*交出《天龙八部》一书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2540,50,0);   --  1(1):[乔峰]说: 好！我今天就辞去这丐帮帮*主之位，《天龙八部》一书*你拿去吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,14,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(147,1);   --  2(2):得到物品[天龙八部][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2541,247,1);   --  1(1):[???]说: 得来真是全不费功夫。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2542,207,0);   --  1(1):[???]说: 阁下来此，揭发乔峰的真实*身份，让我丐帮不致误奉一*契丹人为帮主，很是感激。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2543,0,1);   --  1(1):[AAA]说: 没什麽，这是中原武林的大*事，小弟应该做的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2544,207,0);   --  1(1):[???]说: 但是，拜你所赐，我丐帮也*将因此事贻笑武林。你拿的*《天龙八部》是丐帮镇帮之*宝，还请阁下留下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2545,0,1);   --  1(1):[AAA]说: 怎麽可以，我好不容易才拿*到手的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2546,207,0);   --  1(1):[???]说: 那只好得罪了。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(84,4,0,0) ==false then    --  6(6):战斗[84]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2547,207,0);   --  1(1):[???]说: 阁下对丐帮的"大恩大德"全*武林的叫化子都会记得的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2548,51,0);   --  1(1):[慕容复]说: 哈哈哈，恭喜少侠如愿以偿*得到天书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2549,247,1);   --  1(1):[???]说: 哪里哪里，多亏慕容公子鼎*力相助
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2550,51,0);   --  1(1):[慕容复]说: 我这就回燕子坞，兄弟如果*有需要我帮忙的地方，尽可*去燕子坞找我
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(52,1,1,0,586,0,0,6302,6302,6302,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [1]
    instruct_3(52,2,1,0,587,0,0,6298,6298,6298,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

