--function oldevent_744()
    instruct_1(2944,0,1);   --  1(1):[AAA]说: 这么大个镖局，怎么空空荡*荡的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2945,208,0);   --  1(1):[???]说: 不知道这是冲撞了什么神灵*，这几天镖局的镖头接连莫*名其妙的故去，主人带着夫*人少爷带着随身物品向西走*了。我收拾收拾东西，也得*赶紧走了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2946,0,1);   --  1(1):[AAA]说: 可能是青城派来报仇了吧…*…向西走了？我在沿途的客*栈找找看……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(61,33,0,0,0,0,745,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[高昇客栈]:场景事件编号 [33]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

