--function oldevent_1052()
    instruct_1(3944,64,0);   --  1(1):[周伯通]说:  小兄弟，谢谢你的帮忙，否*则我会後悔一辈子．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3945,0,1);   --  1(1):[AAA]说: 那里，以後还请前辈多指点*武功才是．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3946,64,0);   --  1(1):[周伯通]说: 那有什麽问题，改天到我百*花谷来，我教你一套”左右*互搏之术”
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(20,4,1,0,1050,0,0,6154,6154,6154,-2,-2,-2);   --  3(3):修改事件定义:场景[百花谷]:场景事件编号 [4]
    instruct_3(20,13,1,0,1051,0,0,6158,6158,6158,-2,-2,-2);   --  3(3):修改事件定义:场景[百花谷]:场景事件编号 [13]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
--end

