--function oldevent_630()
    instruct_1(2679,0,1);   --  1(1):[AAA]说: 啊，原来是这样啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(79,1);   --  2(2):得到物品[八荒六合功][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号

    if instruct_16(49,0,9) ==true then    --  16(10):队伍是否有[虚竹]否则跳转到:Label0
        -- instruct_33(49,101,0);   --  33(21):虚竹学会武功八荒六合功
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_34(49,10);   --  34(22):虚竹增加资质10
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

--end

