--function oldevent_12()
    instruct_1(111,0,1);   --  1(1):[AAA]说: 灵姑娘用毒，医术都极为高*明，有你陪伴闯荡江湖，旅*程将会十分安稳，*不知姑娘是否肯随我们四处*走走呢？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(1,0,80) ==true then    --  16(10):队伍是否有[胡斐]否则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(113,1,1);   --  1(1):[胡斐]说: 是啊，姑娘一个人住这里，*闷也闷慌了，就随我们到处*走走吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(114,2,0);   --  1(1):[程灵素]说: 看在胡公子的面子上，我就*陪你们到处玩一玩。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(104,41,1,0,946,0,0,7224,7224,7224,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [41]

        if instruct_20(18,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
            instruct_10(2);   --  10(A):加入人物[程灵素]
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_1(12,2,0);   --  1(1):[程灵素]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(70,6,1,0,103,0,0,5210,5210,5210,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [6]
        do return; end
    end    --:Label0

    instruct_1(112,2,0);   --  1(1):[程灵素]说: 你臭美啊！跟你在一起一定*很无聊。
    instruct_0();   --  0(0)::空语句(清屏)
--end

