--function oldevent_18()

    if instruct_4(202,2,0) ==false then    --  4(4):是否使用物品[闯王军刀]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_17(-2,1,21,21,0);   --  17(11):修改场景贴图:当前场景层1坐标15-15
    instruct_17(-2,1,20,20,3694);   --  17(11):修改场景贴图:当前场景层1坐标14-14
    instruct_17(-2,1,20,21,4064);   --  17(11):修改场景贴图:当前场景层1坐标14-15
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
--end

