--function oldevent_500()
    instruct_1(2141,68,0);   --  1(1):[丘处机]说: 行走江湖，最重要的就是使*自己保持在正道之上。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,99,999,2,0) ==false then    --  28(1C):判断AAA品德99-999是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,27,1,0,0,0,0,7102,7102,7102,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(38,25,39,25);   --  30(1E):主角走动38-25--39-25
    instruct_30(39,25,39,22);   --  30(1E):主角走动39-25--39-22
    instruct_1(1995,0,1);   --  1(1):[AAA]说: 晚辈参见重阳真人
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1999,129,0);   --  1(1):[???]说: 不必多礼。少侠武功卓绝，*更难得的是行走江湖始终保*持在正道之上，不愧为当今*武林第一人，这部九阴真经*，只有少侠才真正有资格成*为它的主人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2000,0,1);   --  1(1):[AAA]说: 多谢重阳真人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(84,1);   --  2(2):得到物品[九阴真经][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,0,1,0,497,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
--end

