--function oldevent_1082()
    instruct_1(3998,92,0);   --  1(1):[???]说: 哎呀，你怎么才来呀？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3999,0,1);   --  1(1):[AAA]说: 你是谁呀？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4000,92,0);   --  1(1):[???]说: 我就是李沅芷呀！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4001,0,1);   --  1(1):[AAA]说: 你在这里做什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4003,92,0);   --  1(1):[???]说: 当然是等着你来加我啦！*你现在正在进行是苍龙逐日*1.2版，作者小小猪迫于*某些人的压力，才让我出场*的。我的任务就是做你的保*镖，帮你通关！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4004,0,1);   --  1(1):[AAA]说: 你到底在说什么啊？*我完全听不懂……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4005,92,0);   --  1(1):[???]说: 你不用听懂，我就问你一句*话，你要老老实实的回答我*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4006,0,1);   --  1(1):[AAA]说: 哦，你问吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4007,92,0);   --  1(1):[???]说: 你想不想让我加入你的队伍*？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(57,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(4008,92,0);   --  1(1):[???]说: 什么？你……你……我再给*你一次机会好了，你想不想*让我加入？
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_9(48,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label1
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(150,92,0);   --  1(1):[???]说: …………
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(150,0,1);   --  1(1):[AAA]说: …………
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(4009,92,0);   --  1(1):[???]说: 伤自尊了……*我走了……再见……*再也不想见到你啦！！！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_3(104,90,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [90]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
        end    --:Label1

    end    --:Label0

    instruct_1(4011,92,0);   --  1(1):[???]说: 哦，那就好，你等一下啊。**喂——你们可以出来了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4012,0,1);   --  1(1):[AAA]说: ？？？？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,4,0,0,0,0,0,6776,6776,6776,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,0,0,0,6778,6778,6778,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(4013,208,0);   --  1(1):[???]说: 臭丫头，我看你往哪跑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4014,92,0);   --  1(1):[???]说: 喂，你还愣着干什么？赶快*来英雄救美啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4015,0,1);   --  1(1):[AAA]说: 哦……
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(226,4,0,0) ==false then    --  6(6):战斗[226]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2

    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(4016,92,0);   --  1(1):[???]说: 小子，还不赖嘛！*我跟定你了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4017,248,1);   --  1(1):[???]说: 啊……这个……谢谢夸奖啊*……
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label3
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_10(92);   --  10(A):加入人物[李沅芷]
        do return; end
    end    --:Label3

    instruct_1(12,92,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(70,1,1,0,199,0,0,7266,7266,7266,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

