--function oldevent_323()

    if instruct_16(91,6,0) ==false then    --  16(10):队伍是否有[温青青]是则跳转到:Label0
        instruct_1(1163,54,0);   --  1(1):[袁承志]说: 青青，你在哪里啊，你在哪*里？
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,14,1,0,350,0,0,7032,7032,7032,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_21(91);   --  21(15):[温青青]离队
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1164,54,0);   --  1(1):[袁承志]说: 青青，我终于找到你了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1165,91,0);   --  1(1):[???]说: 哼，你找我干什么，你怎么*不去找你青梅竹马的小慧姑*娘！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1166,54,0);   --  1(1):[袁承志]说: 她……她的心上人是她的崔*师哥，跟我有什么关系。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1167,91,0);   --  1(1):[???]说: 你为什么用她的发钗？难道*我就没有发钗么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1168,54,0);   --  1(1):[袁承志]说: ＜她这简直是无理取闹……*唉，算了，我还是别说话了*……＞*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1169,91,0);   --  1(1):[???]说: 你怎么不说话？见了她就笑*逐颜开，见了我就闷闷不乐*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1170,54,0);   --  1(1):[袁承志]说: 我……我哪有？**青青，这些日子，你上哪里*去了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1171,0,1);   --  1(1):[AAA]说: ＜唉，这位温大小姐真让人*受不了，这位袁兄今后可要*受苦啦，我还是不要在这当*灯泡了＞，二位既已重逢，*在下这就告辞了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1172,91,0);   --  1(1):[???]说: 你还知道关心我啊！*我去了华山，把我父母合葬*在一起……*对了，袁大哥，你说过我爹*的金蛇剑法一定要配合金蛇*剑才有威力，我就让他帮我*把剑拔下来了，那，给你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_32(40,-1);   --  32(20):物品[金蛇剑]+[-1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1173,54,0);   --  1(1):[袁承志]说: 他？*哎呦，我们俩光顾着说话，*怠慢了兄台，还望见谅。多*谢兄台对……对她的照顾。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1174,91,0);   --  1(1):[???]说: 谁要他来照顾？是他让我加*入他的队伍，给他做帮手！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1175,247,1);   --  1(1):[???]说: ……＜这位大小姐，我可惹*不起＞，啊，是，温姑娘武*艺非凡，帮了在下不少忙。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1176,91,0);   --  1(1):[???]说: 你听到没有！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1177,54,0);   --  1(1):[袁承志]说: ……*对了，我明日要去金龙帮，*不知兄台可有兴趣一同前往*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1178,91,0);   --  1(1):[???]说: 去金龙帮干什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1179,54,0);   --  1(1):[袁承志]说: 听说金龙帮的帮主焦公礼几*年前杀害了仙都派闵子华的*哥哥，所以闵子华邀请武林*好手，去找焦公礼报仇。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1180,0,1);   --  1(1):[AAA]说: 几年前杀的？闵子华怎么知*道是焦公礼下的手？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1181,54,0);   --  1(1):[袁承志]说: 据说是太白三英告诉他的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1182,0,1);   --  1(1):[AAA]说: 太白三英？我刚才进来的时*候看见那三个家伙了，鬼鬼*祟祟的……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1183,54,0);   --  1(1):[袁承志]说: 恩，我也觉得他们有些奇怪*。兄台，不如我们去调查一*下如何？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_11(0,37) ==true then    --  11(B):是否住宿否则跳转到:Label1
        instruct_37(2);   --  37(25):增加道德2
        instruct_1(1184,0,1);   --  1(1):[AAA]说: 调查一下也好，可不能冤枉*了好人。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,1,0,349,325,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(-2,5,1,0,324,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_37(-2);   --  37(25):增加道德-2
    instruct_1(1185,246,1);   --  1(1):[???]说: 管那么多干嘛！反正大家都*认为是焦公礼的错，咱们就*去凑凑热闹，就算灭了金龙*帮，也是为朋友帮忙！＜金*龙帮是地头蛇，可能还会有*不少收获……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1186,54,0);   --  1(1):[袁承志]说: 也好，那我们先休息一晚，*明天去金龙帮。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(59,2,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [2]
    instruct_3(59,15,1,0,0,0,0,5434,5434,5434,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [15]
    instruct_3(59,13,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [13]
    instruct_3(59,12,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [12]
    instruct_3(59,11,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [11]
    instruct_3(59,10,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [10]
    instruct_3(59,9,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [9]
    instruct_3(59,8,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [8]
    instruct_3(59,7,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [7]
    instruct_3(59,6,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [6]
    instruct_3(59,5,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [5]
    instruct_3(59,4,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [4]
    instruct_3(59,3,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [3]
    instruct_3(59,29,0,0,0,0,351,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[金龙帮]:场景事件编号 [29]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1187,0,1);   --  1(1):[AAA]说: 糟糕，起来晚了，他们大概*都已经去了金龙帮了吧，我*也过去瞧瞧热闹。
    instruct_0();   --  0(0)::空语句(清屏)
--end

