--function oldevent_515()
    instruct_1(2163,130,0);   --  1(1):[???]说: 小子，你又来干什么？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(6,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_1(2164,247,1);   --  1(1):[???]说: 我，没事，随便逛逛……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_37(-5);   --  37(25):增加道德-5
    instruct_1(2165,0,1);   --  1(1):[AAA]说: 前辈是否知道黑风双煞？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2166,130,0);   --  1(1):[???]说: 岂知知道！那黑风双煞凶狠*残忍，滥杀无辜，我大哥飞*天神龙就是死在他二人手上*，不过我们也杀了那个铜尸*陈玄风！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2167,0,1);   --  1(1):[AAA]说: 哦，那就好了，没找错人，*我今日来就是给陈玄风前辈*报仇的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2168,130,0);   --  1(1):[???]说: 什么？？好啊，原来你和那*个妖女是一路的，好啊，好*啊，来吧小子！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(189,3,0,0) ==false then    --  6(6):战斗[189]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(41,1,1,0,516,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[山洞]:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

