--function oldevent_844()
    instruct_1(3361,0,1);   --  1(1):[AAA]说: 那程姑娘可否与在下一游，*帮忙在下寻找那十四天书？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,65,999,6,0) ==false then    --  28(1C):判断AAA品德65-999是则跳转到:Label0
        instruct_1(3362,63,0);   --  1(1):[程英]说: 我看公子脸上泛有戾气，公*子还是多做些善事才是．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3363,63,0);   --  1(1):[程英]说:  嗯！好吧．*反正我一人在此也是无聊，*就随公子一游吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,60,1,0,971,0,0,7244,7244,7244,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [60]

    if instruct_20(19,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_10(63);   --  10(A):加入人物[程英]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(12,63,0);   --  1(1):[程英]说: 你的队伍已满，我就直接去*小村吧。
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(70,30,1,0,155,0,0,6120,6120,6120,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [30]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
--end

