--function oldevent_567()
    instruct_26(40,13,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,15,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,14,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(2395,0,1);   --  1(1):[AAA]说: 薛神医，你好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2386,45,0);   --  1(1):[薛慕华]说: 哼！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2396,247,1);   --  1(1):[???]说: 阿朱姑娘好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2397,104,0);   --  1(1):[???]说: 小兄弟，你来啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2398,244,1);   --  1(1):[???]说: 阿朱姑娘，乔帮主他……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2399,104,0);   --  1(1):[???]说: 你放心，乔大哥用最后的内*力救了你，本来已经到了任*人宰割的地步，谁料突然来*了一个黑衣人，武功十分高*强，救走了乔大哥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2400,0,1);   --  1(1):[AAA]说: 黑衣人……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2401,104,0);   --  1(1):[???]说: 薛神医，谢谢你的回春妙手*，如今我已痊愈，就此告辞*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,45,0);   --  1(1):[薛慕华]说: …………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2402,0,1);   --  1(1):[AAA]说: 恩……这个……阿朱姑娘，*是否要去寻找乔大哥？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2403,104,0);   --  1(1):[???]说: 恩，这个自然。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2404,0,1);   --  1(1):[AAA]说: 你见到乔大哥，能否替我问*他一件事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2405,104,0);   --  1(1):[???]说: 什么事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2406,0,1);   --  1(1):[AAA]说: 听说十四天书中的《天龙八*部》在乔大哥身上……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2407,104,0);   --  1(1):[???]说: 你……你是为了天书才帮乔*大哥的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2408,245,1);   --  1(1):[???]说: 阿朱姑娘，你太小看在下了*。在下是要夺取天书不假。*可是在下向来仰慕乔帮主的*为人，要像他一样做一个顶*天立地的男儿。如果此书确*在乔帮主身上，我会苦练武*功，与乔帮主堂堂正正的比*试一场，光明正大的获得此*书！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2409,104,0);   --  1(1):[???]说: 小兄弟，乔大哥能有你这样*一位兄弟，我真替他高兴。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2410,247,1);   --  1(1):[???]说: 阿朱姑娘过奖了。乔大哥能*有你这样一位红颜知己，才*真是令人羡慕啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2411,104,0);   --  1(1):[???]说: 呵呵……小兄弟，我要去寻*找乔大哥了，咱们就此别过*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2412,0,1);   --  1(1):[AAA]说: 好，后会有期。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,0,1,0,568,569,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(51,25,1,0,570,0,0,6264,6264,6264,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [25]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

