--function oldevent_468()
    instruct_14();   --  14(E):场景变黑
    instruct_37(2);   --  37(25):增加道德2
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_25(34,20,30,21);   --  25(19):场景移动34-20--30-21
    instruct_1(1849,61,0);   --  1(1):[欧阳克]说: 妹子，你在这里练功夫么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1850,56,0);   --  1(1):[黄蓉]说: ＜靖哥哥受了重伤，还需五*天五夜方能痊愈。偏巧在这*时候碰见这个姓欧阳的，真*是倒霉，怎生撒个大谎，将*他远远骗走＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1851,61,0);   --  1(1):[欧阳克]说: 妹子，出来罢，躲在这里气*闷得紧。我知道那姓郭的小*子已经深受重伤，妹子，你*就依了我吧，咱俩做个长久*夫妻。只要你答应我，我保*证不加害这个姓郭的小子。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1852,0,1);   --  1(1):[AAA]说: ＜不好，郭大哥和黄姑娘有*难，我得帮帮他们＞，欧阳*兄，好久不见啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1853,61,0);   --  1(1):[欧阳克]说: 啊？又是你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1854,56,0);   --  1(1):[黄蓉]说: 小兄弟你来得正好，快来结*果了这个恶人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1855,245,1);   --  1(1):[???]说: 听见了吗？欧阳克，你作恶*多端，今日我就要送你归西*！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(178,4,0,0) ==false then    --  6(6):战斗[178]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,1,1,0,0,0,0,5154,5154,5154,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_19(30,21);   --  19(13):主角移动至1E-15
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_37(2);   --  37(25):增加道德2
    instruct_1(1856,56,0);   --  1(1):[黄蓉]说: 多亏小兄弟及时赶到，否则*今日定难逃脱
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1857,0,1);   --  1(1):[AAA]说: 郭大哥怎么了？好像伤得很*严重！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1858,56,0);   --  1(1):[黄蓉]说: 靖哥哥和我得知金人要偷武*穆遗书，我们就连夜赶到皇*宫保护，没想到西毒欧阳锋*竟然帮着金人，以蛤蟆功掌*力震伤靖哥哥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1859,245,1);   --  1(1):[???]说: 可恶的西毒欧阳锋，教我碰*见一定好好教训他！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1860,60,0);   --  1(1):[欧阳锋]说: 谁这么大口气！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,6,0,0,0,0,0,8218,8218,8218,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1861,60,0);   --  1(1):[欧阳锋]说: 啊，克儿，你怎么了？克儿*！谁，是谁杀了克儿！是不*是你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1862,245,1);   --  1(1):[???]说: ＜完了，没办法，事到如今*，豁出去了！＞就是我，怎*么样！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1863,60,0);   --  1(1):[欧阳锋]说: 好小子，有骨气！拿命来吧*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_47(60,30);   --  47(2F):欧阳锋增加攻击力30

    if instruct_6(172,1,0,1) ==false then    --  6(6):战斗[172]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_3(-2,7,0,0,0,0,0,6154,6154,6154,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1864,64,0);   --  1(1):[周伯通]说: 嘿嘿，臭蛤蟆，在练什么功*夫啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1865,0,1);   --  1(1):[AAA]说: 周老爷子，别在一旁看热闹*，快来帮帮我
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1866,64,0);   --  1(1):[周伯通]说: 放心，有我在，老毒物伤不*了你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_47(60,30);   --  47(2F):欧阳锋增加攻击力30

    if instruct_6(173,1,0,1) ==false then    --  6(6):战斗[173]是则跳转到:Label2
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2

    instruct_3(-2,8,0,0,0,0,0,8238,8238,8238,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1867,57,0);   --  1(1):[黄药师]说: 蓉儿，是你吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1868,56,0);   --  1(1):[黄蓉]说: 爹爹，快过来，老毒物欺负*你女儿！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1869,57,0);   --  1(1):[黄药师]说: 锋兄，为何动手啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1870,56,0);   --  1(1):[黄蓉]说: 欧阳克要欺负我，正好小兄*弟赶到，杀了欧阳克，老毒*物要为他侄子报仇，爹爹，*你快帮帮这位小兄弟吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1871,57,0);   --  1(1):[黄药师]说: 锋兄，你那侄子也可算是作*恶多端死有余辜，你何必…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1872,60,0);   --  1(1):[欧阳锋]说: 废话少说，我今日定要为克*儿报仇！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_47(60,30);   --  47(2F):欧阳锋增加攻击力30

    if instruct_6(174,4,0,0) ==false then    --  6(6):战斗[174]是则跳转到:Label3
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label3

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1873,60,0);   --  1(1):[欧阳锋]说: 好小子，算你命大，我就让*你再多活几天！克儿，你放*心，等叔叔练好了九阴真经*，一定为你报仇！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1874,0,1);   --  1(1):[AAA]说: 多谢周老前辈、黄岛主的救命*之恩！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1875,57,0);   --  1(1):[黄药师]说: 你救了蓉儿，我救了你，咱*们两不相欠，不必言谢。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1876,64,0);   --  1(1):[周伯通]说: 黄老邪，你这话就不对了。*就算你不来，我一样可以把*欧阳锋打跑。所以说你来根*本就是多余，小兄弟也不是*你救的。可是他救你女儿女*婿却是实实在在的，所以你*还是欠他的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1877,57,0);   --  1(1):[黄药师]说: 我黄药师一生从不欠别人的*。这样吧，小友，我就把我*的生平绝学传授与你吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1878,0,1);   --  1(1):[AAA]说: 岛主救我性命，我已然感激*不尽，若再接受岛主传艺，*实在惶恐。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1879,57,0);   --  1(1):[黄药师]说: 小友不必过谦。我一身武艺*，本想有个传人。怎奈我当*初一怒之下，把我所有的徒*弟都逐出门墙。如今得了个*女婿，又是如此……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1880,56,0);   --  1(1):[黄蓉]说: 爹——
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1881,57,0);   --  1(1):[黄药师]说: 哼，说你的靖哥哥几句你就*不高兴！小友，我看你天资*聪颖，与我桃花岛又颇有缘*分，趁着靖儿养伤这几日，*我这弹指神通的功夫就传给*你吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1882,247,1);   --  1(1):[???]说: 多谢岛主厚爱，恭敬不如从*命。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1883,64,0);   --  1(1):[周伯通]说: 黄老邪，你以为你了不起，*什么生平绝学弹指神通！我*周伯通别的功夫都想学，就*是不看你的古怪功夫。我去*也！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,10,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,9,0,0,0,0,0,8238,8238,8238,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_19(23,35);   --  19(13):主角移动至17-23
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1884,57,0);   --  1(1):[黄药师]说: 靖儿的伤已经痊愈了，我这*弹指神通的功夫，小友也学*得差不多啦，咱们就此别过*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1885,56,0);   --  1(1):[黄蓉]说: 爹——*唉，这么快就走，一点也不*疼女儿！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1886,0,1);   --  1(1):[AAA]说: 郭大哥，黄姑娘，你们有何*打算？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1887,55,0);   --  1(1):[郭靖]说: 我要继续寻访武穆遗书的下*落。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1888,56,0);   --  1(1):[黄蓉]说: 小兄弟，咱们就此别过！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(48,3,0,0,0,0,469,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[铁掌山]:场景事件编号 [3]
    instruct_3(48,2,0,0,0,0,469,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[铁掌山]:场景事件编号 [2]
    instruct_3(48,20,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:场景[铁掌山]:场景事件编号 [20]
    instruct_3(48,21,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:场景[铁掌山]:场景事件编号 [21]
    instruct_3(48,22,0,0,0,0,0,7988,7988,7988,-2,-2,-2);   --  3(3):修改事件定义:场景[铁掌山]:场景事件编号 [22]
    instruct_3(48,26,0,0,0,0,0,6094,6094,6094,-2,-2,-2);   --  3(3):修改事件定义:场景[铁掌山]:场景事件编号 [26]
    instruct_3(48,25,0,0,0,0,0,6094,6094,6094,-2,-2,-2);   --  3(3):修改事件定义:场景[铁掌山]:场景事件编号 [25]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(95,1);   --  2(2):得到物品[弹指神通][1]
    instruct_0();   --  0(0)::空语句(清屏)
--end

