--function oldevent_288()
    instruct_1(960,0,1);   --  1(1):[AAA]说: 哇——这是什么怪物！！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(151,3,0,0) ==false then    --  6(6):战斗[151]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(231,1);   --  2(2):得到物品[火蟾][1]
    instruct_0();   --  0(0)::空语句(清屏)
--end

