--function oldevent_586()
    instruct_1(2551,247,1);   --  1(1):[???]说: 慕容公子，别来无恙？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2552,51,0);   --  1(1):[慕容复]说: 少侠今日来燕子坞，不知有*何指教？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(2553,0,1);   --  1(1):[AAA]说: 没事，随便逛逛……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2554,0,1);   --  1(1):[AAA]说: 不敢不敢，在下最近旅途颇*有不顺，想请慕容公子帮忙*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2555,51,0);   --  1(1):[慕容复]说: ＜这小子很有利用价值，帮*帮他不会有坏处＞，哈哈，*好说好说
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(-1);   --  37(25):增加道德-1
    instruct_3(104,44,1,0,963,0,0,6300,6300,6300,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [44]

    if instruct_20(33,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(-2,2,1,0,588,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_10(51);   --  10(A):加入人物[慕容复]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(12,51,0);   --  1(1):[慕容复]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(70,22,1,0,139,0,0,7990,7990,7990,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [22]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,2,1,0,588,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
--end

