--function oldevent_772()
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(37,5,1,0,1053,0,0,6804,6804,6804,-2,-2,-2);   --  3(3):修改事件定义:场景[五毒教]:场景事件编号 [5]
    instruct_1(3119,0,1);   --  1(1):[AAA]说: 令狐兄病情如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3120,35,0);   --  1(1):[令狐冲]说: 曲子已经学完。感觉身体略*有好转。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3121,73,0);   --  1(1):[任盈盈]说: 唉，虽然这首曲子对他的伤*稍有裨益，但毕竟没有解决*根本问题。现在能治你的病*的可能只有杀人名医平一指*了。你去找他吧，他定会全*力施救。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3122,35,0);   --  1(1):[令狐冲]说: 多谢姑娘。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3123,73,0);   --  1(1):[任盈盈]说: 我这操琴之法传授与你，需*每日勤加练习。咱们就此别*过吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_41(35,180,1);   --  41(29):令狐冲得到物品持瑶琴1
    instruct_1(3124,35,0);   --  1(1):[令狐冲]说: 今日一别，不知何日得能再*聆姑娘雅奏。令狐冲但教不*死，定当再到洛阳，拜访姑*娘和竹翁。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,47,0,0,0,0,0,8222,8222,8222,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,54,1,0,773,0,0,7148,7148,7148,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
    instruct_3(-2,46,0,0,0,0,0,7150,7150,7150,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,48,0,0,0,0,0,7166,7166,7166,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,49,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,53,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
    instruct_3(-2,52,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
    instruct_3(-2,51,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,50,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_19(46,13);   --  19(13):主角移动至2E-D
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(46,13,46,22);   --  30(1E):主角走动46-13--46-22
    instruct_1(3125,19,0);   --  1(1):[岳不群]说: 冲儿，我听说只有杀人名医*平一指能治你的伤，可是那*平一指乃是邪魔外道，不可*相交啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3126,35,0);   --  1(1):[令狐冲]说: 既是如此，弟子不去找他治*病便是了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3127,19,0);   --  1(1):[岳不群]说: 还是救命重要。你身受重伤*，也不方便与为师同行。这*样吧，就由这位少侠送你去*找平一指。你伤好后，到福*建来找我们。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3128,35,0);   --  1(1):[令狐冲]说: 师父……是嫌弃弟子吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3129,19,0);   --  1(1):[岳不群]说: 岂敢岂敢，令狐少侠剑术非*凡，岳某哪有这般好弟子！*姗儿，平之，我们走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
    instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
    instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,47,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,23,1,0,774,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(30,0,1,0,777,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[平一指居]:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

