--function oldevent_40()
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,92) ==true then    --  9(9):是否要求加入?否则跳转到:Label0
        instruct_1(191,0,1);   --  1(1):[AAA]说: 看你也无家可归，和我一起*走吧，路上也有个照应。
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_28(0,70,100,0,76) ==true then    --  28(1C):判断AAA品德70-100否则跳转到:Label1
            instruct_37(2);   --  37(25):增加道德2
            instruct_1(192,37,0);   --  1(1):[狄云]说: 好吧！如果你不怕被我这个*不幸之人连累的话。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(104,81,1,0,956,0,0,7232,7232,7232,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [81]
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号

            if instruct_20(4,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
                instruct_10(37);   --  10(A):加入人物[狄云]
                instruct_0();   --  0(0)::空语句(清屏)
                do return; end
            end    --:Label2

            instruct_1(12,37,0);   --  1(1):[狄云]说: 你的队伍已满，我就直接去*小村吧。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(70,7,1,0,125,0,0,5090,5090,5090,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [7]
            instruct_3(70,8,1,0,125,0,0,5092,5092,5092,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [8]
            do return; end
        end    --:Label1

        instruct_1(193,37,0);   --  1(1):[狄云]说: 不了！我这个不幸之人还是*别害人的好。
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0


    if instruct_5(0,47) ==true then    --  5(5):是否选择战斗？否则跳转到:Label3
        instruct_37(-2);   --  37(25):增加道德-2
        instruct_1(194,0,1);   --  1(1):[AAA]说: 你说那个什么神照经，拿出*来看看啊
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(195,37,0);   --  1(1):[狄云]说: 不行，这是丁大哥的遗物，*不能随便交给他人。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(196,245,1);   --  1(1):[???]说: 哼，小子，不给我，我不会*硬抢吗？凡是书，我都不会*放过！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(16,4,0,0) ==false then    --  6(6):战斗[16]是则跳转到:Label4
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label4

        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_2(71,1);   --  2(2):得到物品[神照经][1]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label3

--end

