--function oldevent_766()
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_13();   --  13(D):重新显示场景
    instruct_25(22,25,21,13);   --  25(19):场景移动22-25--21-13
    instruct_1(3079,208,0);   --  1(1):[???]说: 爷爷，这本辟邪剑谱是我们*在令狐冲的身上搜出来的！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3080,106,0);   --  1(1):[???]说: 让我看看。。。。令狐贤侄*，这部辟邪剑谱，你是从何*处得来的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3081,35,0);   --  1(1):[令狐冲]说: 你祖孙三代，口口声声的说*这是辟邪剑谱。你们见过辟*邪剑谱没有？怎知这便是辟*邪剑谱？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3082,208,0);   --  1(1):[???]说: 这部册子从你身上搜了出来*，上面记着古怪文字，岳掌*门又说这不是华山派的武功*书谱，却不是辟邪剑谱是甚*么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(22,25,22,17);   --  30(1E):主角走动22-25--22-17
    instruct_1(3083,0,1);   --  1(1):[AAA]说: 参见王员外、岳掌门。*令狐兄，发生什么事了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3084,35,0);   --  1(1):[令狐冲]说: 师父，小兄弟，你们来看，*这明明是一本七弦琴的琴谱*，洞箫的箫谱，他王家目不*识丁，硬说是辟邪剑谱，天*下居然有这等大笑话。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3085,106,0);   --  1(1):[???]说: 武学秘笈的种类极多，有人*为了怕人偷窥，故意将武功*图谱写成曲谱模样，那也不*足为奇。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3086,0,1);   --  1(1):[AAA]说: 这个简单，附近可有什么人*会奏琴吹箫？不妨请他来看*看便知的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3087,106,0);   --  1(1):[???]说: 东城的绿竹翁，他既会抚琴*，又会吹箫，咱们去问问他*便清楚了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3088,19,0);   --  1(1):[岳不群]说: 好，冲儿，咱们就走一趟，*如果真是剑谱，师父对你也*绝不轻饶。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,37,0,0,0,0,0,7158,7158,7158,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,39,0,0,0,0,0,7150,7150,7150,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,7166,7166,7166,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,36,0,0,0,0,0,8222,8222,8222,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,33,0,0,0,0,0,8214,8214,8214,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,34,0,0,0,0,0,6098,6098,6098,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,35,0,0,0,0,0,6098,6098,6098,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_19(45,21);   --  19(13):主角移动至2D-15
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3089,232,0);   --  1(1):[???]说: 贵客枉顾蜗居，不知有何见*教。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3090,106,0);   --  1(1):[???]说: 竹翁，这有一本奇怪的琴谱*箫谱，要请你老人家的法眼*鉴定鉴定。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3091,232,0);   --  1(1):[???]说: 有琴谱箫谱要我鉴定？这可*太瞧得起老朽了。好，你放*下罢。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3092,106,0);   --  1(1):[???]说: 请问竹翁，这真的是曲谱，*还是甚么武功秘诀，故意写*成了曲谱模样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3093,232,0);   --  1(1):[???]说: 待我看看。。。咦？这琴谱*好生古怪，令人难以明白。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3094,73,0);   --  1(1):[任盈盈]说: 什么曲谱？拿来我看。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,40,1,0,769,0,0,7168,7168,7168,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,41,1,0,0,0,0,7164,7164,7164,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(45,21,42,13);   --  25(19):场景移动45-21--42-13
    instruct_1(3095,232,0);   --  1(1):[???]说: 师叔请看，这部琴谱可有些*古怪。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_66(0);   --  66(42):播放音乐0
    instruct_1(3096,0,2);   --  1(1):[AAA]说: （竹屋内响起了琴声）**……琴音似止未止之际，却*有一二下极低极细的箫声在*琴音旁响了起来。回旋婉转*，箫声渐响，恰似吹箫人一*面吹，一面慢慢走近，箫声*清丽，忽高忽低，忽轻忽响*，低到极处之际，几个盘旋*之后，又再低沉下去，虽极*低极细，每个音节仍清晰可*闻。渐渐低音中偶有珠玉跳*跃，清脆短促，此伏彼起，*繁音渐增，先如鸣泉飞溅，*继而如群卉争艳，花团锦簇*，更夹着间关鸟语，彼鸣我*和，渐渐的百鸟离去，春残*花落，但闻雨声萧萧，一片*凄凉肃杀之象，细雨绵绵，*若有若无，终于万籁俱寂。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,8,1,0,771,0,0,7164,7164,7164,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,41,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_19(45,21);   --  19(13):主角移动至2D-15
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_66(2);   --  66(42):播放音乐2
    instruct_1(3097,19,0);   --  1(1):[岳不群]说: 佩服，佩服！向我这种不懂*音律之人却也不禁心驰神醉*。冲儿，这是甚么曲子？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3098,35,0);   --  1(1):[令狐冲]说: 这叫做《笑傲江湖之曲》
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3099,232,0);   --  1(1):[???]说: 诸位，这确是琴谱箫谱，我*师叔适才奏过了，你们拿回*去罢！这曲谱中所记乐曲之*妙，世上罕有，此乃神物，*不可落入俗人手中。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3100,106,0);   --  1(1):[???]说: 看来的确只是曲谱，令狐贤*侄，这可得罪了！曲谱请你*拿回去吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3101,35,0);   --  1(1):[令狐冲]说: 哼。。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3102,19,0);   --  1(1):[岳不群]说: 冲儿。师父错怪你了，咱们*回去吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3103,35,0);   --  1(1):[令狐冲]说: 弟子多耽一会便回去，请师*父先回去吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3104,232,0);   --  1(1):[???]说: 看这位小兄弟，我听你说话*，中气大是不足，少年人不*该如此，却是何故？最近是*生了大病呢，还是曾受重伤*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3105,35,0);   --  1(1):[令狐冲]说: 是受了极重的伤。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3106,73,0);   --  1(1):[任盈盈]说: 请少侠过来，待我搭一搭脉*。。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,43,1,0,770,0,0,7656,7656,7656,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,44,1,0,768,0,0,7142,7142,7142,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,45,1,0,768,0,0,7156,7156,7156,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

