--function oldevent_354()
    instruct_3(-2,1,1,0,356,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,1,0,356,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,1,0,356,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,1,0,356,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,1,0,356,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,1,0,356,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,1,0,356,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,1,0,356,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(80,4,0,0,0,0,0,7064,7064,7064,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [4]
    instruct_3(80,5,0,0,0,0,0,7068,7068,7068,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [5]
    instruct_3(80,6,0,0,0,0,0,5364,5364,5364,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [6]
    instruct_3(80,7,0,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [7]
    instruct_3(80,9,0,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [9]
    instruct_3(80,8,0,0,0,0,0,5178,5178,5178,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [8]
    instruct_3(80,14,0,0,0,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [14]
    instruct_3(80,15,0,0,0,0,0,7032,7032,7032,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [15]
    instruct_3(80,2,0,0,0,0,357,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山后山]:场景事件编号 [2]
    instruct_30(42,26,35,26);   --  30(1E):主角走动42-26--35-26
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1338,245,1);   --  1(1):[???]说: 袁承志呢？出来！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1339,201,0);   --  1(1):[???]说: 什么人胆敢在此吵闹，拿下*！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(163,4,0,0) ==false then    --  6(6):战斗[163]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,9,1,0,355,0,0,7042,7042,7042,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(35,26,29,27);   --  30(1E):主角走动35-26--29-27
    instruct_1(1340,201,0);   --  1(1):[???]说: 哼，看我们教主怎么收拾你*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1341,83,0);   --  1(1):[???]说: 小帅哥功夫不错啊，我们来*单挑怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1342,245,1);   --  1(1):[???]说: ＜这五仙教的教主竟是这么*年轻的一个女子……＞，单*挑就单挑，还怕你不成！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(164,3,0,0) ==false then    --  6(6):战斗[164]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1343,83,0);   --  1(1):[???]说: 你，你，竟然功夫这么好！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1344,0,1);   --  1(1):[AAA]说: 这下知道厉害了吧，快让袁*承志出来！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1345,83,0);   --  1(1):[???]说: 好，不过你要先答应我一件*事。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1346,0,1);   --  1(1):[AAA]说: 什么事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1347,83,0);   --  1(1):[???]说: 你的功夫这么好，我想拜你*为师。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1348,0,1);   --  1(1):[AAA]说: 这，这，你不是开玩笑吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1349,83,0);   --  1(1):[???]说: 哈哈哈，你怕什么，我当然*不是开玩笑。我呢，就是想*跟在你身边学点功夫。怎么*了，小帅哥，不敢把姐姐留*在身边吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,75) ==true then    --  9(9):是否要求加入?否则跳转到:Label2
        instruct_1(1350,83,0);   --  1(1):[???]说: 师父在上，受徒儿一拜。那*袁承志确实来过这里，不过*现在已经回华山了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(104,78,1,0,984,0,0,7042,7042,7042,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [78]

        if instruct_20(18,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label3
            instruct_10(83);   --  10(A):加入人物[何铁手]
            instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label3

        instruct_1(12,83,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
        instruct_3(70,55,1,0,181,0,0,7042,7042,7042,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [55]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

--end

