--function oldevent_455()

    if instruct_16(30,0,12) ==true then    --  16(10):队伍是否有[郭靖]否则跳转到:Label0
        instruct_1(1674,55,1);   --  1(1):[郭靖]说: 七师父好。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1671,136,0);   --  1(1):[???]说: 靖儿，如果你喜欢一个女孩*子，就要大胆的告诉她，否*则……可能会后悔的……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0


    if instruct_16(55,0,11) ==true then    --  16(10):队伍是否有[郭靖]否则跳转到:Label1
        instruct_1(1674,55,1);   --  1(1):[郭靖]说: 七师父好。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1671,136,0);   --  1(1):[???]说: 靖儿，如果你喜欢一个女孩*子，就要大胆的告诉她，否*则……可能会后悔的……
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(1661,136,0);   --  1(1):[???]说: 越女剑韩小莹，江南七怪中*排行在七。
    instruct_0();   --  0(0)::空语句(清屏)
--end

