--function oldevent_268()
    instruct_14();   --  14(E):场景变黑
    instruct_37(5);   --  37(25):增加道德5
    instruct_26(40,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,12,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_39(72);   --  39(27):打开场景冰火岛
    instruct_3(33,2,1,0,1062,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [2]
    instruct_3(34,0,1,0,1066,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[崆峒派]:场景事件编号 [0]
    instruct_13();   --  13(D):重新显示场景
    instruct_25(29,47,29,36);   --  25(19):场景移动29-47--29-36
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(794,8,0);   --  1(1):[唐文亮]说: 魔教已然一败涂地，再不投*降，还待怎的？空闻大师，*咱们这便去毁了魔教三十三*代教主的牌位吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(795,7,0);   --  1(1):[何太冲]说: 什麽投不投降？*魔教之众，*今日不能留下任何活口。*除恶务尽，*否则他日死灰复燃，*又将为害江湖。*魔崽子们！*识时务的快快自我了断，*省得大爷们动手。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(796,169,0);   --  1(1):[???]说: 华山派和崆峒派各位，*请将顶上的魔教余孽一概诛*灭了。*武当派从西往东搜索，峨嵋*派从东往西搜索，别让魔教*有一人漏网。*崑仑派预备火种，焚烧魔教*巢穴。**少林弟子各取法器，诵念往*生经文，替六派殉难英雄，*魔教教众超渡，化除冤孽。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(29,48,29,38);   --  30(1E):主角走动29-48--29-38
    instruct_1(797,0,1);   --  1(1):[AAA]说: 哇！这里这麽多人，干什麽*这麽热闹，可少不了小侠我*。我说名门正派又怎麽样，*还不是一样赶尽杀绝，跟魔*教又有什麽两样，只不过藉*口好听一点罢了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(798,169,0);   --  1(1):[???]说: 少侠非魔教人士，*还请速速离去，*以免受池鱼之殃。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(799,0,1);   --  1(1):[AAA]说: 那好，大家都别打了，因为*这中间着实有许多误会，*让我好好说给你们听。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(800,6,0);   --  1(1):[灭绝]说: 现在年轻人都这麽狂妄吗？*你自以为是武林盟主吗！*要我们听你说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(801,8,0);   --  1(1):[唐文亮]说: 你这小贼，跟魔教勾结，*想要拖延时间，好施什麽诡*计麽？先杀了你再说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(802,0,1);   --  1(1):[AAA]说: 我就知道要你们安安静静听*我说是不太可能，那只有想*办法让你们服气了。*哪一派先来？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(803,7,0);   --  1(1):[何太冲]说: 好狂妄的口气，我昆仑派就*来领教阁下高招！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(1511,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label0
        instruct_1(858,9,0);   --  1(1):[张无忌]说: 我来帮你！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(146,3,0,0) ==false then    --  6(6):战斗[146]是则跳转到:Label1
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label1

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(804,109,0);   --  1(1):[???]说: 看我华山派的。
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(147,3,0,0) ==false then    --  6(6):战斗[147]是则跳转到:Label2
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label2

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_2(142,1);   --  2(2):得到物品[反两仪刀法][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(805,8,0);   --  1(1):[唐文亮]说: 让你尝尝我崆峒七伤拳的厉*害
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(148,3,0,0) ==false then    --  6(6):战斗[148]是则跳转到:Label3
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label3

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(806,170,0);   --  1(1):[???]说: 少侠武功盖世，老衲前来领*教一二。
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(149,3,0,0) ==false then    --  6(6):战斗[149]是则跳转到:Label4
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label4

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_2(92,1);   --  2(2):得到物品[龙爪手][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(807,6,0);   --  1(1):[灭绝]说: 小子，你以为你是武林盟主*吗？就算你有屠龙刀在手，*还要问问我手上的倚天剑答*不答应！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(150,3,0,0) ==false then    --  6(6):战斗[150]是则跳转到:Label5
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label5

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(808,6,0);   --  1(1):[灭绝]说: 现在就看武当派的了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(809,171,0);   --  1(1):[???]说: 这个……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(810,9,0);   --  1(1):[张无忌]说: 大师伯，你们别打了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(811,171,0);   --  1(1):[???]说: 你，你，你是无忌！你是我*五弟的儿子张无忌！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(812,9,0);   --  1(1):[张无忌]说: 大师伯，是我，太师父他老*人家还好吧？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(813,171,0);   --  1(1):[???]说: 好，好，孩子，你身上的寒*毒好了吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(814,9,0);   --  1(1):[张无忌]说: 谢谢大师伯挂怀，我想已经*好了吧。大师伯，六大派和*明教，这其中确有不少误会*，你们不要再打了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(815,171,0);   --  1(1):[???]说: 什么误会？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(816,9,0);   --  1(1):[张无忌]说: 就让这位少侠来说吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(817,0,1);   --  1(1):[AAA]说: 事情的经过是这样的。。。*如此如此。。。。。。。。*这般这般。。。。。。。。*总之，一切的阴谋，*都是成崑那奸贼所计划的。**所以我说呢，你们两方还是*握手言和吧，反正明教杀过*六大派的人，六大派也杀过*明教的人，大家半斤八两，*差不了多少，就都罢手吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(818,8,0);   --  1(1):[唐文亮]说: 话都是你在说的，*是不是真的，*我们怎麽知道。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(819,6,0);   --  1(1):[灭绝]说: 武当派既认亲，看来这次六*大派围攻光明顶是一败涂地*了，我们走！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(820,169,0);   --  1(1):[???]说: 阿弥陀佛。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(821,7,0);   --  1(1):[何太冲]说: 哼！技不如人，*说这麽多做什麽，*走吧！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(822,171,0);   --  1(1):[???]说: 无忌，还有这位少侠，今日*你们救了明教，今后要多所*规劝引导，总要使明教改邪*归正，少做坏事。*我们走吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
        instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
        instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
        instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
        instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
        instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
        instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
        instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
        instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
        instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
        instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
        instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
        instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
        instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
        instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
        instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
        instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
        instruct_3(-2,79,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [79]
        instruct_3(-2,70,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
        instruct_3(-2,69,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,68,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_3(-2,67,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_3(-2,66,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
        instruct_3(-2,65,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
        instruct_3(-2,64,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
        instruct_3(-2,63,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
        instruct_3(-2,62,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
        instruct_3(-2,61,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
        instruct_3(-2,60,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
        instruct_3(-2,59,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        instruct_3(-2,58,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
        instruct_3(-2,57,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
        instruct_3(-2,56,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
        instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
        instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
        instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
        instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
        instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
        instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
        instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
        instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
        instruct_3(-2,47,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
        instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
        instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
        instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
        instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
        instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
        instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
        instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
        instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
        instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
        instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
        instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
        instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,84,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [84]
        instruct_3(-2,83,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
        instruct_3(-2,82,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [82]
        instruct_3(-2,81,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [81]
        instruct_3(-2,80,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [80]
        instruct_3(-2,96,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [96]
        instruct_3(-2,99,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [99]
        instruct_3(-2,98,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [98]
        instruct_3(-2,97,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [97]
        instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,108,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [108]
        instruct_3(-2,104,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [104]
        instruct_3(-2,110,1,0,272,0,0,5334,5334,5334,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [110]
        instruct_3(-2,109,1,0,270,280,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [109]
        instruct_19(28,17);   --  19(13):主角移动至1C-11
        instruct_25(28,15,28,15);   --  25(19):场景移动28-15--28-15
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(823,14,0);   --  1(1):[韦一笑]说: 你们两个小子，还不赖嘛！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(824,10,0);   --  1(1):[范遥]说: 蝠王，不可无礼。明教全教*下上，叩谢少侠和张公子护*教救命的大恩！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(825,0,1);   --  1(1):[AAA]说: 快别这麽说，仗义行侠，本*就是我辈中人应当做的。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(826,14,0);   --  1(1):[韦一笑]说: 你们也别这麽客套了。这样*吧，大家听我一言，我说呢*，这位少侠武功盖世义薄云*天，於本教有存亡续绝的大*恩。咱们拥立他为本教第三*十四任教主。由他来做教主*，总比你来做教主好吧，杨*左使，你说对不对啊。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(827,11,0);   --  1(1):[杨逍]说: 是啊！*这位少侠来做我们教主，*也比你韦一笑来做好的多。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(828,14,0);   --  1(1):[韦一笑]说: 你。。。。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(829,12,0);   --  1(1):[殷天正]说: 你们两个别在那里吵了，丢*人现眼的。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(830,247,1);   --  1(1):[???]说: 不，不，我仍有要事在身，*这个教主是无论如何不能当*的。*＜南贤老头说我有什么天命*在身，听起来比这个教主可*威风多了。＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(831,10,0);   --  1(1):[范遥]说: 少侠如果一直推却不肯，我*们明教恐怕又要为此争闹不*休，四分五裂，到时又会被*其他门派围攻，导致灭亡了*。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(832,0,1);   --  1(1):[AAA]说: 我这里有封阳教主的遗书，*上面提到要谢逊谢法王暂代*教主之职。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(833,10,0);   --  1(1):[范遥]说: 可是谢法王至今杳无音信，*明教却不可一日无主啊。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(834,9,0);   --  1(1):[张无忌]说: 我义父应该在冰火岛，咱们*去找他吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(835,0,1);   --  1(1):[AAA]说: 我倒有个主意。这位张公子*，今日也可算是明教的恩人*。他是鹰王的外孙，可算是*明教自己人。他还是狮王的*义子，就算狮王做了教主，*子继父业也是理所当然。而*且张公子似乎另有奇遇，武*功卓绝，这个明教教主，再*合适不过了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(836,14,0);   --  1(1):[韦一笑]说: 少侠此言有理，我韦一笑第*一个赞成！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(837,9,0);   --  1(1):[张无忌]说: 我，我，我不行的……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(838,11,0);   --  1(1):[杨逍]说: 我赞成！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(839,10,0);   --  1(1):[范遥]说: 我也赞成！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(840,12,0);   --  1(1):[殷天正]说: 无忌，你就不要推辞了，难*道你连外公的话都不听吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(841,9,0);   --  1(1):[张无忌]说: 我……好吧……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(842,11,0);   --  1(1):[杨逍]说: 明教光明左使杨逍
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(843,10,0);   --  1(1):[范遥]说: 光明右使范遥
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(844,12,0);   --  1(1):[殷天正]说: 白眉鹰王殷天正
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(845,14,0);   --  1(1):[韦一笑]说: 青翼蝠王韦一笑
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(846,0,2);   --  1(1):[AAA]说: 明教众人：*        参见教主！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(847,9,0);   --  1(1):[张无忌]说: 使不得，使不得，你们快起*来……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_13();   --  13(D):重新显示场景
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(848,0,1);   --  1(1):[AAA]说: 另外还有一件事拜托你们，*你们明教中是否有一本叫*《倚天屠龙记》的书？*是否能借我一下。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(849,11,0);   --  1(1):[杨逍]说: 有的。这是我明教镇教之宝*，历来由专人掌管。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(850,247,1);   --  1(1):[???]说: 是吗？真的有。皇天不负苦*心人，打了这麽多场仗，终*於让我找到了。不知是哪位*掌管此书？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(851,10,0);   --  1(1):[范遥]说: 金毛狮王谢逊！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(852,0,1);   --  1(1):[AAA]说: 张公子，你知道你义父所在*吧，咱们去找他吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(853,9,0);   --  1(1):[张无忌]说: 好啊，我一直想把义父接回*来。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(854,11,0);   --  1(1):[杨逍]说: 可是，现在明教大敌刚去，*有许多事情需要教主安排，*教主你不能轻离光明顶啊。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(855,9,0);   --  1(1):[张无忌]说: 杨左使此言有理。那就拜托*少侠去找寻我义父吧，他就*在极北的冰火岛。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(856,0,1);   --  1(1):[AAA]说: 好，那我这就去寻找谢法王*。各位，告辞了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(857,9,0);   --  1(1):[张无忌]说: 少侠慢走。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,0,0,0,0,0,274,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        do return; end
    end    --:Label0


    if instruct_6(9,3,0,0) ==false then    --  6(6):战斗[9]是则跳转到:Label6
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label6

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(804,109,0);   --  1(1):[???]说: 看我华山派的。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(11,3,0,0) ==false then    --  6(6):战斗[11]是则跳转到:Label7
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label7

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(142,1);   --  2(2):得到物品[反两仪刀法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(805,8,0);   --  1(1):[唐文亮]说: 让你尝尝我崆峒七伤拳的厉*害
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(12,3,0,0) ==false then    --  6(6):战斗[12]是则跳转到:Label8
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label8

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(806,170,0);   --  1(1):[???]说: 少侠武功盖世，老衲前来领*教一二。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(149,3,0,0) ==false then    --  6(6):战斗[149]是则跳转到:Label9
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label9

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(92,1);   --  2(2):得到物品[龙爪手][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(807,6,0);   --  1(1):[灭绝]说: 小子，你以为你是武林盟主*吗？就算你有屠龙刀在手，*还要问问我手上的倚天剑答*不答应！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(150,3,0,0) ==false then    --  6(6):战斗[150]是则跳转到:Label10
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label10

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(808,6,0);   --  1(1):[灭绝]说: 现在就看武当派的了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(809,171,0);   --  1(1):[???]说: 这个……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(810,9,0);   --  1(1):[张无忌]说: 大师伯，你们别打了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(811,171,0);   --  1(1):[???]说: 你，你，你是无忌！你是我*五弟的儿子张无忌！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(812,9,0);   --  1(1):[张无忌]说: 大师伯，是我，太师父他老*人家还好吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(813,171,0);   --  1(1):[???]说: 好，好，孩子，你身上的寒*毒好了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(814,9,0);   --  1(1):[张无忌]说: 谢谢大师伯挂怀，我想已经*好了吧。大师伯，六大派和*明教，这其中确有不少误会*，你们不要再打了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(815,171,0);   --  1(1):[???]说: 什么误会？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(816,9,0);   --  1(1):[张无忌]说: 就让这位少侠来说吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(817,0,1);   --  1(1):[AAA]说: 事情的经过是这样的。。。*如此如此。。。。。。。。*这般这般。。。。。。。。*总之，一切的阴谋，*都是成崑那奸贼所计划的。**所以我说呢，你们两方还是*握手言和吧，反正明教杀过*六大派的人，六大派也杀过*明教的人，大家半斤八两，*差不了多少，就都罢手吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(818,8,0);   --  1(1):[唐文亮]说: 话都是你在说的，*是不是真的，*我们怎麽知道。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(819,6,0);   --  1(1):[灭绝]说: 武当派既认亲，看来这次六*大派围攻光明顶是一败涂地*了，我们走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(820,169,0);   --  1(1):[???]说: 阿弥陀佛。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(821,7,0);   --  1(1):[何太冲]说: 哼！技不如人，*说这麽多做什麽，*走吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(822,171,0);   --  1(1):[???]说: 无忌，还有这位少侠，今日*你们救了明教，今后要多所*规劝引导，总要使明教改邪*归正，少做坏事。*我们走吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,79,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [79]
    instruct_3(-2,70,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
    instruct_3(-2,69,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
    instruct_3(-2,68,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
    instruct_3(-2,67,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
    instruct_3(-2,66,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
    instruct_3(-2,65,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
    instruct_3(-2,64,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
    instruct_3(-2,63,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
    instruct_3(-2,62,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
    instruct_3(-2,61,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
    instruct_3(-2,60,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
    instruct_3(-2,59,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
    instruct_3(-2,58,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
    instruct_3(-2,57,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
    instruct_3(-2,56,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
    instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
    instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
    instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
    instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,47,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,84,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [84]
    instruct_3(-2,83,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
    instruct_3(-2,82,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [82]
    instruct_3(-2,81,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [81]
    instruct_3(-2,80,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [80]
    instruct_3(-2,96,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [96]
    instruct_3(-2,99,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [99]
    instruct_3(-2,98,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [98]
    instruct_3(-2,97,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [97]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,108,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [108]
    instruct_3(-2,104,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [104]
    instruct_3(-2,110,1,0,272,0,0,5334,5334,5334,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [110]
    instruct_3(-2,109,1,0,270,280,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [109]
    instruct_19(28,17);   --  19(13):主角移动至1C-11
    instruct_25(28,15,28,15);   --  25(19):场景移动28-15--28-15
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(823,14,0);   --  1(1):[韦一笑]说: 你们两个小子，还不赖嘛！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(824,10,0);   --  1(1):[范遥]说: 蝠王，不可无礼。明教全教*下上，叩谢少侠和张公子护*教救命的大恩！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(825,0,1);   --  1(1):[AAA]说: 快别这麽说，仗义行侠，本*就是我辈中人应当做的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(826,14,0);   --  1(1):[韦一笑]说: 你们也别这麽客套了。这样*吧，大家听我一言，我说呢*，这位少侠武功盖世义薄云*天，於本教有存亡续绝的大*恩。咱们拥立他为本教第三*十四任教主。由他来做教主*，总比你来做教主好吧，杨*左使，你说对不对啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(827,11,0);   --  1(1):[杨逍]说: 是啊！*这位少侠来做我们教主，*也比你韦一笑来做好的多。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(828,14,0);   --  1(1):[韦一笑]说: 你。。。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(829,12,0);   --  1(1):[殷天正]说: 你们两个别在那里吵了，丢*人现眼的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(830,247,1);   --  1(1):[???]说: 不，不，我仍有要事在身，*这个教主是无论如何不能当*的。*＜南贤老头说我有什么天命*在身，听起来比这个教主可*威风多了。＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(831,10,0);   --  1(1):[范遥]说: 少侠如果一直推却不肯，我*们明教恐怕又要为此争闹不*休，四分五裂，到时又会被*其他门派围攻，导致灭亡了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(832,0,1);   --  1(1):[AAA]说: 我这里有封阳教主的遗书，*上面提到要谢逊谢法王暂代*教主之职。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(833,10,0);   --  1(1):[范遥]说: 可是谢法王至今杳无音信，*明教却不可一日无主啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(834,9,0);   --  1(1):[张无忌]说: 我义父应该在冰火岛，咱们*去找他吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(835,0,1);   --  1(1):[AAA]说: 我倒有个主意。这位张公子*，今日也可算是明教的恩人*。他是鹰王的外孙，可算是*明教自己人。他还是狮王的*义子，就算狮王做了教主，*子继父业也是理所当然。而*且张公子似乎另有奇遇，武*功卓绝，这个明教教主，再*合适不过了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(836,14,0);   --  1(1):[韦一笑]说: 少侠此言有理，我韦一笑第*一个赞成！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(837,9,0);   --  1(1):[张无忌]说: 我，我，我不行的……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(838,11,0);   --  1(1):[杨逍]说: 我赞成！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(839,10,0);   --  1(1):[范遥]说: 我也赞成！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(840,12,0);   --  1(1):[殷天正]说: 无忌，你就不要推辞了，难*道你连外公的话都不听吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(841,9,0);   --  1(1):[张无忌]说: 我……好吧……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(842,11,0);   --  1(1):[杨逍]说: 明教光明左使杨逍
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(843,10,0);   --  1(1):[范遥]说: 光明右使范遥
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(844,12,0);   --  1(1):[殷天正]说: 白眉鹰王殷天正
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(845,14,0);   --  1(1):[韦一笑]说: 青翼蝠王韦一笑
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(846,0,2);   --  1(1):[AAA]说: 明教众人：*        参见教主！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(847,9,0);   --  1(1):[张无忌]说: 使不得，使不得，你们快起*来……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(848,0,1);   --  1(1):[AAA]说: 另外还有一件事拜托你们，*你们明教中是否有一本叫*《倚天屠龙记》的书？*是否能借我一下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(849,11,0);   --  1(1):[杨逍]说: 有的。这是我明教镇教之宝*，历来由专人掌管。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(850,247,1);   --  1(1):[???]说: 是吗？真的有。皇天不负苦*心人，打了这麽多场仗，终*於让我找到了。不知是哪位*掌管此书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(851,10,0);   --  1(1):[范遥]说: 金毛狮王谢逊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(852,0,1);   --  1(1):[AAA]说: 张公子，你知道你义父所在*吧，咱们去找他吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(853,9,0);   --  1(1):[张无忌]说: 好啊，我一直想把义父接回*来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(854,11,0);   --  1(1):[杨逍]说: 可是，现在明教大敌刚去，*有许多事情需要教主安排，*教主你不能轻离光明顶啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(855,9,0);   --  1(1):[张无忌]说: 杨左使此言有理。那就拜托*少侠去找寻我义父吧，他就*在极北的冰火岛。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(856,0,1);   --  1(1):[AAA]说: 好，那我这就去寻找谢法王*。各位，告辞了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(857,9,0);   --  1(1):[张无忌]说: 少侠慢走。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,0,0,0,0,274,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
--end

