--function oldevent_1017()
    instruct_1(3867,88,0);   --  1(1):[???]说: 谢谢兄弟赠杯之情．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(16,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_3(-2,-2,1,0,1017,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3865,0,1);   --  1(1):[AAA]说: 先生既好这杯中之物，不如*与在下同游江湖，也好品尝*这天下美酒！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3866,88,0);   --  1(1):[???]说: 哈哈哈，既然如此，恭敬不*如从命。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,71,1,0,989,0,0,7020,7020,7020,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [71]

    if instruct_20(27,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_17(102,2,20,25,0);   --  17(11):修改场景贴图:场景[老祖居]层2坐标14-19
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_10(88);   --  10(A):加入人物[祖千秋]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(12,88,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_17(102,2,20,25,0);   --  17(11):修改场景贴图:场景[老祖居]层2坐标14-19
    instruct_3(70,43,1,0,191,0,0,7020,7020,7020,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [43]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
--end

