--function oldevent_565()
    instruct_26(40,13,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,15,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,14,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,6,0,0,0,0,0,5186,5186,5186,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2379,196,0);   --  1(1):[???]说: 这位少侠请留步
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2380,0,1);   --  1(1):[AAA]说: 是叫我吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2381,196,0);   --  1(1):[???]说: 请接英雄帖。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2382,0,1);   --  1(1):[AAA]说: 英雄帖？干什么用的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2383,196,0);   --  1(1):[???]说: 神医薛慕华、聚贤庄游氏兄*弟，撒下英雄帖，遍邀天下*英雄，共同商讨如何对付那*个滥杀无辜的契丹恶贼乔峰*。请少侠务必到聚贤庄来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2384,0,1);   --  1(1):[AAA]说: 哦……*＜乔帮主，应该不是那样的*人啊＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(54,27,1,0,0,0,0,2530,2530,2530,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [27]
    instruct_3(54,28,1,0,0,0,0,2532,2532,2532,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [28]
    instruct_3(54,29,1,0,0,0,0,2534,2534,2534,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [29]
    instruct_3(54,30,1,0,0,0,0,2536,2536,2536,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [30]
    instruct_3(54,26,0,0,0,0,0,6292,6292,6292,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [26]
    instruct_3(54,23,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [23]
    instruct_3(54,22,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [22]
    instruct_3(54,21,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [21]
    instruct_3(54,20,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [20]
    instruct_3(54,16,0,0,0,0,0,6042,6042,6042,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [16]
    instruct_3(54,17,0,0,0,0,0,5424,5424,5424,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [17]
    instruct_3(54,18,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [18]
    instruct_3(54,19,0,0,0,0,0,5190,5190,5190,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [19]
    instruct_3(54,14,0,0,0,0,0,6416,6416,6416,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [14]
    instruct_3(54,15,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [15]
    instruct_3(54,10,0,0,0,0,0,5888,5888,5888,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [10]
    instruct_3(54,11,0,0,0,0,0,5888,5888,5888,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [11]
    instruct_3(54,24,0,0,0,0,566,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [24]
    instruct_3(54,25,0,0,0,0,566,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [25]
--end

