--function oldevent_842()
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_25(25,42,31,36);   --  25(19):场景移动25-42--31-36
    instruct_1(3350,161,0);   --  1(1):[???]说: 一个死丫头，还有个瘸铁匠*，嘿嘿，黄老邪果然尽捡些*脓包来做弟子，到世上丢人*现眼。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3351,236,0);   --  1(1):[???]说: 请你莫说我恩师坏话。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3352,161,0);   --  1(1):[???]说: 人家早不要你做弟子了，你*还恩师长、恩师短的，也不*怕人笑掉了牙齿。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(78,0,5) ==true then    --  16(10):队伍是否有[梅超风]否则跳转到:Label0
        instruct_1(3353,78,1);   --  1(1):[???]说: 谁敢说我恩师？即使他不认*我们做徒弟，我们也永远认*他做恩师！
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(3354,245,1);   --  1(1):[???]说: 东邪黄药师，天下闻名，你*这道姑真是不知天高地厚！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3355,161,0);   --  1(1):[???]说: 哼，又来个不知所谓的小子*，去死吧！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(52,5,0,0) ==false then    --  6(6):战斗[52]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_19(30,37);   --  19(13):主角移动至1E-25
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3356,247,1);   --  1(1):[???]说: 咦？她好像掉了一本书……*哈哈，这李莫愁临走了居然*还送我礼物，也不是传说中*的那么坏嘛。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(110,1);   --  2(2):得到物品[五毒秘传][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,2,0,0,0,0,846,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
--end

