--function oldevent_318()

    if instruct_16(91,2,0) ==false then    --  16(10):队伍是否有[温青青]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(1139,91,0);   --  1(1):[???]说: 这……这一定就是我爹的尸*骨了……爹，我把娘的骨灰*带来了，娘说要和你合葬在*一起，我这就帮你们完成心*愿。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1140,0,1);   --  1(1):[AAA]说: 姑娘请节哀，我来帮你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_19(22,28);   --  19(13):主角移动至16-1C
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_3(-2,1,1,0,319,0,0,6700,6700,6700,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,9,1,0,319,0,0,6696,6696,6696,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1142,0,1);   --  1(1):[AAA]说: 从墙上的字来看，这位金蛇*郎君夏前辈真是一位了不起*的高人啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1143,91,0);   --  1(1):[???]说: 那是，我爹爹自然了不起。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1144,0,1);   --  1(1):[AAA]说: 这就是金蛇剑吧，插的好深*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1145,91,0);   --  1(1):[???]说: 对了，袁大哥提到过这把金*蛇剑，你帮我把它拔下来，*我们去还给袁大哥。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,1,0,320,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
--end

