--function oldevent_257()
    instruct_26(40,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,12,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(761,0,1);   --  1(1):[AAA]说: 这位小哥，我向你打听一些*事情。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(762,192,0);   --  1(1):[???]说: 什么事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(763,0,1);   --  1(1):[AAA]说: 我有位朋友，不幸坠入昆仑*山谷，不知贵派可有人发现*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(764,192,0);   --  1(1):[???]说: 山谷这么深，坠下去恐怕是*必死无疑了。我们昆仑派可*不管收尸！再说，掌门已经*率领众弟子前去围剿明教了*，现在留守派中的人都不会*轻易离开。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(765,0,1);   --  1(1):[AAA]说: 围剿明教？昆仑派自己么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(766,192,0);   --  1(1):[???]说: 是六大派共同围剿明教！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(767,0,1);   --  1(1):[AAA]说: 六大派？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(768,192,0);   --  1(1):[???]说: 我们昆仑派，再加上少林、*武当、峨嵋、崆峒、华山，*合称六大派。此次围剿光明*顶，我们志在必得。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(769,0,1);   --  1(1):[AAA]说: 哦，这样啊，多谢这位小哥*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(770,192,0);   --  1(1):[???]说: 你没什么事就快走吧，不要*在此停留！免得把你当明教*奸细抓起来！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,3,1,0,258,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,13,1,0,258,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_17(11,1,29,47,0);   --  17(11):修改场景贴图:场景[光明顶]层1坐标1D-2F
--end

