--function oldevent_1053()

    if instruct_16(35,16,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        instruct_1(3947,25,0);   --  1(1):[蓝凤凰]说: 公子来到我们云南五毒教，*不知有什么事？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3948,0,1);   --  1(1):[AAA]说: 久闻五毒教大名，蓝教主貌*美风骚，在下特来拜见。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3949,25,0);   --  1(1):[蓝凤凰]说: 呵呵，你称赞我美貌，那可*要多谢你啦。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3950,25,0);   --  1(1):[蓝凤凰]说: 这位可是令狐公子？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3951,35,1);   --  1(1):[令狐冲]说: 正是在下。不知姑娘是……？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3952,25,0);   --  1(1):[蓝凤凰]说: 我是你好朋友的朋友，也就*是你的朋友啦。我知道你深*受重伤，就用我们苗家的办*法帮你治一治。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_48(35,100);   --  48(30):令狐冲增加生命100
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3953,25,0);   --  1(1):[蓝凤凰]说: 你的病我虽然治不好，但给*你送了这许多血，是大有好*处的。令狐公子，你瞧我很*老了，是不是？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3954,35,1);   --  1(1):[令狐冲]说: 谁说你老了？你一点都不老*，要是你不生气，我就叫你*一声妹子啦。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3955,25,0);   --  1(1):[蓝凤凰]说: 你真好。怪不得，怪不得，*这个不把天下男人放在眼里*的人，也会对你这样好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3956,35,1);   --  1(1):[令狐冲]说: 你若真的说我好，干嘛不叫*我令狐大哥？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3957,25,0);   --  1(1):[蓝凤凰]说: 呵呵，令狐大哥！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3958,35,1);   --  1(1):[令狐冲]说: 好妹子，乖妹子。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,1054,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,10,1,0,0,0,0,2286,2286,2286,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
--end

