--function oldevent_745()
    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,20,0,0,0,0,0,5862,5862,5862,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,25,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(23,49,21,39);   --  25(19):场景移动23-49--21-39
    instruct_1(2947,200,0);   --  1(1):[???]说: 龟孙子，我看你往哪跑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2948,36,0);   --  1(1):[林平之]说: 你，你们，你们到底要怎么*样！我爹爹妈妈在哪里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2949,200,0);   --  1(1):[???]说: 哈哈，龟儿，龟婆，此时已*经上阎王那儿报道了吧，哈*哈哈，龟孙子，你还是快点*把辟邪剑谱交出来吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2950,0,1);   --  1(1):[AAA]说: ＜难道青城派找福威镖局的*麻烦，不单是为了报仇，还*想抢林家的剑谱？＞*你们不要欺人太甚！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2951,36,0);   --  1(1):[林平之]说: 少侠快来救我。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(48,4,0,0) ==false then    --  6(6):战斗[48]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_19(20,41);   --  19(13):主角移动至14-29
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_3(-2,25,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,7152,7152,7152,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2952,0,0);   --  1(1):[AAA]说: 林兄弟，你没事吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2953,36,0);   --  1(1):[林平之]说: 多谢少侠及时出手相助。这*帮青城派的狗贼，是想把我*福威镖局赶尽杀绝啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2954,0,1);   --  1(1):[AAA]说: 林兄弟，究竟发生了什么事*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2955,36,0);   --  1(1):[林平之]说: 唉，那日我杀了那个小狗崽*子，不想青城派因此大举进*攻我们福威镖局。我们眼看*抵挡不住，爹爹妈妈就带着*我一起逃难出来，没想到半*路还是被这群狗贼发现了。*我们一家三口寡不敌众，全*都被擒。我好不容易逃了出*来，不知道我爹爹妈妈现在*怎么样了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2956,79,0);   --  1(1):[???]说: 爹～，那边那个就是福威镖*局的少镖头林平之。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,21,0,0,0,0,0,5960,5960,5960,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,23,0,0,0,0,0,7142,7142,7142,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,29,0,0,0,0,0,7656,7656,7656,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,32,0,0,0,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,28,0,0,0,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,30,0,0,0,0,0,5184,5184,5184,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,20,0,0,0,0,0,7150,7150,7150,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2957,79,0);   --  1(1):[???]说: 爹～，他就是林平之，他就*是为了帮我打抱不平才会失*手杀了那个姓余的，这位少*侠当时也在场。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2958,0,1);   --  1(1):[AAA]说: 原来是华山掌门，君子剑岳*先生，久仰大名，晚辈有礼*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2959,36,0);   --  1(1):[林平之]说: 岳掌门，岳掌门，你救救我*爹爹，救救我妈妈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2960,19,0);   --  1(1):[岳不群]说: 少侠不必多礼。*林少镖头，你的父母……，*唉，冲儿，你来说吧……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2961,35,0);   --  1(1):[令狐冲]说: 林兄弟，上次我们分手以后*，我和小师妹马上赶回了华*山，将你的事情禀明家师。*家师料想到青城派会对你家*人下毒手，于是率领我们这*些弟子下山营救。没想到还*是晚了一步……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2962,36,0);   --  1(1):[林平之]说: 爹爹……妈妈……你们死的*好惨啊……孩儿一定要替你*们报仇，杀了这帮青城派的*狗贼……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2963,35,0);   --  1(1):[令狐冲]说: 林兄弟，你不要太难过了，*你父母临终时，有遗言留给*你，说福州向阳老宅……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2964,19,0);   --  1(1):[岳不群]说: 冲儿，林公子令尊的遗言，*你单独告诉他便了，旁人不*必知晓。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2965,35,0);   --  1(1):[令狐冲]说: 是，师父。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2966,36,0);   --  1(1):[林平之]说: 岳掌门，你是好人，人人都*称你为君子剑，我一见你，*就说不出的钦佩敬慕，求师*父收录门墙，弟子谨遵教诲*，严守门规，决不敢有丝毫*违背师命。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2967,79,0);   --  1(1):[???]说: 爹～，你就收下他吧。虽说*青城派是为了贪图林家的辟*邪剑谱，但这件事毕竟是由*于林兄弟为女儿打抱不平引*起的。爹，你就收下他吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2968,19,0);   --  1(1):[岳不群]说: 好吧，既然如此，平之啊，*你就跟着我们吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2969,36,0);   --  1(1):[林平之]说: 多谢恩师收留。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2970,247,1);   --  1(1):[???]说: 恭喜林兄弟得遇名师。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2971,79,0);   --  1(1):[???]说: 对了，爹，这位少侠当时也*出手帮我来着，您老人家是*不是也该有所表示呀？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2972,19,0);   --  1(1):[岳不群]说: 少侠初涉江湖，能够见义勇*为，很好，很好，这本剑谱*记载着华山剑法的精要，就*赠与少侠吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(127,1);   --  2(2):得到物品[太岳三青峰][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2973,247,1);   --  1(1):[???]说: 多谢岳掌门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3741,19,0);   --  1(1):[岳不群]说: 好了，此间事情已了，冲儿*，姗儿，平之，我们回华山*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3742,36,0);   --  1(1):[林平之]说: 是，师父。*少侠，再会了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3743,35,0);   --  1(1):[令狐冲]说: 少侠有空不妨到我华山来玩*啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2977,247,1);   --  1(1):[???]说: 呵呵，好，我一定会去的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(57,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [3]
    instruct_3(57,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [4]
    instruct_37(1);   --  37(25):增加道德1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

