--function oldevent_944()
    instruct_14();   --  14(E):场景变黑
    instruct_19(16,20);   --  19(13):主角移动至10-14
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(16,20,16,27);   --  30(1E):主角走动16-20--16-27
    instruct_30(16,27,21,27);   --  30(1E):主角走动16-27--21-27
    instruct_1(3799,0,2);   --  1(1):[AAA]说: 众人：*武林盟主万岁！*武林盟主万岁！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3800,247,1);   --  1(1):[???]说: 哇塞，这就是受人敬仰的感*觉，好爽！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3801,195,0);   --  1(1):[???]说: 报告武林盟主，大事不好了*，东方岛上有一倭国，派来*大批神秘武士，企图血洗我*中华武林。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3802,256,0);   --  1(1):[???]说: 我们担心的事情终于还是来*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3803,255,0);   --  1(1):[???]说: 如今你已成为武林盟主，就*请号令群雄，共同御敌吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3804,0,1);   --  1(1):[AAA]说: 可是天下群豪真的会听我号*令吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3805,69,0);   --  1(1):[洪七公]说: 这是关系到我们整个中华武*林生死存亡的大事，不论正*邪两道，都应听盟主号令。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3806,60,0);   --  1(1):[欧阳锋]说: 嘿嘿，听你小子的，总比让*人灭了好，既然技不如人，*还有什么说的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3807,195,0);   --  1(1):[???]说: 禀盟主，那倭人已侵占了我*东海钓鱼岛，并摆下五行大*阵，向我中华武林示威！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3808,0,1);   --  1(1):[AAA]说: 这五行大阵是什么东西？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3809,57,0);   --  1(1):[黄药师]说: 哼哼，倭人小小伎俩，还敢*班门弄斧？盟主，这五行大*阵共分五门，东方甲乙木，*南方丙丁火，西方庚辛金，*北方壬癸水，中央戊己土。*攻打此阵任何一门，其他门*都有呼应，万难破之。惟有*五门齐攻，方能克之。盟主*只需兵分五路，同时进攻，*必胜。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3810,0,1);   --  1(1):[AAA]说: 好，既如此，烦请东邪黄药*师、北丐洪七公，率领丐帮*、五岳剑派、峨嵋、昆仑、*崆峒等名门大派，进攻东门*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3811,69,0);   --  1(1):[洪七公]说: 老叫化得令。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3812,0,1);   --  1(1):[AAA]说: 南帝一灯大师、少林寺玄慈*大师、蒙古国师金轮法王、*吐蕃国师鸠摩智，率领天下*佛门弟子，进攻南门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3813,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，老衲得令。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3814,0,1);   --  1(1):[AAA]说: 西毒欧阳先生、日月神教任*先生、铁掌帮裘帮主、神龙*教洪教主率领日月神教、明*教、神龙教、五毒教、铁掌*帮等天下各路门派帮会，进*攻西门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3815,60,0);   --  1(1):[欧阳锋]说: 嘿嘿，好，邪魔外道都跟我*走吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3816,0,1);   --  1(1):[AAA]说: 武当掌门张三丰道长、中神*通王重阳道长、老顽童周伯*通率领武当派、全真教等道*家弟子，进攻北门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3817,5,0);   --  1(1):[张三丰]说: 老朽领命。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3818,245,1);   --  1(1):[???]说: 本盟主亲率众家兄弟，进攻*中门。*大家需求同存异，团结一心*，驱逐倭寇，扬我国威！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3819,0,2);   --  1(1):[AAA]说: 众人：*求同存异，团结一心，*驱逐倭寇，扬我国威！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,73,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [73]
    instruct_3(-2,72,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [72]
    instruct_3(-2,71,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
    instruct_3(-2,70,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
    instruct_3(-2,69,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
    instruct_3(-2,68,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
    instruct_3(-2,67,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
    instruct_3(-2,66,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
    instruct_3(-2,65,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
    instruct_3(-2,64,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
    instruct_3(-2,63,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
    instruct_3(-2,62,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
    instruct_3(-2,61,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
    instruct_3(-2,60,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
    instruct_3(-2,59,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
    instruct_3(-2,58,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
    instruct_3(-2,57,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
    instruct_3(-2,56,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
    instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
    instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
    instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
    instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,47,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,78,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [78]
    instruct_3(-2,77,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [77]
    instruct_21(90);   --  21(15):[钟灵]离队
    instruct_21(89);   --  21(15):[人厨子]离队
    instruct_21(88);   --  21(15):[祖千秋]离队
    instruct_21(87);   --  21(15):[苏荃]离队
    instruct_21(86);   --  21(15):[阿珂]离队
    instruct_21(85);   --  21(15):[贝海石]离队
    instruct_21(84);   --  21(15):[霍都]离队
    instruct_21(83);   --  21(15):[何铁手]离队
    instruct_21(82);   --  21(15):[宋青书]离队
    instruct_21(81);   --  21(15):[朱九真]离队
    instruct_21(80);   --  21(15):[张召重]离队
    instruct_21(79);   --  21(15):[岳灵珊]离队
    instruct_21(78);   --  21(15):[梅超风]离队
    instruct_21(77);   --  21(15):[萧中慧]离队
    instruct_21(76);   --  21(15):[王语嫣]离队
    instruct_21(75);   --  21(15):[陈家洛]离队
    instruct_21(74);   --  21(15):[霍青桐]离队
    instruct_21(73);   --  21(15):[任盈盈]离队
    instruct_21(72);   --  21(15):[田归农]离队
    instruct_21(66);   --  21(15):[小昭]离队
    instruct_21(63);   --  21(15):[程英]离队
    instruct_21(59);   --  21(15):[小龙女]离队
    instruct_21(58);   --  21(15):[杨过]离队
    instruct_21(56);   --  21(15):[黄蓉]离队
    instruct_21(55);   --  21(15):[郭靖]离队
    instruct_21(54);   --  21(15):[袁承志]离队
    instruct_21(53);   --  21(15):[段誉]离队
    instruct_21(52);   --  21(15):[花铁干]离队
    instruct_21(51);   --  21(15):[慕容复]离队
    instruct_21(49);   --  21(15):[虚竹]离队
    instruct_21(48);   --  21(15):[游坦之]离队
    instruct_21(47);   --  21(15):[阿紫]离队
    instruct_21(45);   --  21(15):[薛慕华]离队
    instruct_21(44);   --  21(15):[岳老三]离队
    instruct_21(38);   --  21(15):[石破天]离队
    instruct_21(37);   --  21(15):[狄云]离队
    instruct_21(36);   --  21(15):[林平之]离队
    instruct_21(35);   --  21(15):[令狐冲]离队
    instruct_21(29);   --  21(15):[田伯光]离队
    instruct_21(28);   --  21(15):[平一指]离队
    instruct_21(25);   --  21(15):[蓝凤凰]离队
    instruct_21(17);   --  21(15):[王难姑]离队
    instruct_21(16);   --  21(15):[胡青牛]离队
    instruct_21(9);   --  21(15):[张无忌]离队
    instruct_21(4);   --  21(15):[阎基]离队
    instruct_21(2);   --  21(15):[程灵素]离队
    instruct_21(1);   --  21(15):[胡斐]离队
    instruct_3(70,59,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [59]
    instruct_3(70,58,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [58]
    instruct_3(70,55,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [55]
    instruct_3(70,54,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [54]
    instruct_3(70,53,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [53]
    instruct_3(70,52,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [52]
    instruct_3(70,51,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [51]
    instruct_3(70,50,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [50]
    instruct_3(70,49,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [49]
    instruct_3(70,48,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [48]
    instruct_3(70,47,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [47]
    instruct_3(70,46,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [46]
    instruct_3(70,45,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [45]
    instruct_3(70,44,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [44]
    instruct_3(70,43,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [43]
    instruct_3(70,42,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [42]
    instruct_3(70,41,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [41]
    instruct_3(70,40,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [40]
    instruct_3(70,39,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [39]
    instruct_3(70,38,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [38]
    instruct_3(70,37,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [37]
    instruct_3(70,36,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [36]
    instruct_3(70,35,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [35]
    instruct_3(70,34,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [34]
    instruct_3(70,33,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [33]
    instruct_3(70,32,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [32]
    instruct_3(70,31,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [31]
    instruct_3(70,30,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [30]
    instruct_3(70,29,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [29]
    instruct_3(70,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [28]
    instruct_3(70,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [27]
    instruct_3(70,26,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [26]
    instruct_3(70,25,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [25]
    instruct_3(70,24,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [24]
    instruct_3(70,23,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [23]
    instruct_3(70,22,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [22]
    instruct_3(70,21,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [21]
    instruct_3(70,20,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [20]
    instruct_3(70,19,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [19]
    instruct_3(70,18,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [18]
    instruct_3(70,17,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [17]
    instruct_3(70,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [16]
    instruct_3(70,15,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [15]
    instruct_3(70,14,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [14]
    instruct_3(70,13,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [13]
    instruct_3(70,12,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [12]
    instruct_3(70,11,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [11]
    instruct_3(70,10,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [10]
    instruct_3(70,9,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [9]
    instruct_3(70,8,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [8]
    instruct_3(70,7,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [7]
    instruct_3(70,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [6]
    instruct_3(70,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [5]
    instruct_3(70,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [2]
    instruct_39(104);   --  39(27):打开场景钓鱼岛
--end

