--function oldevent_912()
    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,27,0,0,0,0,0,6078,6078,6078,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,28,0,0,0,0,0,7216,7216,7216,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,29,0,0,0,0,0,7002,7002,7002,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,30,0,0,0,0,0,7146,7146,7146,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_13();   --  13(D):重新显示场景
    instruct_30(49,35,26,35);   --  30(1E):主角走动49-35--26-35
    instruct_30(26,35,26,23);   --  30(1E):主角走动26-35--26-23
    instruct_1(3675,0,1);   --  1(1):[AAA]说: 令狐大哥，你已经找到任大*小姐啦。任教主、向大哥，*小弟有礼了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3676,234,0);   --  1(1):[???]说: 小兄弟，多日不见，近来可*好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3677,26,0);   --  1(1):[任我行]说: 哈哈，我认得你，在梅庄地*牢曾与老夫比武过招，小兄*弟武艺不错！老夫得以重见*天日，你功劳不小啊，哈哈*哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3678,0,1);   --  1(1):[AAA]说: 多谢任教主夸奖。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,35,0);   --  1(1):[令狐冲]说: …………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3679,26,0);   --  1(1):[任我行]说: 小兄弟，你功夫这么好，不*如再帮老夫一个忙。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3680,0,1);   --  1(1):[AAA]说: 任教主有事尽管吩咐。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3681,26,0);   --  1(1):[任我行]说: 我近日就要重上黑木崖，找*那东方不败算算旧帐，小兄*弟可否助我一臂之力？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3682,0,1);   --  1(1):[AAA]说: ＜听说日月神教教主东方不*败，已练成葵花宝典，武功*深不可测，这可是玩命的事* 啊……＞*这个……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3683,26,0);   --  1(1):[任我行]说: 哈哈哈，我不会让小兄弟白*出力的，你有什么要求，尽*管说吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3684,234,0);   --  1(1):[???]说: 据属下所知，这位小兄弟一*直在寻找十四天书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3685,26,0);   --  1(1):[任我行]说: 哦？哈哈哈……小兄弟想做*武林盟主啊，其志不小，后*生可畏呀，哈哈哈……这十*四天书，老夫没有，不过却*知道其中一本书《笑傲江湖*》的下落，如果小兄弟能帮*我除掉东方不败，我就将此*书下落告诉你，如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3686,0,1);   --  1(1):[AAA]说: 好，一言为定。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3687,26,0);   --  1(1):[任我行]说: 小兄弟果然爽快，我们四人*先上黑木崖，小兄弟你也尽*快赶到。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3688,234,0);   --  1(1):[???]说: 那东方不败武功深不可测，*小兄弟最好多带些武功高强*的人来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3689,73,0);   --  1(1):[任盈盈]说: 冲哥，我爹爹找东方不败算*帐，这是我们日月神教内部*的事，你……你还是别去了*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3690,35,0);   --  1(1):[令狐冲]说: 盈盈，对付东方不败，那是*艰危之极的事，我难道能置*身事外，忍心你去涉险？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3691,26,0);   --  1(1):[任我行]说: 哈哈哈，你们两个的情话还*没说够啊，等铲除了东方不*败，我让你们有的是时间说*情话，哈哈哈……我们走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(26,82,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[黑木崖]:场景事件编号 [82]
    instruct_3(26,96,0,0,0,0,0,7168,7168,7168,-2,-2,-2);   --  3(3):修改事件定义:场景[黑木崖]:场景事件编号 [96]
    instruct_3(26,97,0,0,0,0,0,7148,7148,7148,-2,-2,-2);   --  3(3):修改事件定义:场景[黑木崖]:场景事件编号 [97]
    instruct_3(26,83,0,0,0,0,911,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[黑木崖]:场景事件编号 [83]
    instruct_3(26,84,0,0,0,0,911,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[黑木崖]:场景事件编号 [84]
    instruct_3(26,85,0,0,0,0,911,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[黑木崖]:场景事件编号 [85]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

