--function oldevent_2()
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(14,1,0);   --  1(1):[胡斐]说: 小兄弟，再次造访，不知有*何见教？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,129) ==true then    --  9(9):是否要求加入?否则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(3,9,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [9]
        instruct_3(3,12,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [12]
        instruct_3(3,11,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [11]
        instruct_3(3,10,1,0,636,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [10]
        instruct_1(15,0,1);   --  1(1):[AAA]说: 我正在寻找一些书，要在江*湖上到处走动，胡大哥如果*不嫌弃，不妨与小弟同行，*说不定可以得到你想要的消*息。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(11,1,0);   --  1(1):[胡斐]说: 既然如此，恭敬不如从命。
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_20(0,36) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(12,1,0);   --  1(1):[胡斐]说: 你的队伍已满，我就直接去*小村吧。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(0,-2,0,0,0,0,0,0,0,0,0,-2,-2);   --  3(3):修改事件定义:场景[胡斐居]:当前场景事件编号
            instruct_3(70,5,1,0,101,0,0,5166,5166,5166,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [5]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_10(1);   --  10(A):加入人物[胡斐]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(0,-2,0,0,0,0,0,0,0,0,0,-2,-2);   --  3(3):修改事件定义:场景[胡斐居]:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(16,0,1);   --  1(1):[AAA]说: 没事，随便逛逛。
    instruct_0();   --  0(0)::空语句(清屏)
--end

