--function oldevent_233()
    instruct_1(614,0,1);   --  1(1):[AAA]说: 霍姑娘好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(615,74,0);   --  1(1):[霍青桐]说: 少侠近来一切可好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(616,0,1);   --  1(1):[AAA]说: 一人闯荡江湖，总是有些寂*寞。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(617,74,0);   --  1(1):[霍青桐]说: 少侠保护了我明教的圣物，*青桐愿陪少侠闯荡江湖。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(622,246,1);   --  1(1):[???]说: ＜喂，这位玩家，大美女送*上门，居然拒绝，有没有搞*错！……＞
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(618,247,1);   --  1(1):[???]说: 真是求之不得啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,61,1,0,975,0,0,7046,7046,7046,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [61]

    if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_10(74);   --  10(A):加入人物[霍青桐]
        do return; end
    end    --:Label1

    instruct_1(12,74,0);   --  1(1):[霍青桐]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(70,36,1,0,163,0,0,7004,7004,7004,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [36]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

