--function oldevent_328()
    instruct_1(1226,239,0);   --  1(1):[???]说: 多谢少侠救了家父一命。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1227,0,1);   --  1(1):[AAA]说: 宛儿姑娘，太客气了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1228,239,0);   --  1(1):[???]说: 这根金龙鞭，请少侠收下，*且莫推辞。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1229,0,1);   --  1(1):[AAA]说: 恩，好吧，多谢宛儿姑娘。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(51,1);   --  2(2):得到物品[金龙鞭][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,329,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

