--function oldevent_588()
    instruct_1(2556,247,1);   --  1(1):[???]说: 王姑娘好。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2557,76,0);   --  1(1):[???]说: 公子好。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(2,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2558,0,1);   --  1(1):[AAA]说: 王姑娘学识渊博，我想请王*姑娘助我一臂之力。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2559,76,0);   --  1(1):[???]说: 好，我正想和表哥在一起。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,51,1,0,977,0,0,6296,6296,6296,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [51]

    if instruct_20(19,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_10(76);   --  10(A):加入人物[王语嫣]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(12,76,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(70,27,1,0,167,0,0,6298,6298,6298,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [27]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
--end

