--function oldevent_943()
    instruct_3(-2,-2,1,0,0,0,0,2612,2612,2612,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(205,1);   --  2(2):得到物品[神杖][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,77,0,0,0,0,944,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [77]
    instruct_3(-2,78,0,0,0,0,944,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [78]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

