--function oldevent_820()
    instruct_1(3312,199,0);   --  1(1):[???]说: 这位少侠，上泰山来不知有*何见教？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3313,0,1);   --  1(1):[AAA]说: 原来这儿就是泰山啊，古人*曾说过”登泰山而小天下”*今日一见果然名不虚传．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3314,199,0);   --  1(1):[???]说: 好说，好说．***我泰山派立派以来，每年上*山朝拜者数以万计，多少人*都想到我泰山派拜师学艺．*我看，*你也是想来这拜师的吧？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(6,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_1(3317,0,1);   --  1(1):[AAA]说: 我不过是随便逛逛，欣赏一*下泰山的风光。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3315,0,1);   --  1(1):[AAA]说: 哈！哈！我还需要拜师？*有没有搞错啊！我看你拜我*为师还差不多．*不然这样好了，今儿个我心*情正好，就收你为徒．咱们*也不必行什麽拜师礼了．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3316,199,0);   --  1(1):[???]说: 小子！好大的口气！*我倒要看看你有多少斤两，*想叫我拜你为师！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(25,4,0,0) ==false then    --  6(6):战斗[25]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_37(-1);   --  37(25):增加道德-1
--end

