--function oldevent_200()

    if instruct_16(29,0,90) ==true then    --  16(10):队伍是否有[田伯光]否则跳转到:Label0
        instruct_26(1,3,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(1,4,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(1,5,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_1(444,29,1);   --  1(1):[田伯光]说: ＜这妞真标志啊……＞，这*位姑娘，独自一人在此，不*觉得寂寞吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(150,77,0);   --  1(1):[???]说: …………
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(445,29,1);   --  1(1):[田伯光]说: 姑娘不说话，那就是默认了*，我田伯光生平最见不得的*就是女人寂寞，我们……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(446,77,0);   --  1(1):[???]说: 呸！给我滚！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(447,29,1);   --  1(1):[田伯光]说: 哎，姑娘，咱们还没亲热亲*热，我怎么舍得走呢？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(448,77,0);   --  1(1):[???]说: 你们两个，一看就不是什么*好饼，再不滚，休怪本姑娘*不客气了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(449,0,1);   --  1(1):[AAA]说: 怎么连我也带上了？
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(132,3,0,0) ==false then    --  6(6):战斗[132]是则跳转到:Label1
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label1

        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(450,29,1);   --  1(1):[田伯光]说: 哎呦，一时出手重了，可怜*这姑娘闭月羞花之容了……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(208,1);   --  2(2):得到物品[金钥匙][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_37(-5);   --  37(25):增加道德-5
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(451,0,1);   --  1(1):[AAA]说: 这位姑娘，小生这厢有礼了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(452,77,0);   --  1(1):[???]说: 少侠好。我见少侠似乎愁眉*不展，可有什么为难之事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(453,0,1);   --  1(1):[AAA]说: 在下一直在江湖上奔波，寻*找一些东西，可惜至今也没*有找全。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(454,77,0);   --  1(1):[???]说: 找东西，好玩好玩，带我一*起去吧，啊，不，是本姑娘*来帮你找吧。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,111) ==true then    --  9(9):是否要求加入?否则跳转到:Label2
        instruct_1(455,248,1);   --  1(1):[???]说: 得红颜相伴，闯荡江湖，真*乃平生快事啊。
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_28(0,60,100,0,94) ==true then    --  28(1C):判断AAA品德60-100否则跳转到:Label3
            instruct_26(1,3,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
            instruct_26(1,4,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
            instruct_26(1,5,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
            instruct_3(104,64,1,0,978,0,0,7248,7248,7248,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [64]
            instruct_37(1);   --  37(25):增加道德1

            if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label4
                instruct_14();   --  14(E):场景变黑
                instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_13();   --  13(D):重新显示场景
                instruct_10(77);   --  10(A):加入人物[萧中慧]
                do return; end
            end    --:Label4

            instruct_1(12,77,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_3(70,39,1,0,169,0,0,7010,7010,7010,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [39]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
        end    --:Label3

        instruct_1(456,77,0);   --  1(1):[???]说: 哎呀，不行，我爸爸说了，*闯荡江湖要和正人君子在一*起，你……，还是算了吧。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_0();   --  0(0)::空语句(清屏)
--end

