--function oldevent_777()

    if instruct_16(35,6,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        instruct_1(3132,28,0);   --  1(1):[平一指]说: 治一人，杀一人。这是为了*维护生态平衡。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(3133,28,0);   --  1(1):[平一指]说: 阁下想必就是令狐公子吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3134,35,1);   --  1(1):[令狐冲]说: 正是在下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3135,28,0);   --  1(1):[平一指]说: 令狐公子，有人托我给你看*病，你伸手过来，老夫摸摸*你的脉象。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3136,0,0);   --  1(1):[AAA]说: 且慢。平大夫，在下听说平*大夫素有杀人名医的称号。*治一人，必须杀一人！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3137,28,0);   --  1(1):[平一指]说: 不错。但令狐少侠例外，因*为杀人这件事已经有人替他*办妥了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3138,0,1);   --  1(1):[AAA]说: 我倒想请问平大夫，治好一*人就要杀一人，那么治不好*又如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3139,28,0);   --  1(1):[平一指]说: 哼，这天底下就没有我平一*指治不好的病！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3140,0,1);   --  1(1):[AAA]说: 平大夫此言未免过于托大，*万一治不好呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3141,28,0);   --  1(1):[平一指]说: 哼，令狐公子，你伸手过来*，老夫摸摸你的脉象。。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3142,28,0);   --  1(1):[平一指]说: 这，这，这……你这伤势要*彻底治好，就算大罗金仙，*只怕也是难以办到，如能戒*酒、戒色、戒斗那么或许能*多活一二年。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3143,35,1);   --  1(1):[令狐冲]说: 平大夫，人生在世，会当畅*情适意，连酒也不能喝，女*人不能想，人家欺到头上不*能还手，还做甚么人？不如*及早死了，来得爽快。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3147,28,0);   --  1(1):[平一指]说: 令狐公子，你的病我虽然治*不了，但也不见得就是毫无*办法。听说少林易筋经是无*上内功宝典，也许可将你体*内数种内力化解。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3144,0,1);   --  1(1):[AAA]说: 平大夫，还记得刚才的话吗*？治不好，便如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3145,28,0);   --  1(1):[平一指]说: 你，你……治不好，要杀要*剐，系听尊便！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3146,247,1);   --  1(1):[???]说: 哈哈哈，没那么严重，在下*只想请平大夫加入我的队伍*，帮我一起寻找十四天书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3148,28,0);   --  1(1):[平一指]说: 好，我这就去小村！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(104,49,1,0,952,0,0,7228,7228,7228,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [49]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(93,2,0,0,0,0,782,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[少室山下]:场景事件编号 [2]
    instruct_3(70,29,1,0,115,0,0,5904,5904,5904,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [29]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3149,0,1);   --  1(1):[AAA]说: 令狐大哥，咱们上少林去碰*碰运气，说不定就能治好你*的病。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3150,35,0);   --  1(1):[令狐冲]说: 也好。
    instruct_0();   --  0(0)::空语句(清屏)
--end

