--function oldevent_600()
    instruct_27(3,6342,6348);   --  27(1B):显示动画
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2623,115,0);   --  1(1):[???]说: 逍遥派不肖弟子苏星河，拜*见本派新任掌门．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2624,49,1);   --  1(1):[虚竹]说: 老前辈行此大礼，*可折杀小僧了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2625,115,0);   --  1(1):[???]说: 师弟，你是我师父的关门弟*子，又是本派掌门．我虽是*师兄，却也要向你磕头！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2626,49,1);   --  1(1):[虚竹]说: 这个．．这个．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2627,115,0);   --  1(1):[???]说: 师弟，你真是福泽深厚．我*和丁春秋想这宝石指环，想*了几十年，始终都无法到手*，你却在一个时辰之内，便*受到师父的垂青．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2628,49,0);   --  1(1):[虚竹]说: 前辈拿去便是．这只指环，*小僧半点用处也没有．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2629,115,0);   --  1(1):[???]说: 师弟，你受师父临死时的重*托，岂能推卸责任？**师父将指环交给你，是叫你*除灭丁春秋那厮，是不是？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2630,49,1);   --  1(1):[虚竹]说: 正是．但小僧功行浅薄，*怎能当此重任？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2631,0,1);   --  1(1):[AAA]说: 苏前辈，这是怎麽回事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2632,115,0);   --  1(1):[???]说: 事情是这样子的．*本派乃逍遥派，师父收了我*和丁春秋两个弟子．*我师父有个规矩，因他所学　*甚杂，谁要做掌门，各种本　*事都要比试，不但比武，还　*得比琴棋书画．*但丁春秋於各种杂学一窍不*通，眼见掌门人无望，竟忽*施暗算将师父打落深谷，又*将我打得重伤．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2633,245,1);   --  1(1):[???]说: 这人真是可恶．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2634,115,0);   --  1(1):[???]说: 後来师父趁机诈死，*又设下了这个棋局，*想藉此找出悟性高的人．*立他为掌门，并传他功力，*将来好除去丁春秋这恶贼．**今天，我们终於出现了能破*解此珍珑的人，师父在传完*他功力後也仙逝了．*掌门师弟，我逍遥派的门户*就靠你清理了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2635,49,1);   --  1(1):[虚竹]说: 我是误打误撞的，并没有什*麽悟性．更何况我是少林弟*子，怎能改投别派．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2636,0,1);   --  1(1):[AAA]说: 贤弟，这位老前辈因为要传*你毕生功力而逝去，你还忍*心拒绝人家吗．况且，那丁*春秋也是个无恶不作，罪无*可赦的恶徒呀．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2637,49,1);   --  1(1):[虚竹]说: ．．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2638,0,1);   --  1(1):[AAA]说: 好，我看就这样了．*苏前辈，我们会去找那星宿*老怪，杀了他替你师父报仇
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2639,115,0);   --  1(1):[???]说: 老朽谢谢这位少侠的帮忙．***掌门师弟，此去路上一切要*小心，丁春秋那老贼行事卑*鄙．．．．*对了，我有一个徒弟医术高*明，人称”阎王敌”的薛神*医，你可以去找他帮忙．*见到他时只要出示掌门信物*的”七宝指环”即可．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,1,0,602,0,0,6522,6522,6522,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,0,1,0,601,0,0,6340,6340,6340,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_41(49,105,1);   --  41(29):虚竹得到物品天山六阳掌1
    instruct_41(49,75,1);   --  41(29):虚竹得到物品小无相功1
    instruct_41(49,200,1);   --  41(29):虚竹得到物品七宝指环1
    instruct_45(49,20);   --  45(2D):虚竹增加轻功20
    instruct_46(49,3000);   --  46(2E):虚竹增加内力3000
    instruct_47(49,60);   --  47(2F):虚竹增加攻击力60
    instruct_48(49,200);   --  48(30):虚竹增加生命200
    instruct_35(49,0,8,300);   --  35(23):设置虚竹武功0:天山六阳掌攻击力300
    instruct_35(49,1,98,300);   --  35(23):设置虚竹武功1:小无相功攻击力300
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_34(49,10);   --  34(22):虚竹增加资质10
    instruct_0();   --  0(0)::空语句(清屏)
--end

