--function oldevent_440()
    instruct_3(-2,1,1,0,440,0,0,1272,1272,1272,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,1,0,440,0,0,1272,1272,1272,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,1,0,440,0,0,1272,1272,1272,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,1,0,440,0,0,1272,1272,1272,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,9,1,0,440,0,0,1272,1272,1272,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,6,1,0,440,0,0,1272,1272,1272,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,1,0,440,0,0,1272,1272,1272,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,1,0,441,0,0,1272,1272,1272,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_17(-2,0,41,25,1324);   --  17(11):修改场景贴图:当前场景层0坐标29-19
    instruct_17(-2,0,42,25,1324);   --  17(11):修改场景贴图:当前场景层0坐标2A-19
    instruct_17(-2,0,43,25,1324);   --  17(11):修改场景贴图:当前场景层0坐标2B-19
    instruct_17(-2,0,44,25,1324);   --  17(11):修改场景贴图:当前场景层0坐标2C-19
    instruct_17(-2,0,45,25,1324);   --  17(11):修改场景贴图:当前场景层0坐标2D-19
    instruct_17(-2,0,46,25,1324);   --  17(11):修改场景贴图:当前场景层0坐标2E-19
    instruct_0();   --  0(0)::空语句(清屏)
--end

