--function oldevent_1050()
    instruct_1(3933,64,0);   --  1(1):[周伯通]说: 来来来，小兄弟，我教你一*个好玩的游戏．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3934,0,1);   --  1(1):[AAA]说: 什麽游戏？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3935,64,0);   --  1(1):[周伯通]说: 我老顽童独创的*”左右互搏之术”．**这是当年我被黄老邪关在桃*花岛十五年间，无聊时所创*出的武功．*要知在这十五年中，我苦无*对手拆招，只好左手和右手*打架．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3936,0,1);   --  1(1):[AAA]说: 左手怎能和右手打架？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3937,64,0);   --  1(1):[周伯通]说: 我假装右手是黄老邪，左手*是老顽童．右手一掌打去，*左手拆开之後还了一拳，就*这样打了起来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3938,0,1);   --  1(1):[AAA]说: 这功夫很难学吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3939,64,0);   --  1(1):[周伯通]说: 说难是难到极处，说容易也*容易之至．有的人一辈子都*学不会，有的人只需几天便*会了．好像越是聪明，越是*不成，看看你是否有这机缘**看着了．．．*第一课”左手画方，*右手画圆”．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3940,64,0);   --  1(1):[周伯通]说: 功夫是教你了，接下来就看*看你有没有这造化了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(235,1);   --  2(2):得到物品[左右互搏之术][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,1046,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

