--function oldevent_419()
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(94,2,1,0,420,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[长乐帮]:场景事件编号 [2]
    instruct_3(39,9,1,0,421,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[凌霄城]:场景事件编号 [9]
    instruct_3(39,5,1,0,388,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[凌霄城]:场景事件编号 [5]
    instruct_3(39,8,1,0,388,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[凌霄城]:场景事件编号 [8]
    instruct_3(39,7,1,0,388,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[凌霄城]:场景事件编号 [7]
    instruct_3(39,6,1,0,388,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[凌霄城]:场景事件编号 [6]
    instruct_0();   --  0(0)::空语句(清屏)
--end

