--function oldevent_1061()
    instruct_1(3964,44,0);   --  1(1):[岳老三]说: 你这小子，挺有两下子的，*过的了我的万鳄潭，很好．**咦！我看你手长足长，脑骨*後秃，腰胁柔软，跟我非常*像，真是学武的奇才．*快磕头，求我收你为弟子．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3965,0,1);   --  1(1):[AAA]说: 有没有搞错，看你呆头呆脑*的，还要我拜你为师．*我看你拜我为师还差不多．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3966,44,0);   --  1(1):[岳老三]说: 你这小子，上次仗着人多，*占了我们四大恶人的便宜，*这次咱俩单打独斗．好，你*若打的过我，我岳老二就拜*你为师．否则，你就拜我为*师．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3967,0,1);   --  1(1):[AAA]说: 奇怪，我怎麽听人家说南海*鳄神叫”岳老三”呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3968,44,0);   --  1(1):[岳老三]说: 是”岳老二”！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(90,4,0,0) ==false then    --  6(6):战斗[90]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3969,44,0);   --  1(1):[岳老三]说: 你这小子，资质果真不错，*我没看错眼．*来，快拜我岳老二为师．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3970,0,1);   --  1(1):[AAA]说: 岳老三，你自己说过的话都*忘了吗？你说打输我要拜我*为师的，怎麽忘了呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3971,44,0);   --  1(1):[岳老三]说: 拜就拜，我岳老二向来说话*算话．*你是我师父了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3972,0,1);   --  1(1):[AAA]说: 徒儿，你就跟为师的走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,50,1,0,958,0,0,6414,6414,6414,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [50]

    if instruct_20(25,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_1(3973,44,0);   --  1(1):[岳老三]说: 是．
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_10(44);   --  10(A):加入人物[岳老三]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(12,44,0);   --  1(1):[岳老三]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(70,33,1,0,129,0,0,6414,6414,6414,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [33]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

