--function oldevent_223()
    instruct_37(2);   --  37(25):增加道德2
    instruct_26(60,4,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,5,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,3,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_30(20,26,20,29);   --  30(1E):主角走动20-26--20-29
    instruct_30(20,29,15,29);   --  30(1E):主角走动20-29--15-29
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_1(516,0,1);   --  1(1):[AAA]说: 咦？这不是全真派的周老爷*子么？怎么好像中毒了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(517,64,0);   --  1(1):[周伯通]说: 乖乖，老顽童差点归西。你*是谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(518,0,1);   --  1(1):[AAA]说: 周老爷子怎么忘了，我们在*桃花岛上见过一面的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(519,64,0);   --  1(1):[周伯通]说: 你刚才进来的时候，有没有*看见好多蜘蛛？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(520,0,1);   --  1(1):[AAA]说: 有啊，我差点没被这些蜘蛛*咬到！现在已经被我消灭干*净了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(521,64,0);   --  1(1):[周伯通]说: 金轮那个秃驴呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(522,0,1);   --  1(1):[AAA]说: 什么金轮？我进来的时候没*看见别人啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(523,64,0);   --  1(1):[周伯通]说: 算他跑得快，哼！居然用蜘*蛛害我。这不知道是什么蜘*蛛，毒性如此厉害。多亏了*女娃娃的蜂针。你帮我赶走*了蜘蛛，也要谢谢你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(524,0,1);   --  1(1):[AAA]说: 我也是无意中路过此地。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(525,64,0);   --  1(1):[周伯通]说: 老顽童平生从不欠别人的，*既然你帮我赶跑了蜘蛛，我*就教你七十二路空明拳法吧*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(98,1);   --  2(2):得到物品[空明拳谱][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(526,64,0);   --  1(1):[周伯通]说: 哈哈，老顽童命大，死不了*。金轮这个臭贼秃，我要去*找他算帐。老顽童去也！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(527,247,1);   --  1(1):[???]说: ＜哇！这姑娘真美，好像神*  仙一般＞，姑娘你好
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(528,59,0);   --  1(1):[小龙女]说: 好
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(529,0,1);   --  1(1):[AAA]说: 姑娘是否也中了蜘蛛的毒？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(530,59,0);   --  1(1):[小龙女]说: 没有
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(531,0,1);   --  1(1):[AAA]说: 敢问姑娘芳名？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(532,59,0);   --  1(1):[小龙女]说: 他们都叫我小龙女。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(533,0,1);   --  1(1):[AAA]说: ＜这姑娘怎么冰冰冷冷的…*…＞姑娘要到哪里去，在下*送你一程如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(534,59,0);   --  1(1):[小龙女]说: 我要去找过儿，我自己找。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(535,0,1);   --  1(1):[AAA]说: 这姑娘真的好美啊，就是冰*冰冷冷的，让人难以接近，*不知道过儿是谁，会是她的*心上人么？谁这么有福气啊*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(19,24,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(20,4,1,0,1046,0,0,6154,6154,6154,-2,-2,-2);   --  3(3):修改事件定义:场景[百花谷]:场景事件编号 [4]
    instruct_3(21,10,1,0,1047,0,0,6158,6158,6158,-2,-2,-2);   --  3(3):修改事件定义:场景[黑龙潭]:场景事件编号 [10]
--end

