--function oldevent_298()
    instruct_26(40,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,12,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_1(998,13,0);   --  1(1):[谢逊]说: 范遥，你干什么去了？光明*顶怎么会变成这个样子？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(999,10,0);   --  1(1):[范遥]说: 你还说我！要不是你到处惹*是生非，咱明教也不会和六*大派结下这么大的仇！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1000,13,0);   --  1(1):[谢逊]说: 我，唉，我真是愧对明教啊*，我只有以死谢罪啦！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1001,10,0);   --  1(1):[范遥]说: 狮王不可！眼下大仇未报，*不可呀！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1002,0,1);   --  1(1):[AAA]说: 是啊，范右使所言极是，狮*王！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1003,13,0);   --  1(1):[谢逊]说: 又是你！你说吧，你助我明*教，有什么企图？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1004,0,1);   --  1(1):[AAA]说: 这个嘛，我要找一本书，名*叫《倚天屠龙记》。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1005,10,0);   --  1(1):[范遥]说: 此书乃我明教历代相传，不*可轻与外人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1006,0,1);   --  1(1):[AAA]说: 如今明教都已不复存在，何*言外人？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1007,10,0);   --  1(1):[范遥]说: 这……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1008,13,0);   --  1(1):[谢逊]说: 好，小子，只要你帮我明教*复仇，这本书就送给你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1009,0,1);   --  1(1):[AAA]说: 好，一言为定。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1010,13,0);   --  1(1):[谢逊]说: 剿灭六大派，就从最近的昆*仑派开始吧，我二人先去，*你尽快赶到。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,90,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [90]
    instruct_3(-2,94,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [94]
    instruct_3(68,18,0,0,0,0,0,5348,5348,5348,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [18]
    instruct_3(68,19,0,0,0,0,0,5290,5290,5290,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [19]
    instruct_3(68,17,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [17]
    instruct_3(68,20,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [20]
    instruct_3(68,21,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [21]
    instruct_3(68,22,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [22]
    instruct_3(68,23,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [23]
    instruct_3(68,24,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [24]
    instruct_3(68,25,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [25]
    instruct_3(68,26,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [26]
    instruct_3(68,27,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [27]
    instruct_3(68,28,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [28]
    instruct_3(68,29,0,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [29]
    instruct_3(68,0,0,0,0,0,299,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [0]
    instruct_3(68,14,0,0,0,0,299,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [14]
    instruct_3(68,15,0,0,0,0,0,5294,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [15]
    instruct_3(68,16,0,0,0,0,0,5334,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [16]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

